[{"query": "Is there a legend about a monster called the Hungry Wolf?", "cypher": "match (n:ENTITY{name:'hungry wolf'}) where n is not null return 1"}, {"query": "To use the distillation method to purify the acetylsalicylic acid, first of all you need to ask what is the boiling point of the banana?", "cypher": "match ((:ENTITY{name:'Bacillus subtilis'}) - [:Relationship{name:'boiling point'}]-> (q) return q.name"}, {"query": "What is the shortest path between the crazy cornfield and the officers and the boy on the third floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'crazy wheat seed'}) - [*..3]-(b:ENTITY{name:'officer and boy'})) return count ((p))"}, {"query": "The book is a collection of 13 high school tourism management exclusives: new information about the relationship between the two layers of tourism aesthetics.", "cypher": "match (n:ENTITY{name:'Higher education tourism management exclusives'}) - [:Relationship*1..2]->(x) where x.name<>'13' return distinct x.name"}, {"query": "Who looks as tall as Beck Mark, and what tags do these people each have?", "cypher": "The following is a list of all the different ways Beck Mark is credited in the database:"}, {"query": "Can you tell us about the five levels of Najib Chafik's four-level relationships, born in Bourgon?", "cypher": "match (n:ENTITY{name:'Najib Chafik'}) - [*1..4]->(x) where x.name<>'Bourgon' return distinct x.name limit 5"}, {"query": "Can you find me the senior national art dealer and his graduation school?", "cypher": "match (:ENTITY{name:'Senior National Art Identifier'}) <- [:Relationship{name:'profession'}]-(h),(h) - [:Relationship{name:'graduate college'}]->(q) return distinct h.name,q.name"}, {"query": "What kind of work is the famous monk's rumor?", "cypher": "match (:ENTITY{name:'renowned monk's legend'}) <-[:Relationship{name:'work'}]-(n) -[:Relationship{name:'category'}]->(h) return distinct h.name limit 1"}, {"query": "Help me find 10 species of ants.", "cypher": "match (:ENTITY{name:'subclass'}) <-[:Relationship{name:'subclass'}]-(m) return distinct m.name limit 10"}, {"query": "The temple of Taitus was built by which emperor?", "cypher": "match (:ENTITY{name:'Third Temple'}) - [:Relationship{name:'Founder'}]->(m) return distinct m.name"}, {"query": "What important events happened to the people of Leeds United?", "cypher": "match (:ENTITY{name:'Leeds United'}) <- [:Relationship{name:' belonging to a sports team'}]- ((h) - [:Relationship{name:' important event'}]->(p) return distinct p.name"}, {"query": "The story of the 12/3 bank robbery in Lima, Peru, and the hostage situation in the country.", "cypher": "match (:ENTITY{name:'12\u00b73 Peruvian Lima Bank robbery hostage situation'}) --(x) with x order by x.name return x.name limit 1"}, {"query": "The only thing that I can think of is that the only way to get rid of all the barriers is to get rid of the purest of all the barriers.", "cypher": "match (:ENTITY{name:'to remove all barriers to the path of pure Toroni'}) <- [:Relationship{name:'full name'}]-(m),(m) - [:Relationship{name:'alias'}]->(q) return distinct q.name limit 2"}, {"query": "Do you know what day is the national day of the UK?", "cypher": "match (:ENTITY{name:'UK'}) <- [:Relationship{name:'abbreviated as '}]-(x),(x) - [:Relationship{name:'National Day'}]->(q) return distinct q.name limit 1"}, {"query": "The first is to describe a cultural figure and his corresponding professional nature.", "cypher": "match (:ENTITY{name:'cultural person'}) <- [:Tag{name:'tag'}]-(h),(h) - [:Relationship{name:'profession'}]->(x) return h.name order by h.name,x.name limit 1"}, {"query": "Do you know some of the representative works of this Chichen Itza-born artist?", "cypher": "match (:ENTITY{name:'Zhi'}) <- [:Relationship{name:'birthplace'}]-(q) - [:Relationship{name:'representative work'}]->(n) return n.name order by n.name limit 5"}, {"query": "What do you know about the relationship names that are involved in the Five Levels of Hebei Funing?", "cypher": "The following pages link to The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns"}, {"query": "What is the English name for the resort?", "cypher": "match (:ENTITY{name:'resort'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'foreign name'}]->(n) return distinct n.name"}, {"query": "Can you summarize the quarrelsome veil in three articles?", "cypher": "match (:ENTITY{name:'swan's fight'}) --(p) with p order by p.name return p.name limit 3"}, {"query": "Can you tell me about the school at Yan'an University? I want you to tell me about 5 things.", "cypher": "match (:ENTITY{name:'Yuan University'}) <- [:Relationship{name:'Chinese name'}]-(n) - [:Relationship{name:'attribute'}]->(p) return p.name order by p.name limit 5"}, {"query": "The following five facts about Ahnash Jawad, a Qatari national, are available here:", "cypher": "match (n:ENTITY{name:'Ahnash Jawad'}) - [*]->(x) where x.name<>'Qatar' return distinct x.name limit 5"}, {"query": "Can you identify the five calligraphers? Where were they born?", "cypher": "match (:ENTITY{name:'scrivener'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'place of birth'}]->(n) return m.name, n.name limit 5"}, {"query": "Help me find two love stories.", "cypher": "match (:ENTITY{name:' love drama'}) <- [:Tag{name:' tag'}]-(m) return distinct m.name limit 2"}, {"query": "The secret of the grave is the Book. He is the priceless.", "cypher": "match (:ENTITY{name:'secret of the tomb'}) <- [:Relationship{name:'book name'}]- ((n) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "Can you please list the local companies in the camp?", "cypher": "match (p:ENTITY{location:' camp'}) return p.name"}, {"query": "What is the relationship between literary works and the three layers of the virtual platform?", "cypher": "match (n:ENTITY{name:'send a virtual person to the skies'}) - [*1..3]->(x) where x.name <> 'literature' return distinct x.name"}, {"query": "Please tell me about the Roshi Nursery in Shandong County.", "cypher": "match (:ENTITY{name:'Shanghai County Ro Bridge Nursery'}) --(m) return distinct m.name limit 1"}, {"query": "Can you search for local companies in Asia?", "cypher": "match (p:ENTITY{location:'space'}) return p.name"}, {"query": "I have a book published by the People's Press Agency, can you find me three books?", "cypher": "match (:ENTITY{name:'People's Publishing House'}) <- [:Relationship{name:'People's Publishing House'}]- ((n) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 3"}, {"query": "Do you know of a suspect named Zhukhua?", "cypher": "The following is a list of characters that appear in the game The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild"}, {"query": "Please tell me if you can find out 5 things about the next iteration of Zhang Jianping who is still in the 4th tier relationship.", "cypher": "match (n:ENTITY{name:'Shanghai Jiangyuan please continue to hold office'}) - [*1..4]->(x) where x.name<>'' return distinct x.name limit 5"}, {"query": "Have you heard about the specific case of the accident on the 10/1 Xi'an An Jia Road?", "cypher": "match (:ENTITY{name:'10\u00b71\u897f\u5ef6\u5b89\u67a3\u8d3e\u516c\u8def\u4ea4\u901a\u4e8b\u6545'}) --(x) with x order by x.name return x.name"}, {"query": "Do you know this person, Alexa Davies?", "cypher": "match (:ENTITY{name:'Alexa Davies'}) --(q) return distinct q.name"}, {"query": "I wonder who is the chief accountant of the Hellenic Institute of Economics?", "cypher": "match (x:ENTITY{name:'Chief Accountant of the Hellenic Institute of Finance'}) <- [:Relationship{name:'profession'}]-(p),(p) - [:Relationship{name:'Chinese name'}->(n) return distinct n.name"}, {"query": "I just watched The Adventures of Ding Dong 3: The Blue Lotus and the Mysterious Snowman with my son a few days ago, did you check the time of the premiere?", "cypher": "match ((:ENTITY{name:'Dingding Chronicles 3: Blue Lotus and the Mysterious Snowman'}) - [:Relationship{name:'Release time'}]-> (m) return m.name"}, {"query": "Can you tell me when the social media labels are running? Name three?", "cypher": "match (:ENTITY{name:' society'}) <- [:Tag{name:' tag'}]- ((m) - [:Relationship{name:' runtime'}]->(x) return distinct x.name limit 3"}, {"query": "I would like to know the personal profiles of the five people who worked in the Beijing Municipal Committee Party Schools in the four-tiered relationship of Kon Sang-mei.", "cypher": "match (n:ENTITY{name:'Con Gyan Mei'}) - [*1..5]->(x) where x.name<>'Peking City Committee Party School' return distinct x.name limit 5"}, {"query": "Are there any free places open from 09:00-17:00?", "cypher": "match (:ENTITY{name:'09:00-17:00'}) <- [:Relationship{name:'open hours'}]-(m), (m) -->(n) where n.name='free' return m is not null"}, {"query": "Can you recommend seven novels that are available on the Chinese website?", "cypher": "match (:ENTITY{name:'start point Chinese web'}) <- [:Relationship{name:'connecting platform'}]- (h) return h.name limit 7"}, {"query": "What are the main achievements of the graduates of Southeastern University?", "cypher": "match (:ENTITY{name:'Southeastern University'}) <- [:Relationship{name:' Graduate School'}]-(n),(n) - [:Relationship{name:' Major achievements'}]->(q) return distinct q.name limit 1"}, {"query": "What is the shortest relationship path between the Boxer armored personnel carrier and the Grey Bear armored personnel carrier on the second floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'boxer armored personnel carrier'}) - [*..2]-(b:ENTITY{name:'Grey Bear armored vehicle'})) return count ((p)"}, {"query": "What do you know about the molecular formula for the title citrine?", "cypher": "match (:ENTITY{name:'title siding'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'molecular form'}]->(q) return distinct q.name"}, {"query": "Please do you know of any software that supports WinXp/vista/win7/win8/2000/2003 systems?", "cypher": "The following is a list of the most commonly used and used Windows operating systems."}, {"query": "What are the different labels of the films that are available on the same company as the first love fighter? Please list them by the number of labels of each film, from small to large.", "cypher": "match (n:ENTITY{name:'first love warrior'}) - [:Relationship{name:'output company'}]->(:ENTITY) <- [:Relationship{name:'output company'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c"}, {"query": "Can you tell me where Happy Planet 1 was filmed?", "cypher": "match (:ENTITY{name:'Happy Planet1'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'Place of filming'}]->(n) return distinct n.name"}, {"query": "What are the main awards that Zhu Shih-hui, who is the head of the school's editorial board, and Liang Liang-ming have won?", "cypher": "match (:ENTITY{name:'Zhu Shih's \u7b11\u5bd2'}) <- [:Relationship{name:'School stickers general manager'}]- ((q) - [:Relationship{name:'main award'}]->(p) return distinct q.name limit 2"}, {"query": "Talk about a collection of records of growth from 0-18 years old?", "cypher": "match (:ENTITY{name:'0-18 years growth record'}) --(n) with n order by n.name return n.name"}, {"query": "Help me find a 5A scenic area in Zhouzhou, Henan Province.", "cypher": "match (:ENTITY{name:'Kocho City, Henan Province'}) <- [:Relationship{name:'City'}]-(m), (m) - [:Relationship{name:'Visitation level'}]->(n) where n.name='AAAAA level' return distinct m.name limit 1"}, {"query": "Can you find me six books published in 1998 by a Chinese agricultural publisher?", "cypher": "match (:ENTITY{name:'1998'}) <- [:Relationship{name:'publication time'}]-(m), (m) - [:Relationship{name:'publishing house'}]->(n) where n.name='China Agricultural Publishing House' return m.name limit 3"}, {"query": "The film is about a young boy who is forced to grow up in a house full of problems.", "cypher": "match (:ENTITY{name:'growing up'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'leading role'}]->(n) return distinct n.name"}, {"query": "Find out about five scientific software that Lock has in his possession, okay?", "cypher": "match (n:ENTITY{name:'Placed on lock'}) - [*]->(x) where x.name<>'science' return distinct x.name limit 5"}, {"query": "Help me find a group of women with a combined strength of more than three.", "cypher": "match (:ENTITY{name:'star'}) <- [:Relationship{name:'profession'}]-(m), (m) - [:Relationship{name:'number of members'}]->(n) where n.name>'3' return distinct m.name limit 1"}, {"query": "What about 199 pages of information about making toys with children that doesn't have more than three layers of relationships?", "cypher": "match (n:ENTITY{name:'doing toys with children'}) - [:Relationship*1..3]->(x) where x.name<>'199 page' return distinct x.name"}, {"query": "The first is to find out the profile of Cook Matt, a Canadian citizen, in no less than five levels of relationships.", "cypher": "match (n:ENTITY{name:'Cooke Matt'}) - [*1..5]->(x) where x.name<>'Canada' return distinct x.name limit 5"}, {"query": "Can you tell me the name of the relationship in the two layers of the red-leafed spider?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'green leaf spiny'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "What is the molecular formula of the drug known as succubi-pure?", "cypher": "match (:ENTITY{name:'bittermelon, puree, green pepper, pepper'}) <- [:Relationship{name:'drug alias'}]- ((m),(m) - [:Relationship{name:'molecular'}]->(n) return distinct m.name,n.name"}, {"query": "Can you list five labels of love that don't work?", "cypher": "match (:ENTITY{name:'love, unfruit'}) - [:Tag{name:'tag'}]-> (p) return distinct p.name limit 5"}, {"query": "Can you tell me three things about the park?", "cypher": "match (x:ENTITY{name:'Inh Lake Park'}) --(m) return distinct m.name limit 3"}, {"query": "What is the profession of Gao Xie Yong?", "cypher": "match (:ENTITY{name:'highly intelligent'}) <--(m),(m) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 1"}, {"query": "In addition to farmers, what are the four types of identity information that you can provide?", "cypher": "match (:ENTITY{name:'Ning-ch'}) --(m) with m order by m.name where m.name <> 'farmer' return distinct m.name limit 4"}, {"query": "So I heard that 13X molecule silicon is very useful, what is its wear rate?", "cypher": "match ((m:ENTITY{name:'13X molecular sieve'}) - [:Relationship{name:'absorption rate'}]-> (n) return n.name"}, {"query": "What are the national unwillingnesses?", "cypher": "MATCH (:ENTITY{name:' country level'}) <- [:Relationship{name:' non-hereditary level'}]- ((m) return m.name skip 0 limit 10"}, {"query": "What are the prices for tickets to the 2013 FTISLAND Beijing concert reported online?", "cypher": "The song was released on November 8, 2013 as the lead single from the album, \"Sexy\" by American record label RCA Records."}, {"query": "Please list the characters who have been dubbed in Hong Kong.", "cypher": "match (:ENTITY{name:'showdowns (Hong Kong) '}) --(p) return distinct p.name"}, {"query": "Do you have any entertainment works for young people? Find me 20 novels.", "cypher": "match (:ENTITY{name:'youth novel'}) <- [:Tag{name:'tag'}]- (mn) - [:Tag{name:'tag'}]->(n:ENTITY{name:'entertainment work'}) return mn.name limit 20"}, {"query": "You tell me which are the main departments of the Central School of Drama?", "cypher": "match (:ENTITY{name:'Central Theatre School'}) - [:Relationship{name:'Main Faculty'}]-> (h) return h.name order by h.name limit 1"}, {"query": "I need all the information about the Guangdong Moan Sea Erosion Protected Area approved in 2003. Can you give me five?", "cypher": "match (n:ENTITY{name:' Guangdong Tsuen-an Sea Erosion Provincial Nature Reserve'}) - [:Relationship*]->(x) where x.name <>'2003' return distinct x.name limit 5"}, {"query": "What is the chemical equation of FeS2?", "cypher": "match (:ENTITY{name:'FeS2'}) --(x) return distinct x.name"}, {"query": "What does it mean to not touch the door?", "cypher": "match (:ENTITY{name:'not touching'}) - [:Tag{name:'tag'}]-> (m) return distinct m.name"}, {"query": "Do you know which universities have English as their main department?", "cypher": "match (x:ENTITY{name:' English department'}) <- [:Relationship{name:' major department'}]- (m) return distinct m.name"}, {"query": "The following is a list of words that end with super 10000 words.", "cypher": "match (n:ENTITY{name:'The secret of the English vocabulary: super 10000 words'}) - [:Relationship*1..3]->(x) where x.name <>'Fan Cheng Yu' return distinct x.name"}, {"query": "I wonder if there are any good articles that focus on the Mapping Software Exchange platform?", "cypher": "match (p:ENTITY{name:' focused on machine mapping software exchange platform'}) <- [:Relationship{name:' content'}]-(h),(h) - [:Relationship{name:' excellent article'}]->(n) return distinct n.name"}, {"query": "There is an analog technology with the classification number O241.82-39, do you know the technical name?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Ask about the personal profile of the two-tiered relationship that Lonsaki Tulov, played by actor Yoshida Doudeng, has.", "cypher": "match (n:ENTITY{name:'\u9f99\u5d0e\u90c1\u592b'}) - [*1..2]->(x) where x.name <>' actor Yoshida Dudoich' return distinct x.name"}, {"query": "Do you know what the relationship is with the Anhui Forestry Vocational College on the 5th floor?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Anhui Forestry Vocational College'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "The book is a great book for children of all ages, and it is a great book for children of all ages.", "cypher": "match (p:ENTITY{name:'0~3 years old healthy parenting knows everything'}) --(m) with m order by m.name where m.name <> 'books' return m.name"}, {"query": "Can you get me three books for reading in Chinese literature?", "cypher": "The following is a list of characters that appear in the game The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Z"}, {"query": "Where did the spelling \"shi me\u00e8i\" come from?", "cypher": "match (:ENTITY{name:'z\u01d0m\u00e8i'}) <- [:Relationship{name:'spelling'}]- ((x) - [:Relationship{name:'from'}]->(p) return distinct p.name limit 1"}, {"query": "I learned that the Alexander III egg, also known as the Alexander III egg, is only 9.5 cm tall, can you help me find three more information about it?", "cypher": "match (n:ENTITY{name:'Alexander III's third century egg'}) -->(h) with h order by h.name where h.name <> '9.5 cm' and h.name <> 'in memory of Alexander III' return h.name limit 3"}, {"query": "What are the main ingredients of the 10 drinks?", "cypher": "match (:ENTITY{name:'drink'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) return m.name, n.name limit 10"}, {"query": "Tell me about the 10 biggest miners that consume this economic term?", "cypher": "match (:ENTITY{name:'10 big potters consumption'}) --(h) with h order by h.name where h.name <> 'economic term' return h.name"}, {"query": "MX video player with video image category?", "cypher": "match (:ENTITY{name:'MX video player'}) --(p) with p order by p.name where p.name <> 'video image' return p.name limit 1"}, {"query": "Do you know what the two-layer relationship is about the painting? Can you name three?", "cypher": "The following is a list of all the different ways Match path=(n) <- [:Relationship*2]-(p:ENTITY{name:'Drawing away'}) UNWIND relationships(path) AS rel RETURN rel.name limit 3"}, {"query": "Please tell me what installation project includes a shortcut to install the converter?", "cypher": "match (:ENTITY{name:'conversion installation shortcut'}) <- [:Relationship{name:'installation shortcut'}]- (n) return distinct n.name"}, {"query": "What other three professions do you know about this politician?", "cypher": "match (:ENTITY{name:'political figure'}) <- [:Tag{name:'tag'}]-(q),(q) - [:Relationship{name:'profession'}]->(m) return m.name skip 2 limit 3"}, {"query": "I need information about people who believe in communism in the three-tiered relationship of the Shinto community.", "cypher": "match (n:ENTITY{name:' in meeting'}) - [:Relationship*1..3]->(x) where x.name <> 'communism' return distinct x.name"}, {"query": "The book published by Gilin Literature Publishing introduced me to two books.", "cypher": "match (:ENTITY{name:'Gilin Literature Publishing House'}) <- [:Relationship{name:'Gilin Literature Publishing House'}]-(p) - [:Relationship{name:'Book name'}]->(n) return distinct n.name limit 2"}, {"query": "Please help me to introduce you to the 10 places to visit in Jilin Province, in the city of Matsuhara, in the province of Jilin.", "cypher": "match (:ENTITY{name:'Relationship{name:'Geographical location'}]-(h) -[:Relationship{name:'Famous attractions'}]->(n) where n.name <> 'East wall, West wall, North wall, South wall' return distinct n.name limit 10"}, {"query": "What is the name of a novel by a man named He Weiwei?", "cypher": "match (:ENTITY{name:'\u79be\u66ae'}) <- [:Relationship{name:'man's husband'}]- (n) return distinct n.name"}, {"query": "Is there anything that Kate Blanchett's partner has accomplished?", "cypher": "match (:ENTITY{name:'Kate Blanchett'}) <- [:Relationship{name:'partner'}]- ((h) - [:Relationship{name:'major achievement'}]->(m) return distinct m.name"}, {"query": "What happened to the 2010 Chinese Cultural Tourism Festival?", "cypher": "match (:ENTITY{name:'2010 China Liu Guoqiang Cultural Tourism Festival'}) --(m) with m order by m.name return m.name"}, {"query": "Which comedy action films has Martin Blaster been involved in producing?", "cypher": "The game is based on the film of the same name by the same name."}, {"query": "Find the content of the Shandong Rural Statistics Yearbook 2011 published by the Shandong Provincial Statistics Bureau.", "cypher": "match (n:ENTITY{name:'Santongo Rural Statistical Yearbook 2011'}) - [:Relationship*1..2]->(x) where x.name <> 'Santongo Provincial Statistical Office' return distinct x.name"}, {"query": "Where is the area of the natural village of Pingping Qingjiang? And what is the license plate code of this place? Tell me again about the main industry of this place.", "cypher": "match (:ENTITY{name:'Pingqing Qingjiang Natural Village'}) - [:Relationship{name:'Pingqing Qingjiang Natural Village'}) - >(n) return n.name as name union all match (:ENTITY{name:'Pingqing Qingjiang Natural Village'}) - [:Relationship{name:'Pingqing Qingjiang Natural Village'}) - [:Relationship{name:'Pingqing Qingjiang Natural Village'}->(m) return m.name as name union all match (:ENTITY{name:'Pingqing Qingjiang Natural Village'}) - [:Relationship{name:'Pingqing Qingjiang Natural Village'}->(r) return r.name as name"}, {"query": "Do you know the actors in the movie \"Extreme Warning\"?", "cypher": "match (:ENTITY{name:'Please be alert'}) --(m) return m.name order by m.name"}, {"query": "Do the Shanghai Day Care Centers have elevators? What is the architecture like?", "cypher": "match (x:ENTITY{name:' Shanghai Jade Daycare'}),(x) - [:Relationship{name:' configuration'}]-> (m), (x) - [:Relationship{name:' building'}]->(n) return m.name,n.name"}, {"query": "How deep was the epicenter of the famous 9/11 earthquake in Chapas, Mexico?", "cypher": "match ((:ENTITY{name:'11\u00b71 Mexico Chapas earthquake'}) - [:Relationship{name:'depth of the quake'}]-> (h) return h.name"}, {"query": "Did you know that the boxing program has a grand prize?", "cypher": "match (:ENTITY{name:'boxing'}) <- [:Relationship{name:'sporting project'}]-(m) - [:Relationship{name:'main prize'}]->(q) return distinct q.name limit 1"}, {"query": "Do you know which Japanese soldiers were killed in China during World War II?", "cypher": "match (:ENTITY{name:' Japanese officer killed in action in China during World War II'}) <- [:Relationship{name:' summary'}]- (m) return m.name"}, {"query": "The Chinese Automobile Culture Development Management Board is a Chinese government agency.", "cypher": "match (:ENTITY{name:'China Automotive Culture Development Management Board'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Tag{name:'label'}]->(q) return distinct q.name limit 1"}, {"query": "What is the number in Arabic numerals for the Roman numeral XC?", "cypher": "match (:ENTITY{name:'XC'}) <- [:Relationship{name:'Roman numerals'}]- (n) return distinct n.name"}, {"query": "When was the founding of the Cantonment Camping Cable Company Limited? Where is the headquarters?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'Hall of Residence'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [Relationship'}->(m) return m.name as name"}, {"query": "I'm not sure what kind of cars were built in 1954?", "cypher": "match (:ENTITY{name:'1954'}) <- [:Relationship{name:'time of creation'}]- (q) return q.name"}, {"query": "Please recommend 10 famous places where Shanshee Doong is located.", "cypher": "Match (:ENTITY{name:'Shanshanshan'}) <- [:Relationship{name:'Famous attractions'}]- (n) return n.name limit 10"}, {"query": "Can you tell me what the CPU main frequency parameters are for Intel type desktops?", "cypher": "match (:ENTITY{name:'Intel for type of desktop'}) <- [:Relationship{name:'chip manufacturer'}]-(m) - [:Relationship{name:'CPU mainframe'}]->(x) return distinct x.name"}, {"query": "Can you tell me about a peaceful career?", "cypher": "match (:ENTITY{name:'Wang and Wen'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 1"}, {"query": "Which study book is Xiaozhou coming from?", "cypher": "Match (:ENTITY{name:'Xiaoyang'}) <- [:Relationship{name:'author'}]- (x) return x.name The name of the game is the same as the name of the game itself."}, {"query": "I want to retrieve the tag information for the 1st Choice FTPPro V8.77085?", "cypher": "match (q:ENTITY{name:'1st Choice FTPPro V8.77085'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "The main achievement of the author is the novel \"The Love of the Midnight\".", "cypher": "match (:ENTITY{name:' middle novel \u7532\u5348\u4e4b\u604b\u3002'}) <- [:Relationship{name:' major achievement'}]- (n) return n.name order by n.name limit 3"}, {"query": "Do you know the types of relationships within the four layers of the renewable energy profession?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:'new energy specialist'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "What do people born in Yueyang County do?", "cypher": "match (:ENTITY{name:'\u5cb3\u9633\u53bf'}) <- [:Relationship{name:'place of birth'}]- ((m) - [:Relationship{name:'profession'}]->(q) return distinct m.name"}, {"query": "Where are the high brake lights installed?", "cypher": "match (:ENTITY{name:' high brake light'}) - [:Relationship{name:' installation location'}]->(m) return distinct m.name"}, {"query": "Could you please tell me the name of the company registered under number 612700100027135?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "The three-tiered relationship of Iranzi Jean Claude, who played football for me?", "cypher": "match (n:ENTITY{name:'Iranzi Jean Claude'}) - [*1..3]->(x) where x.name<> 'football' return distinct x.name"}, {"query": "The person who graduated from Guangzhou Central Medical School, what is his profession? Can you tell me 5 things?", "cypher": "match (:ENTITY{name:'Canton Medical College'}) <- [:Relationship{name:'Graduate College'}]- ((q),(q) - [:Relationship{name:'Profession'}]->(x) return x.name skip 1 limit 5"}, {"query": "The Chinese Taiwanese and Malaysian citizens are all cooks.", "cypher": "match (:ENTITY{name:'Malaysia, China, Taiwan'}) <- [:Relationship{name:'nationality'}]- ((m) - [:Relationship{name:'profession'}]->(x) return distinct x.name"}, {"query": "I love hearing Chinese stories, can you tell me what kind of stories they are?", "cypher": "match ((:ENTITY{name:'Chinese story'}) - [:Relationship{name:'type'}]-> (p) return p.name"}, {"query": "What is the weight of the car at 864 horsepower/ton?", "cypher": "match (:ENTITY{name:'864 horsepower/hp'}) <- [:Relationship{name:'weight to'}]- (n) return distinct n.name"}, {"query": "I want to check all the labels of the 1.5 star Samsung I9100 4.0 ROM?", "cypher": "match (:ENTITY{name:'1.5 Samsung I9100 4.0 ROM'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "The two-tiered relationship of Yuskov, who is 171 cm tall, is described in the article.", "cypher": "match (n:ENTITY{name:'Yuskov'}) - [:Relationship*1..2]->(x) where x.name <>'171 cm' return distinct x.name"}, {"query": "I'm curious about this compound called 2-acetylheptyl (III) nitrate, what is its CAS NO?", "cypher": "match ((:ENTITY{name:'2-ethyl sulfate ((III) '}) - [:Relationship{name:'CASNO'}]-> (n) return n.name"}]