[{"query": "In which publishing houses did Zhang's books appear?", "cypher": "match (:ENTITY{name:'Zhang Merzen'}) <- [:Relationship{name:'author'}]-(n) - [:Relationship{name:'publisher'}]->(q) return distinct q.name limit 2"}, {"query": "Can you give me a list of the names of the relationships involved in the two layers of the GUI?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'classic'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Do you know what the $120 series is?", "cypher": "match (:ENTITY{name:'120-yuan series'}) --(n) with n order by n.name return n.name"}, {"query": "Can you tell me about the kindergartens in the centre of Shanpa River Town?", "cypher": "match (:ENTITY{name:'Children's daycare centre in the town of Shanpa River'}) --(m) return distinct m.name"}, {"query": "Please list 4 and what is the second level of the label relationship with the fruit commune?", "cypher": "match (n) <- [:Tag*2{name:'tag'}]- ((p:ENTITY{name:'Jawberry Jam Community'}) return distinct n.name limit 4"}, {"query": "I'm not sure if you can tell me where the company is that produces the main product of the car trunk?", "cypher": "match (:ENTITY{name:'Taxide'}) <- [:Relationship{name:'main product'}]- ((q),(q) - [:Relationship{name:'located in '}]->(m) return m.name order by m.name limit 5"}, {"query": "If you tag the number 13, what else can you type besides language?", "cypher": "match (:ENTITY{name:'13[number]'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'language' return q.name"}, {"query": "I would like to know about five personal details of the relationship between the Maltese footballer Curuana Christian 1-6?", "cypher": "match (n:ENTITY{name:'Curuana Christian'}) - [*1..6]->(x) where x.name <> 'Curuana Christian, Maltese footballer\u3002' return distinct x.name limit 5"}, {"query": "Find four historical institutions and their dates of construction.", "cypher": "match (:ENTITY{name:'historical institution'}) <--(m), (m) - [:Relationship{name:'time of construction'}]->(n) return m.name, n.name limit 4"}, {"query": "What ship is designed for 100 people?", "cypher": "match (:ENTITY{name:'100 people'}) <- [:Relationship{name:'compiled'}]- (p) return distinct p.name"}, {"query": "Please tell me 10 occupations of this man, who was born in May 1971.", "cypher": "match (:ENTITY{name:'May 1971'}) <- [:Relationship{name:'date of birth'}]-(p),(p) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 10"}, {"query": "What other positions did Ding Zhiqing, formerly the deputy secretary of the Party Committee of the Public Security Bureau of the Yangtze City District, hold?", "cypher": "match (:ENTITY{name:'\u4e01\u4e2d\u79cb[former Vice-Secretary of the Party Committee of the Public Security Bureau of the City of Shenzhen]'}) - [:Relationship{name:'Career'}]-> (n) with n order by n.name where n.name <> 'Former Vice-Secretary of the Party Committee of the Public Security Bureau of the City of Shenzhen' return n.name"}, {"query": "What chemical is C9H13NO2?", "cypher": "match (:ENTITY{name:'C9H13NO2'}) <- [:Relationship{name:'molecular'}]- (h) return distinct h.name"}, {"query": "What are some of the works that you represent? Can you list five?", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'represents work'}]->(h) return distinct h.name limit 5"}, {"query": "I'm a musician and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician, and I'm a musician.", "cypher": "match (n:ENTITY{name:' Grace has come'}) - [:Relationship*1..2]->(x) where x.name <>'open' return distinct x.name"}, {"query": "I'm not sure if I'm ready to put my modern language in a bunch of curly hair.", "cypher": "match (:ENTITY{name:'\u4e00\u6210'}) --(x) with x order by x.name where x.name <> 'modern speech' return x.name"}, {"query": "The youngest of the three, Yayoi, is a young man who is very young and has a very strong sense of humor.", "cypher": "match (:ENTITY{name:'0-3 years old Yayoi Sakura'}) --(h) with h order by h.name return h.name limit 10"}, {"query": "What are the top 5 science fiction stories on the Chinese-language Internet?", "cypher": "match (p:ENTITY{name:'science fiction'}) <--(x) -->(q:ENTITY{name:'start point Chinese web'}) return x.name limit 5"}, {"query": "What does it mean to be encountered? Where did it come from?", "cypher": "match (:ENTITY{name:' encounter'}) - [:Relationship{name:' interpretation'}]->(n) return n.name as name union all match (:ENTITY{name:' encounter'}) - [:Relationship{name:' from'}]->(m) return m.name as name"}, {"query": "The first book in the series, The Land of Zero Beginnings: The Art of the Relationship between the Two Layers of the Earth, is published by Routledge.", "cypher": "match (n:ENTITY{name:'zero start date: X'}) - [:Relationship*1..2]->(x) where x.name <>'16' return distinct x.name"}, {"query": "What are the five professions that graduates of the University of Southern China are engaged in?", "cypher": "match (:ENTITY{name:'Cantonese University of China'}) <- [:Relationship{name:' Graduate School'}]-(p) - [:Relationship{name:'Career'}]->(n) return distinct n.name limit 5"}, {"query": "What is the name of the river that has a catchment area of 2,543 square kilometers?", "cypher": "match (:ENTITY{name:'2543 square kilometres'}) <- [:Relationship{name:'area of the watershed'}]- ((h) - [:Relationship{name:'alias'}]->(p) return distinct p.name"}, {"query": "The song that provided the lyrics for the next song reminds me of my five messages.", "cypher": "match (n:ENTITY{name:'remember you asked me to leave you'}) - [*]->(x) where x.name <>'Machin' return distinct x.name limit 5"}, {"query": "Which characters are associated with the third layer of the tagline of the anime?", "cypher": "The following is a list of characters that appear in the game."}, {"query": "Tell me about the five personal profiles of the 79kg Dmitrovic Boban in the four-tier relationship?", "cypher": "match (n:ENTITY{name:'Dmitrovic Boban'}) - [*1..4]->(x) where x.name <>'79 kg' return distinct x.name limit 5"}, {"query": "The recent China Infrastructure Forum 2011 was a huge exhibition, and you know how many people came?", "cypher": "match ((:ENTITY{name:'2011 China Infrastructure International Forum and the Chicken Expo'}) - [:Relationship{name:' number of visitors'}]-> (n) return n.name"}, {"query": "I'm not sure if you can find three of the 126 related descriptions.", "cypher": "match (:ENTITY{name:'126 [Chinese Internet Technology Company]'}) --(n) with n order by n.name return n.name limit 3"}, {"query": "Do you know what chemical has the CAS number 3308-02-9?", "cypher": "match (h:ENTITY{name:'3308-02-9'}) <- [:Relationship{name:'CASNo'}]- (n) return distinct n.name"}, {"query": "Can you list information about the Beijing Virchingan Asia Laboratory Equipment Co., Ltd., a three-tiered relationship started in 1999 with a registered capital of 10.2 million yuan?", "cypher": "match (n:ENTITY{name:'Beijing Weichen Asia Laboratory Equipment Limited'}) - [*1..3]->(x) where x.name<>'Beijing Weichen Asia Laboratory Equipment Limited was founded in 1999 with a registered capital of 10.2 million yuan. The company is headquartered in Fuli Palace brand base in Nanchang Xin Palace, Fongtai District, Beijing."}, {"query": "I'm looking for a 12306 ticket assistant software feature tag to send me?", "cypher": "match (:ENTITY{name:'12306 order assistant [order assistant software]'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'software' return p.name"}, {"query": "What is the shortest relationship path between the two levels of the Ordeal Vocational Technical College and the Purple Rose Vocational Technical College?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Orthodox Vocational Technical College'}) - [*..2]-(b:ENTITY{name:'Purple Rose Vocational Technical College'})) return count ((p)"}, {"query": "Can you immediately say the CAS number for 2-metha-4-triethyl-methyl-methacrylate acetate?", "cypher": "match ((:ENTITY{name:'2-metha-4-triethyl methyl-methyl-methacrylate acetate'}) - [:Relationship{name:'CAS number'}]-> (p) return p.name"}, {"query": "I want a two-tier relationship about the personal situation of Yann Resseguier, born on August 3, 1984.", "cypher": "match (n:ENTITY{name:'Resseguier Yann'}) - [*1..2]->(x) where x.name <> 'August 3, 1984' return distinct x.name"}, {"query": "Help me find three swimmers from the country.", "cypher": "match (:ENTITY{name:' swim'}) <- [:Relationship{name:' sporting project'}]-(m), (m) - [:Tag{name:' tag'}]->(n) where n.name='athlete' return distinct m.name limit 3"}, {"query": "What are the top five awards for films made in Taiwan, China?", "cypher": "match (:ENTITY{name:'China Taiwan'}) <- [:Relationship{name:' location of filming'}]-(p),(p) - [:Relationship{name:' main award'}]->(q) return q.name order by q.name limit 5"}, {"query": "Do you know Yue Yi [Chairman of the Guangxi Writers Association]? Tell me about Yue Yi.", "cypher": "match (:ENTITY{name:'Kyu Yue [President of the Guangxi Writers Association]'}) --(h) return distinct h.name"}, {"query": "In the meantime, I'm going to share some of the work of Lee Young-ho and Yang Yi-nan.", "cypher": "match (n:ENTITY{name:' and XYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZYZ"}, {"query": "Paul Borel, the master of fantasy fashion, was born in Paris on April 20, 1879, and spent his life and career in Paris.", "cypher": "match (:ENTITY{name:'Paul Borel, the master of fantasy fashion born 20 April 1879, lived and worked in Paris\u3002'}) <-[:Describe{name:'description'}]-(p) -[:Relationship{name:'represents works'}]->(n) return distinct n.name"}, {"query": "What kind of person is Dan Aykroyd?", "cypher": "match (:ENTITY{name:'Dan Aykroyd'}) --(q) with q order by q.name return q.name"}, {"query": "Do you have all the types of relationships that are involved in the three levels of Kinshasa beauty school?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Kinzar beauty school'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 4"}, {"query": "What are the three shooting games on which platforms?", "cypher": "match (:ENTITY{name:'shooting game'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'game platform'}]->(n) return m.name,n.name limit 3"}, {"query": "Tell me about the introduction of Weckstr\u00f6m John, born in Helsinki, to no less than three levels of relationships.", "cypher": "match (n:ENTITY{name:'Weckstr?m John'}) - [*1..3]->(x) where x.name <>'Helsinki' return distinct x.name"}, {"query": "Can you list five Scottish athletes in the MacArthur Pat 4?", "cypher": "match (n:ENTITY{name:'MacArthur Pat'}) - [*1..4]->(x) where x.name <>'MacArthur Pat, Scottish athlete\u3002' return distinct x.name limit 5"}, {"query": "Inquire about the four-layer relationship between the drugs that contain the main ingredients of the drug, such as North Star, Straight Star, and Sunflower.", "cypher": "match (n:ENTITY{name:'town pill'}) - [*1..4]->(x) where x.name<>'town pill' is a drug with the main ingredients of northern lilac, straight lilac, and starry sky."}, {"query": "Did you know there was an accident in the Tibet's Tumba-Tumba county?", "cypher": "match (:ENTITY{name:'Tibetan Ink Bamboo County'}) <- [:Relationship{name:' low-key'}]- (q) return q.name"}, {"query": "Can you tell me about the political background of this man, his position and other information?", "cypher": "The name of the union is the same as the name of the union, but the name of the union is different from the name of the union."}, {"query": "I'm looking for six domestic and international ships, what are their Chinese names?", "cypher": "match (:ENTITY{name:'ship'}) <- [*]-(m), (m) - [:Relationship{name:'Chinese name'}]->(n) return distinct m.name, n.name limit 6"}, {"query": "What number is capitalized as \"Pick up the bag\"?", "cypher": "match (:ENTITY{name:'snaps'}) <- [:Relationship{name:'scapular'}]- (m) return distinct m.name"}, {"query": "Tell me about the next time you have a question about the three other tags besides language and literature.", "cypher": "match (n:ENTITY{name:'subscriber group Yuzana's remaining questions are in the same order'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'language' and h.name <> 'literature' return distinct h.name limit 3"}, {"query": "Do you know about the Richter's sea turtle? Find out what else is there to know about the other seven species of sea turtle in the 2nd layer.", "cypher": "match (:ENTITY{name:'Richie's sea turtle'}) - [:Relationship*1..2]->(p) where p.name <> 'Autumn sea turtle' return p.name limit 7"}, {"query": "I would like to know what is the height of a person whose date of birth is unknown?", "cypher": "match (:ENTITY{name:'unknown'}) <- [:Relationship{name:'date of birth'}]- ((p),(p) - [:Relationship{name:'length'}]->(q) return distinct q.name limit 5"}, {"query": "Can you find two other UPS alternatives besides the Chinese Communications Society?", "cypher": "match (:ENTITY{name:'UPS'}) --(m) with m order by m.name where m.name <> 'China Telecommunications Association' return distinct m.name limit 2"}, {"query": "Can you find me 5 foreigners named Florea Daniel in 5th level relationships?", "cypher": "match (n:ENTITY{name:'Florea Daniel'}) - [*1..5]->(x) where x.name<>'Florea Daniel' return distinct x.name limit 5"}, {"query": "The book is a summary of the book for me, 0-2 year old baby book: the message of toys?", "cypher": "match (:ENTITY{name:'0-2 years old babybook: toy'}) --(p) with p order by p.name return p.name"}, {"query": "I want the other 6 information in the 3 layers of the Deck battery made by the American company Eastpin Manufacturing.", "cypher": "match (:ENTITY{name:'Deck Battery'}) - [*1..3]-(p) where p.name <> 'American Hostel Manufacturing Company' return p.name limit 6"}, {"query": "Can you tell me the chemical formula for C22H17ClN2 is silicon?", "cypher": "The following is a list of the most commonly used types of chemical compounds."}, {"query": "Do you know how many companies are in Jinan?", "cypher": "match (p:ENTITY{location: Jin'an'}) return count ((p)"}, {"query": "I have four dancers, and they are from different countries.", "cypher": "match (:ENTITY{name:'dancer'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'place of birth'}]->(n) return m.name,n.name limit 4"}, {"query": "Can you tell me about Marani Michele, the person who has five levels of relationships?", "cypher": "match (n:ENTITY{name:'Marani Michele'}) - [*1..5]->(x) where x.name<>'person' return distinct x.name limit 5"}, {"query": "Where is the Ban Chien-Kuen Eco-Tourist Resort? What time is it open?", "cypher": "match (:ENTITY{name:'Relationship{name:'geographical location'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'open hours'}]->(m) return m.name as name"}, {"query": "I'm going to be the first to write a book about the three authors who represented me.", "cypher": "match (:ENTITY{name:'writer'}) <- [:Relationship{name:'profession'}]-(q) - [:Relationship{name:'representative work'}]->(x) return distinct x.name limit 3"}, {"query": "Tell me about the literary works and the literary materials in the relationship between the six layers of Li Tung Poetry?", "cypher": "match (n:ENTITY{name:' and Li Tu's poems'}) - [*1..6]->(x) where x.name <> 'literary work' return distinct x.name limit 5"}, {"query": "What role did Shizuka play?", "cypher": "match (:ENTITY{name:'\u5fd7\u6751\u5999'}) - [:Relationship{name:'acting'}]-> (m) return distinct m.name"}, {"query": "Do you know who is in the second tier of the label relationship with Kong?", "cypher": "match (n) <- [:Tag*2{name:'tag'}]- ((p:ENTITY{name:'Kong Hyun Hyun'}}) return distinct n.name"}, {"query": "You're secretly telling me about the sinking of a fishing boat on the 10th of November 28th?", "cypher": "match (:ENTITY{name:'11.28 Dalyane's first fishing boat sink'}) --(p) with p order by p.name return p.name limit 10"}, {"query": "Who is representing the three swords?", "cypher": "match (n:ENTITY{name:'P'}) <- [:Relationship{name:'representative work'}]- (p) return distinct p.name"}, {"query": "The first 10 results of the 1905 Russian Revolution?", "cypher": "match (:ENTITY{name:'1905 Russian Revolution'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 10"}, {"query": "The 2012 Healthcare Expo was a big eye opener, and I wondered who was hosting it?", "cypher": "match ((:ENTITY{name:'2012 Healthcare Exhibition'}) - [:Relationship{name:' Hosted by'}]-> (q) return q.name"}, {"query": "Do you know how many limited liability companies (investments or holdings) there are? Name three?", "cypher": "match (:ENTITY{name:' limited liability company ((investment or holding by natural persons) '}) <- [:Relationship{name:' nature of company'}]- (m) return m.name limit 3"}, {"query": "I'm curious if you can find all the relevant information about Ren Shanping?", "cypher": "match (n:ENTITY{name:'\u4efb\u5c1a\u5cf0'}) - [*]->(x) where x.name <> 'teacher' return distinct x.name limit 5"}, {"query": "Can you tell me about the previous profession of Mikhalkov, N.S.?", "cypher": "match (:ENTITY{name:'Mikhalkov, N.S.'}) - [:Relationship{name:'profession'}]-> (h) return h.name order by h.name limit 1"}, {"query": "What exhibitions are there in 2012-08-16?", "cypher": "match (:ENTITY{name:'2012-08-16'}) <- [:Relationship{name:' time of development'}]- (n) return n.name"}, {"query": "Can you list me five relationships that are within the two layers of the Yueyang Mountain Scenic Area?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Yueyang Mountain Scenic Area'}) UNWIND relationships(path) AS rel return rel.name limit 5"}, {"query": "What is the name of the TV series called The King's Island of the Wiggly Wiggly?", "cypher": "match (:ENTITY{name:'Relationship{name:'other translations of names'}}) - (m) return m.name"}, {"query": "What books are there by author Ding Yong-jong, edited by Deng Xiaoping? Can you tell me which publisher published them?", "cypher": "match (:ENTITY{name:'\u4e01\u6c38\u751f\u3001\u4e16'}) <- [:Relationship{name:' author'}]-(h),(h) - [:Relationship{name:' publisher'}]->(q) return distinct h.name,q.name"}, {"query": "What are the types of minerals in perovskite and what are their main uses?", "cypher": "match (:ENTITY{name:'petroleum'}) - [:Relationship{name:'mineral type'}]->(n) return n.name as name union all match (:ENTITY{name:'petroleum'}) - [:Relationship{name:'main use'}]->(m) return m.name as name"}, {"query": "Do you know the movie The Thief of Zelda? What other information besides the director of Zelda, please find the other 7 information in layer 2", "cypher": "match (:ENTITY{name:' thief astar'}) - [:Relationship*1..2]->(p) where p.name <> 'Chu\u539f' return p.name limit 7"}, {"query": "What are the event labels involved in the snowmobile deaths of climbers in Yunnan?", "cypher": "match (q:ENTITY{name:'10\u00b71 Yunnan Happas snow mountaineer slide death accident'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "I heard that the 0280D005BNHC filter has been upgraded with new technology, how accurate is the filtering?", "cypher": "The following is a list of the most commonly used filters:"}, {"query": "Help me find the films that are being released by the eight film producers and tell me their release times.", "cypher": "match (:ENTITY{name:'eighty-one film production company'}) <- [:Relationship{name:'production company'}]-(h),(h) - [:Relationship{name:'production time'}]->(q) return distinct h.name,q.name"}, {"query": "Can you give me a list of the first events of the year?", "cypher": "match (:ENTITY{name:' first round'}) <- [:Relationship{name:' first round'}]- (x) return distinct x.name"}, {"query": "What would you label 1 Contre 100?", "cypher": "match (:ENTITY{name:'1 Contre 100'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "What fish are distributed in the Hong Kong-Australia-Taiwan area?", "cypher": "match (:ENTITY{name:'Hong Kong and the Australian Capital Territory'}) <- [:Relationship{name:' distribution'}]- ((m) return m.name"}, {"query": "I want to know about the high-power transverse CO2 laser and its applications in the other 6 pages of this book, published by the University of Technology of China Press.", "cypher": "match (:ENTITY{name:' High-power cross-flow CO2 lasers and their applications'}) - [*1..2]-(p) where p.name <> 'University of Technology of China Press' return distinct p.name limit 6"}, {"query": "Can you recommend a novel that is a classic?", "cypher": "Match (:ENTITY{name:'Relationship{name:'art style'}}) - (p) return p.name"}, {"query": "Do you know what Major Ray is doing?", "cypher": "match (x:ENTITY{name:'Rei Chao Kang'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'profession'}]->(q) return distinct q.name"}, {"query": "Can you list the 20 species of vertebrates that live under the door?", "cypher": "match (n:ENTITY{name:'Relationship{name:'door'}]- (mn) return mn.name limit 20"}, {"query": "Do you know how he expresses the river lights in English?", "cypher": "match (:ENTITY{name:'riverlight'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'foreign name'}]->(q) return distinct q.name"}, {"query": "What are the labels of the 1.2080 steel bands? Can you name three?", "cypher": "match (p:ENTITY{name:'1.2080 steel'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 3"}, {"query": "The film starring Fredrik Forster helped me find it.", "cypher": "Match (:ENTITY{name:'Frederick Forrester'}) <- [:Relationship{name:'starring'}]- (mn) return mn.name"}, {"query": "Do you know anything about the monkey Jozy's book, The Great Blood Monster?", "cypher": "match (:ENTITY{name:'000 heavy blooded evil soul'}) --(q) with q order by q.name where q.name <> 'Monkey Jozy' return q.name"}, {"query": "Tell me, is there any other category of banana bags in Shanghai besides the oil and banana?", "cypher": "match (n:ENTITY{name:'Shanghai banana bean bag'}) -[:Relationship{name:'category'}]->(h) where h.name <> 'oil bean' and h.name <> 'banana' return distinct h.name limit 2"}, {"query": "The first 10 articles on the rice tree are listed here.", "cypher": "match (:ENTITY{name:'Oreo tree'}) --(x) return x.name order by x.name limit 10"}, {"query": "What are the actors who play the role of the Goddess Red Cherry 6? Please tell me one.", "cypher": "match (:ENTITY{name:'Cherry 6'}) --(p) return p.name limit 1"}, {"query": "What else do you know about the Qing Dynasty other than what was published in the Huang Wen Press?", "cypher": "match (:ENTITY{name:'those things in the Qing Palace'}) - [*1..3]-(p) where p.name <> 'Huawei Publishing House' return p.name limit 10"}, {"query": "Can you name some of the animals that have spinal cord injuries? Can you name five?", "cypher": "match (h:ENTITY{name:'Relationship{name:'gate'}]) - (q) return distinct q.name limit 5"}, {"query": "What is C13H10BrCI2O2PS?", "cypher": "match (n:ENTITY{name:'C13H10BrCI2O2PS'}) --(x) return distinct x.name"}, {"query": "In five words, what is beyond the three dimensions?", "cypher": "match (:ENTITY{name:'exceeding three limits'}) --(h) with h order by h.name return h.name limit 5"}, {"query": "Do you know what chemical materials are used in the products of the Gucci Company?", "cypher": "match (:ENTITY{name:'Relationship{name:' manufacturer'}]- (n) return distinct n.name"}, {"query": "Tell me about the personal profile of this person, who is called Xifu, in Chinese, in the four levels of relationships?", "cypher": "match (n:ENTITY{name:'Xian's'}) - [*1..4]->(x) where x.name<>'Xian's' return distinct x.name limit 5"}, {"query": "Which of Lee's works is representative?", "cypher": "match (:ENTITY{name:' Lee Jong-town'}) - [:Relationship{name:' representing work'}]-> (h) return distinct h.name"}, {"query": "What does C8H9CINO5PS stand for?", "cypher": "match (:ENTITY{name:'C8H9CINO5PS'}) --(x) return distinct x.name"}, {"query": "Please tell me what is the work of director Liu Yiyang?", "cypher": "match (:ENTITY{name:'\u65e5\u9633'}) <- [:Relationship{name:'director'}]- (m) return distinct m.name"}, {"query": "The three professions that graduates of the University of Mizoram are engaged in", "cypher": "match (:ENTITY{name:'Sino University'}) <- [:Relationship{name:'Graduate School'}]-(n) - [:Relationship{name:'Profession'}]->(q) return distinct q.name limit 3"}, {"query": "I want to know about the personal situation of Ambassador Georges in Cameroon in the second level of relations.", "cypher": "match (n:ENTITY{name:'Ambassa Georges'}) - [:Relationship*1..2]->(x) where x.name<>'Cameroon' return distinct x.name"}, {"query": "The following are three jobs that can be done by a professional male member of the Professional Lighting Designers Association (PLDA):", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(m) - [:Relationship{name:'profession'}]->(q) where q.name <> 'Association of Professional Lighting Designers (PLDA) Professional member' return distinct q.name limit 3"}, {"query": "I'm going to be a part of the project, but I'm not going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project.", "cypher": "match (n:ENTITY{name:'Zan Chong; third generation Chong's family name'}) - [:Relationship*1..2]->(x) where x.name<>'Seven\u7edd' return distinct x.name"}, {"query": "The song is a cover of the song \"Sweet Dreams\" by the band The Beatles.", "cypher": "match (:ENTITY{name:'Reprise of the song 'Missing Waterfalls' released in 2013 as a solo EP: Love Your Heart'})"}, {"query": "I'm going to be writing a blog about my artwork, and I'm going to be writing about my artwork.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <> 'artwork' return distinct x.name"}, {"query": "Can you tell me the top five achievements of Xu Jinping?", "cypher": "match (x:ENTITY{name:' Xu\u9526'}) - [:Relationship{name:' Major achievements'}]-> (m) with m order by m.name return m.name limit 5"}, {"query": "Can you explain to me what the main achievement of this person who owns Rush, Leessang, and Blues is?", "cypher": "match (:ENTITY{name:'RushLeessang blues'}) <- [:Relationship{name:'represents work'}]-(n) - [:Relationship{name:'main achievements'}]->(q) return q.name order by q.name limit 10"}, {"query": "What's the matter with 30,000 tons?", "cypher": "match (:ENTITY{name:'30000'}) <--(n) return n.name The name of the match is"}, {"query": "Please describe the Golden Horse Award for Taiwanese Cinema.", "cypher": "match (:ENTITY{name:'Taiwanese Film Golden Horse Award'}) --(n) return distinct n.name"}, {"query": "What is the name of a photograph taken in 1909?", "cypher": "match (:ENTITY{name:'1909'}) <- [:Relationship{name:'Year of filming'}]- (p) return p.name"}, {"query": "Did you have trouble telling me that Italian Salviato Simone's profile is no more than six levels of relationships?", "cypher": "match (n:ENTITY{name:'Salviato Simone'}) - [*1..6]->(x) where x.name <>'Italy' return distinct x.name limit 5"}, {"query": "Could you provide a profile of the five-star football player Baines Kitson in the fourth tier of relationships?", "cypher": "match (n:ENTITY{name:'Baines Kitson'}) - [*1..4]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "Please tell me who is the host of the 5th Spring Home Expo 2012 in Hyogo?", "cypher": "match ((:ENTITY{name:'2012 Fifth Spring Home Expo in Hubei'}) - [:Relationship{name:'host unit'}]-> (m) return m.name"}, {"query": "Can you name one representative work written by a Canadian citizen?", "cypher": "match (:ENTITY{name:'Canada'}) <- [:Relationship{name:'nationality'}]- ((n) - [:Relationship{name:'representative work'}]->(m) return distinct m.name limit 1"}, {"query": "Do you know what the taste of beef is like?", "cypher": "Match ((:ENTITY{name:'sand tea beef'}) - [:Relationship{name:'taste'}]-> (n) return n.name"}, {"query": "Can you tell us about the romance of the house?", "cypher": "match (m:ENTITY{name:' Romantic house full'}) --(q) return q.name skip 3"}, {"query": "The article is about the book \"The pregnancy synchronization guidelines for October\" and the book \"The pregnancy synchronization guidelines for October\".", "cypher": "match (:ENTITY{name:'October pregnancy synchronization guidance overall'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'publication' return p.name limit 1"}, {"query": "Can you find me two species of mosquitoes and describe them?", "cypher": "match (:ENTITY{name:'Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "Do you know what nicknames people born in Zhuzhou, Henan have?", "cypher": "match (:ENTITY{name:'Canton of Shenzhen, Henan Province'}) <- [:Relationship{name:'place of birth'}]- ((x),(x) - [:Relationship{name:'alias'}]->(q) return distinct q.name limit 10"}, {"query": "Do you know how many silicon cores have a working temperature of -10 tons + 100 degrees Celsius? Can you list five?", "cypher": "The temperature of the water is about 100\u00b0C."}, {"query": "Do you know anything about the inner ties involved in the Beijing Youth Palace?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Peking City Youth Palace'}) UNWIND relations(path) AS rel RETURN rel.name"}, {"query": "Please help me find the 10 poems of Li Wei. Where did they all come from?", "cypher": "match (:ENTITY{name:'Lee White'}) <- [*]-(m), (m) - [:Relationship{name:'work originated from'}]->(n) return m.name, n.name limit 10"}, {"query": "I'm not sure if you're familiar with the name of the movie, but I'm not sure if you're familiar with the name of the movie.", "cypher": "match (:ENTITY{name:'Nanjing'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'representing work'}]->(x) return distinct x.name limit 5"}, {"query": "The book is a poem about the relationship between the two worlds, and the story of the two worlds in which the city is destroyed by the night.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'publication' return distinct x.name"}]