[{"query": "Besides a topographic landscape, can you tell me five things you know about the two levels of the West Hills Hole?", "cypher": "match (:ENTITY{name:'Western Hills Hole'}) - [*1..2]->(p) where p.name <> 'topographic landscape' return distinct p.name limit 5"}, {"query": "I asked if the author of the book was a cripple, what was his nickname?", "cypher": "match (:ENTITY{name:'spoonful'}) <- [:Relationship{name:'author'}]-(m),(m) - [:Relationship{name:'spoonful'}]->(x) return distinct x.name limit 1"}, {"query": "Can you recommend a few 512MB phones?", "cypher": "match (:ENTITY{name:'512MB'}) <- [:Relationship{name:'body memory'}]- (p) return distinct p.name"}, {"query": "I'm looking for information on the relationship between Yue Da and Yong Uncle Satong Yue Zhen Mountain, who gave twelve questions to his eight-day-long Minshuang 2nd level.", "cypher": "match (n:ENTITY{name:'With the eternal uncle Satoshi Yuriyama, the twelve-pointed star of his eight-days's journey'}) - [:Relationship*1..2]->(x) where x.name<>'' return distinct x.name"}, {"query": "Can you name the five Chinese words that are used in Chinese?", "cypher": "match (x:ENTITY{name:'Hank'}) <- [:Relationship{name:'ethnic group'}]- ((m) - [:Relationship{name:'word'}]->(p) return distinct p.name limit 5"}, {"query": "Do you have a description of the drug within the 2-layer relationship of the medical drug MAPPAN?", "cypher": "match (n:ENTITY{name:'Mapu'an'}) - [:Relationship*1..2]->(x) where x.name <> 'medicine' return distinct x.name"}, {"query": "Can you tell me which relationships are covered in the three layers of the Natural Disaster Knowledge Guide?", "cypher": "The following pages link to The Unknowns:"}, {"query": "I'm going to have to ask you about this Chinese man, his representative work, do you have any information?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(n),(n) - [:Relationship{name:'representative work'}]->(x) return n.name,x.name skip 3 limit 1"}, {"query": "Can you tell me the author of this book for children who start reading in English?", "cypher": "match (:ENTITY{name:'Children's English reading for beginners'}) <- [:Relationship{name:'book name'}]- ((p) - [:Relationship{name:'author'}]->(n) return distinct n.name"}, {"query": "What is the flagship model of the best selling 09 MX 2.5 automatic?", "cypher": "match (x:ENTITY{name:'09 model of the Mazda 2.5 automatic flagship'}) --(p) with p order by p.name where p.name <> 'on sale' return p.name"}, {"query": "What labels do 10,000 scientific problems entail outside of organizational institutions? (list ten)", "cypher": "match (:ENTITY{name:'10000 scientific puzzles'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'organization' return m.name limit 10"}, {"query": "Help me find out the author of the book, Xu Yong, about the principles of industrial communication technology and the other 7 steps in applying them in the 3 layers of this book.", "cypher": "match (:ENTITY{name:' Industrial communication technology principles and applications'}) - [*1..3]-(p) where p.name <> '\u8bb8\u52c7' return distinct p.name limit 7"}, {"query": "What is the shortest relationship path between the two layers of chicken and the chicken of the plant?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'sweet potatoes'}) - [*..2]-(b:ENTITY{name:'sweet potatoes'})) return count ((p)"}, {"query": "I'm going to tell you about the three 09 new wedding dresses.", "cypher": "match (:ENTITY{name:'09 new wedding dress'}) - [:Tag{name:'label'}]-> (h) with h order by h.name return h.name limit 3"}, {"query": "The school has 23 PhDs and 1 professional degree, what are its characteristics?", "cypher": "match (:ENTITY{name:'23(first level subject),1 ((special degree) '}) <-[:Relationship{name:'doctorate'}]-(q) -[:Relationship{name:'attribute'}]->(m) return m.name skip 1 limit 3"}, {"query": "The book is a collection of short stories, which are written by the author himself.", "cypher": "match (n:ENTITY{name:'subject'}) -[:Relationship*1..2]->(x) where x.name<>'' return distinct x.name"}, {"query": "Which of the five famous places that are open from 8:00 to 16:30 is good?", "cypher": "match (:ENTITY{name:'8:00 to 16:30'}) <- [:Relationship{name:'open hours'}]- ((q),(q) - [:Relationship{name:'famous attractions'}]->(p) return distinct p.name limit 5"}, {"query": "Do you know the name of the Chinese marshal general awarded the full record you are looking at?", "cypher": "match ((:ENTITY{name:'The full record of the award of the Chinese Marshal General's Medal'}) - [:Relationship{name:' alias'}]-> (h) return h.name"}, {"query": "Do you know the name of the band that Mark and Travis formed after LINK182 broke up?", "cypher": "match (:ENTITY{name:'LINK182 formed after Mark and Travis broke up'}) <- [:Relationship{name:'band'}]- (x) return distinct x.name"}, {"query": "I want to know more about what is the West Bank?", "cypher": "match (:ENTITY{name:'swimming'}) --(m) return m.name order by m.name"}, {"query": "Do you remember when the 2011 Chinese Football Association Amateur League was held?", "cypher": "match ((:ENTITY{name:'2011 Chinese Football Association Amateur League'}) - [:Relationship{name:'time of holding'}]-> (h) return h.name"}, {"query": "The first round of the political exam in the A-Level in the state of Hubei in the autumn of 2015 was held in the city of Hubei.", "cypher": "match (:ENTITY{name:'05\u79cb\u542f\u4e1c\u9ad8\u8003\u653f\u6cbb\u4e00\u8f6e A'}) --(m) with m order by m.name return distinct m.name skip 1 limit 5"}, {"query": "What happened on November 11, 2014?", "cypher": "match (:ENTITY{name:'November 11, 2014'}) <- [:Relationship{name:'time of event'}]- (q) return distinct q.name"}, {"query": "What is the shortest path between the two layers of the net and the net of the net?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'financial newsnet[website]'}) - [:Relationship*..2]-(b:ENTITY{name:'he is healthy and healthy'})) return count ((p)"}, {"query": "The year in which the house of the Yuletide Monk was built?", "cypher": "match (:ENTITY{name:'\u7389\u6545\u5c45'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'created time'}]->(q) return distinct q.name"}, {"query": "Please tell me which unit is hosting the 4th Hebei Provincial Skin Science and Exchanges?", "cypher": "match (:ENTITY{name:' the fourth Hebei Provincial Skin Science and Education Conference'}) <- [:Relationship{name:' Chinese name'}]- ((h) - [:Relationship{name:' host unit'}]->(x) return distinct x.name limit 1"}, {"query": "Help me find two chicken dishes.", "cypher": "match (:ENTITY{name:' chicken'}) <- [:Relationship{name:' main ingredient'}]-(m) return distinct m.name limit 2"}, {"query": "Is it possible that I understand ((2012) researching English reading comprehension literacy 100 [high score]?", "cypher": "match (:ENTITY{name:'(2012) researching English reading comprehension literacy 100 articles [high score]'}) --(q) with q order by q.name return q.name"}, {"query": "The story of the couple is based on the story of the famous Chinese poet, who was born in the year of the same name.", "cypher": "match (:ENTITY{name:' for wine [\u79cb\u8a69\u4f5c]'}) - [:Relationship{name:' date of creation'}]-> (m) return distinct m.name"}, {"query": "The article was written by a journalist from the South African government, who wrote a blog about the 10/15 Zambia coal mine conflict.", "cypher": "match (:ENTITY{name:'10\u00b715 Zambia coal mining conflict'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 1"}, {"query": "Is there really a company called Insec Technology [Beijing] Limited?", "cypher": "match (n:ENTITY{name:'Insec Technologies [Beijing] Ltd'}) where n is not null return 1"}, {"query": "What is the meaning of the word \"guaba\"?", "cypher": "match (:ENTITY{name:'guapo'}) - [:Relationship{name:'source'}]->(n) return n.name as name union all match (:ENTITY{name:'guapo'}) - [:Relationship{name:'interpretation'}]->(m) return m.name as name"}, {"query": "Why not put a label on 3-methacrylate-5-methylmethacrylate?", "cypher": "match (:ENTITY{name:'3-methacrylate-5-methyl methacrylate'}) - [:Tag{name:'label'}]-> (m) with m order by m.name return m.name"}, {"query": "Do you know which earthquake hit Zhejiang Province in the Dehaong-guang Autonomous Region?", "cypher": "match (:ENTITY{name:'Dehong-dong people's autonomous region of Zhejiang Province'}) <- [:Relationship{name:'quake location'}]- (n) return n.name"}, {"query": "The book is published by the publisher of the magazine Electrical Principles.", "cypher": "match (:ENTITY{name:'Electrical engineering principles' (including the exam syllabus) (plain) '}) <- [:Relationship{name:' book name'}]- ((p) - [:Relationship{name:' publisher'}]->(n) return distinct n.name limit 3"}, {"query": "Can you tell me the name of the landlord?", "cypher": "match (x:ENTITY{name:' roommates'}) - [:Relationship{name:' alias'}]-> (p) return distinct p.name"}, {"query": "Can you tell me which schools have an international ministry?", "cypher": "match (:ENTITY{name:' international department'}) --(p) return p.name skip 2 This is a list of all the different ways P.N.A. is credited in the database."}, {"query": "Apart from badminton, what are the other two labels that Mr. Kawamura owns?", "cypher": "match (:ENTITY{name:'Karaoke'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'featherball' return p.name limit 2"}, {"query": "Can you name three teaching and research workers and introduce them?", "cypher": "match (:ENTITY{name:'teacher and researcher'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'describe'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Help me find 20 countries with AAAAA-level sites", "cypher": "match (:ENTITY{name:'AAAAA level'}) <- [:Relationship{name:'attraction level'}]-(h) with h order by h.name limit 20? return h.name"}, {"query": "Please help me find the work of director Sun Hee", "cypher": "match (:ENTITY{name:'Sun Ice, Wang Jian as '}) <- [:Relationship{name:' Director'}]-(m) return distinct m.name"}, {"query": "Do you know which tourist attractions are open all year round? Can you name five?", "cypher": "match (:ENTITY{name:'open all year round'}) <- [:Relationship{name:'open hours'}]- ((p) - [:Relationship{name:'famous attractions'}]->(n) return distinct n.name limit 5"}, {"query": "The 10th Millennium Cures are not included in the list of other achievements, including the Chinese Medical Experts Association.", "cypher": "match (:ENTITY{name:'Kiliang Qu'ish'}) <- [:Relationship{name:'also known as '}]-(h) - [:Relationship{name:'main achievements'}]->(q) where q.name <> 'Federation of Chinese and Arabic Experts' return distinct q.name limit 10"}, {"query": "Who among you is a medical graduate from Sapporo University?", "cypher": "match (:ENTITY{name:'Sappo Medical University'}) <- [:Relationship{name:' Graduate School'}]-(m), (m) - [:Relationship{name:' Profession'}]->(n) where n.name='author' return m.name"}, {"query": "I wonder what the names of all the novels featured in the Files of Myrna are?", "cypher": "match (:ENTITY{name:'Mine is hidden in the file'}) <- [:Relationship{name:'author'}]- ((m) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name"}, {"query": "The species is also known as the \"Snowbird\", which is a species of flowering plant in the family Sphingidae.", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'distribution area'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'protection level'}]->(m) return m.name as name"}, {"query": "Can you name five magazines that have a 16th edition?", "cypher": "match (x:ENTITY{name:'big 16 open'}) <- [:Relationship{name:'open'}]- (q) return q.name limit 5"}, {"query": "Do you know how much the total prize money is in a $200,000 contest? Can you name five?", "cypher": "match (:ENTITY{name:'200,000 dollars'}) <- [:Relationship{name:'total prize'}]- (m) return m.name limit 5 The game is played with the player's name and the name of the player."}, {"query": "Please tell me what the name of the rule issued on 2014-06-04 is?", "cypher": "match (:ENTITY{name:'2014-06-04'}) <- [:Relationship{name:' time of issue'}]- (p) return distinct p.name"}, {"query": "The following is a list of the works that have been published by the following authors:", "cypher": "match (n:ENTITY{name:' to say that the semantic research literature is integrated: current and contemporary volumes'}) - [:Relationship*1..2]->(x) where x.name <> 'writer's publisher' return distinct x.name"}, {"query": "Who is the main character in Malay?", "cypher": "Match (:ENTITY{name:'Malaysian [1998 American film]'}) - [:Relationship{name:'starring'}]->(n) return n.name"}, {"query": "Can you tell us about Jamie, N.A.", "cypher": "match (:ENTITY{name:'Jamie, N\u00b7A.'}) --(h) return distinct h.name"}, {"query": "The following is a list of six information that I have found in the three layers of Mirror Dream Life.", "cypher": "match (:ENTITY{name:'Mironma Tenshi'}) - [*1..3]-(p) where p.name <> 'Kyu-nan Fine Arts Publishing' return p.name limit 6"}, {"query": "Apart from the two works of hospital jokes and the playful youth, can you tell me about three other representative works of Julin Yang?", "cypher": "match (n:ENTITY{name:'Julian'}) - [:Relationship{name:'representative work'}]->(h) with h order by h.name where h.name <> 'hospital joke' and h.name <> 'young fool' return h.name limit 3"}, {"query": "Please help me understand about the Yukon.", "cypher": "match (q:ENTITY{name:'Oakland'}) --(x) return x.name order by x.name"}, {"query": "What chemical is the EINECS number 210-921-1?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What is the scope of foreign names with composite numbers?", "cypher": "match (h:ENTITY{name:'Composite number'}) <- [:Relationship{name:' foreign language name'}]-(m),(m) - [:Relationship{name:' scope of application'}]->(p) return distinct p.name"}, {"query": "Please tell me about the hotel in Baok Lake Landscape.", "cypher": "match (:ENTITY{name:'Pack Lake Landscape Hotel'}) --(q) return q.name order by q.name"}, {"query": "The first is that the former secretary of the Five Poetry Rites, who was later seen by Blue Creek, gave information about the three-tier relationship.", "cypher": "match (n:ENTITY{name:'payment former secretary late out blue stream see you later'}) - [:Relationship*1..3]->(x) where x.name <>'five-line' return distinct x.name"}, {"query": "I would like to know the details of the 101+1 bombing collection?", "cypher": "match (:ENTITY{name:'101+1 explosion compilation'}) --(p) with p order by p.name where p.name <> 'game work' return p.name"}, {"query": "What chemicals can dissolve in carbon dioxide, titanium dioxide and tetrahydrogen dioxide?", "cypher": "match (:ENTITY{name:'di-sulfur carbon, titanium and tetrahydrate carbon'}) <- [:Relationship{name:'solved in'}]- (h) return h.name"}, {"query": "Do you know which of the representative works of Indian Chinese artists are representative of the Chinese art?", "cypher": "match (:ENTITY{name:'swinging'}) <- [:Relationship{name:'swinging'}]- (p) return p.name order by p.name"}, {"query": "What are the main works of Wang Daqiang?", "cypher": "match (:ENTITY{name:'Chang Daqiang[Qing Dynasty scholar]'}) - [:Relationship{name:'main work'}]->(m) return distinct m.name"}, {"query": "The first book in the series, Baby Enlightenment Stories for 0-3 year olds, is a mystery?", "cypher": "match (x:ENTITY{name:'0-3 years old baby enlightenment story collection'}) --(q) with q order by q.name return distinct q.name skip 1 limit 1"}, {"query": "I'm going to ask you about a piece called CB, what is it called?", "cypher": "match (:ENTITY{name:'CB'}) <- [:Relationship{name:'work alias'}]- (p) return p.name"}, {"query": "Can you tell me what the relationship names are in the two layers involved? Can you tell me three?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Hayanama Twin Stars'}) UNWIND relationships(path) AS rel return distinct rel.name limit 3 The name of the game is unknown"}, {"query": "Do you know what the East Jiangsu International Tourist Resort is like? Please tell me about it.", "cypher": "match (h:ENTITY{name:'Tongjiangsun International Tourist Resort'}) --(q) return distinct q.name"}, {"query": "Ask the phone booth, which area code is 0943 and which area code is 0943?", "cypher": "match ((:ENTITY{name:'0943'}) - [:Relationship{name:' belongs to '}]-> (n) return n.name"}, {"query": "The spelling of which national road is 101 guo dao?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "In addition to the publications, 1+1 easily won the title; Optimized training: 8th grade history ranked first tag is?", "cypher": "match (:ENTITY{name:'1+1 easily crowned; optimized training: 8th grade history'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> ' publications' return m.name limit 1"}, {"query": "Do you know the three-letter abbreviation published on 17k Novel Online?", "cypher": "match (m:ENTITY{name:'three-days'}) --(p) with p order by p.name where p.name <> '17k novel network' return p.name"}, {"query": "Do you know who the main users of the VL80 electric locomotive are?", "cypher": "match (:ENTITY{name:'VL80 electric locomotive'}) - [:Relationship{name:'main user'}]-> (x) return distinct x.name"}, {"query": "Which category of tags belong to the core number of four core threads? List five?", "cypher": "match (:ENTITY{name:'four cores four threads'}) <- [:Relationship{name:'number of cores'}]-(h) - [:Tag{name:'tag'}]->(p) return distinct p.name limit 5"}, {"query": "Do you know if the national is Han Chinese, the academic is a gentleman, or the CCP member and engineer is a nickname?", "cypher": "match (:ENTITY{name:'Han Chinese, gentleman, member of the Communist Party of China, engineer\u3002'}) <- [:Describe{name:'description'}]-(p),(p) return distinct p.name limit 3"}, {"query": "I need all the information about Malol Zulfiani, Maloluzhi in English.", "cypher": "match (n:ENTITY{name:'malluoliuzhi'}) - [:Relationship*]->(x) where x.name <>'maluoliuzhi' return distinct x.name"}, {"query": "The Chinese language name for Saviji Dimba is Saviji Dimba, and the Chinese language name for Saviji Dimba is Saviji Dimba.", "cypher": "match (n:ENTITY{name:'Saviji Dimba'}) - [*1..2]->(x) where x.name <>'s Chinese name' return distinct x.name"}, {"query": "Which organization is hosting the 2012 Industrial Design and User Experience Conference?", "cypher": "match ((:ENTITY{name:'2012 Industrial Design and User Experience Conference'}) - [:Relationship{name:' Hosted by'}]-> (p) return p.name"}, {"query": "The asteroid was discovered on November 20, 2007.", "cypher": "match (:ENTITY{name:'November 20, 2007'}) <- [:Relationship{name:' time of discovery'}]- (m) return m.name"}, {"query": "What generation of poet was Chen Han?", "cypher": "match (:ENTITY{name:'Chen Han'}) - (m) return distinct m.name"}, {"query": "If you don't know who he is, what clubs he played in? Name 10 teams?", "cypher": "match (:ENTITY{name:' not specified'}) <- [:Relationship{name:' graduate school'}]-(n),(n) - [:Relationship{name:' formerly active'}]->(m) return distinct m.name limit 10"}, {"query": "I would like to know about 100 philosophical poems selected by the relevant characteristic tags?", "cypher": "match (:ENTITY{name:'100 philosophical poems selected'}) - [:Tag{name:'tags'}]-> (h) with h order by h.name return h.name"}, {"query": "I want to see five romance novels, can I?", "cypher": "match (:ENTITY{name:'speech'}) <--(n) return n.name limit 5 is the name of the game"}, {"query": "Do you know what kind of jobs Zhou Tanhui has had? Can you name three?", "cypher": "match (m:ENTITY{name:'Zhou Danqi'}) <--(n) -[:Relationship{name:'profession'}]->(h) return distinct h.name limit 3"}, {"query": "I'm going to have to ask you to give me a copy of your farewell poem.", "cypher": "match (:ENTITY{name:'Relationship{name:'represents work'}]-> (q) return q.name limit 1"}, {"query": "I learned that the Creative Education Lab is a research institute in Beijing's beachside area, and I was told six more things about it.", "cypher": "match (n:ENTITY{name:'Creative Education Lab'}) -->(h) with h order by h.name where h.name <> 'Beach District of Beijing City' and h.name <> 'Scientific Research Institution' return h.name limit 6"}, {"query": "What is the shortest distance between the Great Wall and the Red Square?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' at Red Mei [Vice-Dean of the Central Academy of Music]'}) - [*..2]-(b:ENTITY{name:' Zhang Changming [Member of the Chinese Dramatists Association]'})) return count ((p)"}, {"query": "Check to see what is the density of 3-hydroxy-5-hydroxyethylene?", "cypher": "match ((:ENTITY{name:'3-methacrylate-5-methacrylate acetate'}) - [:Relationship{name:'density'}]-> (x) return x.name"}, {"query": "What is the shortest relationship path between the tiger-lined short-spaced alveoli and the yellowish short-spaced alveoli in the 2nd layer?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' tiger-stripe short flat-mouthed shark'}) - [*..2]-(b:ENTITY{name:' yellow-billed short-mouthed shark'})) return count ((p)"}, {"query": "What are the specific theories of knowledge that mathematics contains? Can you list 20?", "cypher": "match (:ENTITY{name:'mathematics'}) <- [:Relationship{name:'applied subject'}]- (n) return n.name limit 20"}, {"query": "Can you tell me which brands are in a relationship with Shamoni for Tier 5 labels?", "cypher": "The name of the game is \"Shamoni\" (Shamoni)"}, {"query": "I'm wondering which book has the barcode number 9787806904213?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "And what do you know of the altitude of Managua?", "cypher": "Match ((:ENTITY{name:'Managua'}) - [:Relationship{name:'Altitude'}]-> (n) return n.name"}, {"query": "Do you know the name of the exhibition hall at the 2012 European International Aluminium Expo in Italy?", "cypher": "match ((:ENTITY{name:'2012 European [Italy] International Aluminum Industry Exhibition'}) - [:Relationship{name:'name of the exhibition hall'}]-> (x) return x.name"}, {"query": "A word of introduction.", "cypher": "match (:ENTITY{name: '.a file'}) --(m) with m order by m.name return m.name skip 1 limit 1"}, {"query": "Can you find two tasty sweet foods?", "cypher": "Match (n:ENTITY{name:'sweet'}) <-[:Relationship{name:'flavor'}]- (mn) return mn.name limit 2 This is a list of all the different ways Mn.name is credited in the database."}, {"query": "Help me find two four-word poems by Cao Cao.", "cypher": "match (:ENTITY{name:' Cao Cao'}) <- [:Relationship{name:' author'}]-(m), (m) - [:Relationship{name:' literary genre'}]->(n) where n.name='four-word poem' return distinct m.name limit 2"}, {"query": "And what do you know of Zul-Qayyin, the creator of what?", "cypher": "match (:ENTITY{name:'swing'}) <- [:Relationship{name:'swing'}]- (q) return q.name order by q.name"}, {"query": "Please tell me what is the Chinese translation of world in one day?", "cypher": "match (:ENTITY{name:'world in one day'}) <- [:Relationship{name:'foreign name'}]- (h) return h.name"}, {"query": "How many episodes of the TV series Pure Love?", "cypher": "match ((:ENTITY{name:' pure love'}) - [:Relationship{name:' set'}]-> (n) return n.name"}, {"query": "Can you name five messages from Austria's Ernst?", "cypher": "match (n:ENTITY{name:'Erbster Ernst'}) - [*]->(x) where x.name<>'Austria' return distinct x.name limit 5"}, {"query": "Containerele: What is a music group?", "cypher": "match (:ENTITY{name:'Containerele\u00b7 Mordecai Choir cool'}) --(m) with m order by m.name return m.name"}, {"query": "What is the name of the Chinese western shark?", "cypher": "match (:ENTITY{name:'The Chinese Western Summer Monkey\u3002'}) --(x) return distinct x.name"}, {"query": "I want to know 10 things about the 1st Pearl Harbor.", "cypher": "match (:ENTITY{name:'1 Chicken Crossing'}) --(q) with q order by q.name return q.name limit 10"}, {"query": "The following three works from the region of Korea provide information about the embroidery that you want to be tamed.", "cypher": "match (:ENTITY{name:'the tattoo that wants to be subdued'}) --(m) with m order by m.name where m.name <> 'Japanese' return distinct m.name limit 3"}, {"query": "What are the main areas of the newly launched 0701 Group Shopping Network?", "cypher": "match ((:ENTITY{name:'0701 group shopping'}) - [:Relationship{name:'main business'}]-> (h) return h.name"}, {"query": "Do you know anything about the relationship that Grace Moore is involved in?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Grace Moore'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What is the hardness and the weight of black lead ore?", "cypher": "match (:ENTITY{name:' black lead'}) - [:Relationship{name:' hardness'}]->(n) return n.name as name union all match (:ENTITY{name:' black lead'}) - [:Relationship{name:' ratio'}]->(m) return m.name as name"}, {"query": "Do you have all the types of relationships that Jiangsu covers in the three levels?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (R"}, {"query": "Give me a list of five men who have held the world record in the 400 metres.", "cypher": "match (:ENTITY{name:' Men's 400 metres world record holder'}) --(p) return distinct p.name limit 5"}, {"query": "What is the size of the main screen of the HP iPAQ 910?", "cypher": "match (:ENTITY{name:'HP iPAQ 910, a mobile phone with an operating system for Windows Mobile 6.1)"}, {"query": "The first time I saw a website that was open in March 2010 was in the morning.", "cypher": "match (:ENTITY{name:'March 2010'}) <- [:Relationship{name:'Off time'}]- (p) return p.name"}, {"query": "List the following metropolis novels that he was adopted by OL Beauty in the 3rd tier relationship?", "cypher": "match (n:ENTITY{name:' he was adopted by OL beauty'}) - [*]->(x) where x.name <> 'metropolitan novel' return distinct x.name limit 5"}, {"query": "What does it mean to be crowned with a face like a jewel?", "cypher": "The name of the game is the name of the game. The name of the game is the name of the game."}, {"query": "Do you know what happened to the house that was sold on the street of the farmers' workers in the state of 1.13?", "cypher": "match ((:ENTITY{name:'1\u00b713 Yangon State Farmers Workers Street Standing and Selling Villa Incident'}) - [:Relationship{name:'cause of'}]-> (n) return n.name"}, {"query": "Do you know what the main works of the actors of the cinema are?", "cypher": "match (:ENTITY{name:' actor, actress'}) <- [:Relationship{name:' profession'}]-(p) - [:Relationship{name:' major works'}]->(h) return distinct h.name limit 3"}, {"query": "The hotel is located in the middle of the jungle, and what is the scope of his business?", "cypher": "match ((:ENTITY{name:'Relationship{name:'scale of operations'}}) -> (n) return n.name"}, {"query": "Can you list some of the most representative works of your generation?", "cypher": "match (:ENTITY{name:''}) - [:Relationship{name:'represents work'}]-> (x) return x.name skip 1"}, {"query": "Help me find six of them.", "cypher": "match (:ENTITY{name:'Relationship{name:'category'}]-(m) return m.name limit 6"}, {"query": "Who weighs 118 kg/260 pounds? What else does he have to say?", "cypher": "match (:ENTITY{name:'118 kg/260 pounds'}) <- [:Relationship{name:'weight'}]- ((q),(q) - [:Relationship{name:'alias'}]->(n) return distinct q.name,n.name"}, {"query": "The publication 0-1 years of nutrition recipe has a nice label attribute?", "cypher": "match (:ENTITY{name:'0-1 years old nutritional recipe'}) - [:Tag{name:'label'}]-> (n) with n order by n.name where n.name <> 'publication' return n.name"}, {"query": "Can you find the 10 tier 3 hospitals? Where are their addresses?", "cypher": "match (:ENTITY{name:'three level'}) <--(m), (m) - [:Relationship{name:'hospital address'}]->(n) return m.name,n.name limit 10"}, {"query": "Do you know the time of the 2010 China Zhejiang Food and Beverage Packaging and Processing Technology Exhibition?", "cypher": "match ((:ENTITY{name:'2010 China Shenzhen Food and Beverage Packaging and Processing Technology Exhibition'}) - [:Relationship{name:'time'}]-> (q) return q.name"}, {"query": "Can you recommend three 17k novels that are online?", "cypher": "match (:ENTITY{name:'17k novel network'}) <- [:Relationship{name:'linked website'}]-(n) - [:Relationship{name:'Chinese name'}]->(x) return distinct x.name limit 3"}, {"query": "Can you find group events in Kunshan, China?", "cypher": "match (:ENTITY{name:'China \u6606\u5c71'}) <- [:Relationship{name:'location'}]- (mn) - [:Relationship{name:'event type'}]->(n:ENTITY{name:'group race'}) return mn.name"}, {"query": "What is the name of the asteroid with a period of 1.23 years?", "cypher": "match (:ENTITY{name:'1.23 years'}) <- [:Relationship{name:'rotation cycle'}]- (h) return distinct h.name"}, {"query": "The following 120-page Disney spelling read: Does nature in Winnie-the-Pooh have more information than two layers of relationships?", "cypher": "match (n:ENTITY{name:'Disney spelling read: Winnie the Pooh'}) - [:Relationship*1..2]->(x) where x.name <>'120 pages' return distinct x.name"}, {"query": "Can you find the five organizations? Where are they all located?", "cypher": "match (:ENTITY{name:' organization'}) <- [*]-(m), (m) - [:Relationship{name:' geographical location'}]->(n) return m.name, n.name limit 5"}, {"query": "Can you say three things that are the fifth layer of the label relationship of the plant?", "cypher": "The name of the object is the name of the object."}, {"query": "What are the opening hours of the White Yucatan?", "cypher": "match ((:ENTITY{name:'\u767d\u7389\u5c71 [\u65c5\u987a\u53e3\u533a\u666f\u533a]'}) - [:Relationship{name:'open hours'}]-> (n) return n.name"}, {"query": "Do you know any Chinese people? Name one of their professions.", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(m) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 1"}, {"query": "What else do you know about the Qing Dynasty's Ma Wenling?", "cypher": "match (:ENTITY{name:'Mawen Zhu'}) -[:Relationship*1..3]-(p) where p.name <> 'Qing Dynasty' return p.name limit 4"}, {"query": "What are the names of the companies in Shanghai?", "cypher": "match (p:ENTITY{location:' Shanghai'}) return p.name"}]