[{"query": "Have you heard of the Suzhou MBA Teaching Center at Jilin University?", "cypher": "match (:ENTITY{name:'MBA Teaching Center of Suzhou, Jilin University'}) --(p) return distinct p.name"}, {"query": "Can you tell me about the three-layer relationship that the brown-bearded willow is involved in?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Pink-bearded willow'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "I would like to know the content of the 5 tier relationship in Chinese called Jiangsu Province High-Tech Products Implementation Rules?", "cypher": "match (n:ENTITY{name:'Guidelines for the implementation of high-tech products in Jiangsu Province'}) - [*1..5]->(x) where x.name<>'Guidelines for the implementation of high-tech products in Jiangsu Province' return distinct x.name"}, {"query": "What are the main ingredients used to make vanilla cream foam?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'main ingredient'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [Relationship'}->(m) return m.name as name"}, {"query": "The hero of the prison, the fearless prisoner, is the symbol of the lion, what else is he representing besides this one?", "cypher": "match (h:ENTITY{name:'Relationship{name:'Chinese name'}]-(n) -[:Relationship{name:'representative work'}]->(x) where x.name <> 'Relationship{name:' in Chinese} return distinct x.name limit 1"}, {"query": "What are the main awards for the institution in the Lake Tekapo district of East Kampong, Shandong province?", "cypher": "match (q:ENTITY{name:'New District of Lake Tang District, East Kampung City, Shandong Province'}) <- [:Relationship{name:'New School address'}]- ((x),(x) - [:Relationship{name:'Main award'}]->(h) return distinct h.name"}, {"query": "Can you tell me how many times you have been hit by a car?", "cypher": "match (:ENTITY{name:'stepping accident'}) <- [:Relationship{name:' event'}]- (h) return h.name"}, {"query": "What is the name of the game in Japanese (English)?", "cypher": "match (:ENTITY{name:' in Japanese (English) '}) <- [:Relationship{name:' game language'}]- (m) return m.name"}, {"query": "Do you know any of his representative works, who performed between 1951 and 1957?", "cypher": "match (:ENTITY{name:'1951 to 1957'}) <- [:Relationship{name:'time of performance'}]-(p) - [:Relationship{name:'represented work'}]->(m) return m.name order by m.name limit 1"}, {"query": "Do you know how many villages have an area of 4.01 square kilometers? Can you name three?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "The following is a list of the top 5 life skills that you can learn about relationships within the 5 layers of the Bigfoot Law:", "cypher": "match (n:ENTITY{name:'The law of the insect'}) - [*1..5]->(x) where x.name <>'life' return distinct x.name limit 5"}, {"query": "The film is 130 minutes long and you recommend 10 movies?", "cypher": "match (n:ENTITY{name:'130 minutes'}) <- [:Relationship{name:'long'}]- (mn) return mn.name limit 10"}, {"query": "What is pv flow?", "cypher": "match (:ENTITY{name:'pv flow'}) - [:Relationship{name:'substance'}]->(m) return distinct m.name"}, {"query": "Li Jiehua is a member of the Association of Guangxi Fine Artists.", "cypher": "match (:ENTITY{name:'Li Jiehua is a member of the Association of Guangxi Artists, painting Chinese pen-colored flower birds, writing flower birds, mountain watercolors\u3002'}) <-[:Describe{name:'description'}]-(x),(x) -[:Relationship{name:'represents works'}]->(h) return distinct x.name"}, {"query": "Can you tell me what kind of relationship is involved in the four layers of the article?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:'\u9ad8\u82b3'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 1 The name of the match path is not known."}, {"query": "The following is a list of some of the best Chinese language courses for preschoolers:", "cypher": "match (n:ENTITY{name:'pre-school children must see the whole picture: happy learning'}) - [:Relationship*1..2]->(x) where x.name <>'simplified Chinese' return distinct x.name"}, {"query": "Please share Pan's representative work with me.", "cypher": "match (:ENTITY{name:'Panzhu Lin'}) - [:Relationship{name:'representing work'}]-> (p) return p.name order by p.name"}, {"query": "What does it mean to be blunt?", "cypher": "match (:ENTITY{name:' frankly'}) <- [:Relationship{name:' Chinese name'}]- ((p) - [:Relationship{name:' explained'}]->(n) return distinct n.name"}, {"query": "I would like information on the interim arrangements for some issues of employment training from the Ministry of Labour and Human Resources.", "cypher": "match (n:ENTITY{name:'Provisional measures on some issues of employment training'}) - [:Relationship*1..3]->(x) where x.name <> 'Labour and Human Resources' return distinct x.name"}, {"query": "What is the profession of Devon Cameron besides being an actor?", "cypher": "match (:ENTITY{name:'Devon Cameron'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'profession'}]->(q) where q.name <> 'actor' return distinct q.name limit 1"}, {"query": "Please tell me the name of the concert at Candy Tango.", "cypher": "Match (:ENTITY{name:' candyTANGO'}) <- [:Relationship{name:' location'}]- (n) return n.name"}, {"query": "I would like to know which meeting China was represented by the Vice Minister of Foreign Affairs of China, Li Baodong.", "cypher": "match (:ENTITY{name:'Deputy Foreign Minister of China Li Baodong'}) <- [:Relationship{name:'China representative'}]- (x) return x.name"}, {"query": "Please tell me what is the installation method for a 16CTQ100 type of direct current diode?", "cypher": "The following is a list of the most commonly used types of data:"}, {"query": "Do you have any information about the name of this Chinese person and his representative works?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(x) - [:Relationship{name:'representative work'}]->(h) return x.name,h.name skip 1 limit 3"}, {"query": "Do you know what Goldman Sachs' main achievements are?", "cypher": "match (:ENTITY{name:'Former Chief Economist at Goldman Sachs, currently Professor Emeritus of Economics at the University of Manchester, UK}) <- [:Relationship{name:'profession'}]-(m),(m) - [:Relationship{name:'main achievements'}]->(h) return distinct h.name limit 5"}, {"query": "The article also points out that Lemos Tiago, a Portuguese national, has no personal profile above two levels of relationship.", "cypher": "match (n:ENTITY{name:'Lemos Tiago'}) - [:Relationship*1..2]->(x) where x.name <>'Portugal' return distinct x.name"}, {"query": "Do you know how many conferences are held in China?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'location'}]- (x) return x.name limit 4"}, {"query": "I'm looking for a book about the 13 National Judicial Examinations: Theory of Law and Relationships.", "cypher": "match (n:ENTITY{name:' National Judicial Examination School of Law Lecture 8: Theoretical Law'}) - [:Relationship*1..3]->(x) where x.name <>'13' return distinct x.name"}, {"query": "I want to find software that can be installed on 5 Apple devices?", "cypher": "match (:ENTITY{name:'IOS'}) <--(n) return n.name limit 5 is the name of the game"}, {"query": "What are the main departments and major awards of the Zhengzhou Academy?", "cypher": "match (:ENTITY{name:'Oregon Academy'}) - [:Relationship{name:'main faculty'}]->(n) return n.name as name union all match (:ENTITY{name:'Oregon Academy'}) - [:Relationship{name:'main award'}]->(m) return m.name as name"}, {"query": "What other professions does this person who won the Best Actress award at the 5th China Long Spring Film Festival have?", "cypher": "match (:ENTITY{name:'Best Actress Award at the 5th China Longcheng Film Festival'}) <- [:Relationship{name:'representative work'}]- ((n) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 10"}, {"query": "Have you seen the 1000 people who have been encouraging this comic and mentioning its three labels?", "cypher": "match (:ENTITY{name:'1000 pulses'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'comic' return p.name limit 3"}, {"query": "Can you tell me 10 companies that are headquartered in Beijing?", "cypher": "match (p:ENTITY{name:'Beijing'}) <- [:Relationship{name:'Hall of Residence'}]- (m) return m.name limit 10"}, {"query": "The classification of the Santa Torreta willow is based on the following two categories:", "cypher": "match (n:ENTITY{name:'Lily of the Valley'}) - [:Relationship{name:'categorized'}]->(h) where h.name <> 'chick' and h.name <> 'dessert' return distinct h.name limit 2"}, {"query": "Can you list 5 of the 19th session of the 6th People's Congress of Hanoi, chaired by Huang Shaoqian?", "cypher": "match (n:ENTITY{name:'The nineteenth meeting of the Sixth People's Congress of the City of River River Valley'}) - [*]->(x) where x.name <>'Huang Xiaolang' return distinct x.name limit 5"}, {"query": "The novel that was called The Night of the Long Knives is called \"Yue\" in Chinese.", "cypher": "match (:ENTITY{name:' that night's whore'}) <- [:Relationship{name:' author'}]- ((h) - [:Relationship{name:' Chinese name'}]->(m) return distinct m.name limit 1"}, {"query": "Help me find three politicians with college degrees.", "cypher": "match (:ENTITY{name:'college officer'}) <-[:Relationship{name:'main achievement'}]-(m), (m) -[:Tag{name:'tag'}]->(n) where n.name='political figure' return m.name limit 3"}, {"query": "Can you find fresh, refreshing cabbage?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)."}, {"query": "I'm not sure if you're familiar with the name of the artist, but I'm not sure if you're familiar with the name of the artist.", "cypher": "match (:ENTITY{name:'\u4e01\u6653'}) - [:Relationship{name:'representing work'}]-> (x) return distinct x.name"}, {"query": "Can you recommend a representative work by someone in the industry?", "cypher": "match (:ENTITY{name:'industry figure'}) <- [:Tag{name:'tag'}]-(p) - [:Relationship{name:'represented work'}]->(q) return distinct q.name limit 1"}, {"query": "Can you tell me who is the director of this drama, and what is the plot?", "cypher": "match (:ENTITY{name:'Red-crowned night heron'}) --(n) return n.name order by n.name"}, {"query": "The film is based on the life of the famous Chinese artist, who was born in the city of Chongqing, China.", "cypher": "match (:ENTITY{name:'Relationship'}) <- [:Relationship{name:'represented works'}]- (m) return m.name skip 2"}, {"query": "What songs are included in the album The Great Escape?", "cypher": "match (:ENTITY{name:' The Great Escape'}) <--(n) return n.name"}, {"query": "Do you know what are the benefits of drinking red wine?", "cypher": "match (:ENTITY{name:' red wine'}) <- [:Relationship{name:' Chinese name'}]- ((p) - [:Relationship{name:' mainly consumed potency'}]->(n) return distinct n.name"}, {"query": "Tech product 16GL DC meter has other labels?", "cypher": "match (:ENTITY{name:'16GL DC meter'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'technology product' return x.name"}, {"query": "Can you name five jobs that Li has been working in?", "cypher": "match (:ENTITY{name:'Lee Kwon Hoon'}) <--(n),(n) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 5"}, {"query": "Can you provide a description of the spirit of community of the 128th Student Development Alliance?", "cypher": "match ((:ENTITY{name:'128 College Students' Union'}) - [:Relationship{name:'Society spirit'}]-> (p) return p.name"}, {"query": "The following is a list of some of the topics that are covered in this blog:", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'literary work' return distinct x.name"}, {"query": "Can you find the five performers? What are their representative works?", "cypher": "match (:ENTITY{name:'performer'}) <- [*]-(m), (m) - [:Relationship{name:'representing work'}]->(n) return m.name, n.name limit 5"}, {"query": "Internet lecturer at Tsinghua University Research Institute, China E-Commerce Association Certified Trainer, Founder of Shenzhen Longlin Group, WeChat Marketing Lecturer, 2013 Micro-marketing Newcomer of the Year Award, participated in the 2013 New Media Micro-marketing Development Report.", "cypher": "match (:ENTITY{name:'Chinghua University Research Institute Internet Lecturer Certified Trainer by the Chinese E-Commerce Association Founder of Shenzhen Shaolin Group WeChat Marketing Lecturer Certified by Shenzhen Shaolin Group 2013 Micro-marketing Newcomer of the Year Award Participant in the 2013 New Media Micro-marketing Development Report by writing and publishing...'}) <-[:Describe{name:'description'}]-(h) -[:Relationship{name:'main achievements'}->(q) return distinct h.name,q.name"}, {"query": "Tell me about the football player Poldrugac Dalibor, who is in a two-tiered relationship.", "cypher": "match (n:ENTITY{name:'Poldrugac Dalibor'}) - [*1..2]->(x) where x.name <> 'football' return distinct x.name"}, {"query": "I wonder what the relationship is between the three tiers that the Shard is involved in?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Shared side'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "The 2012 JSWB Home Buying Conference was held in Guangzhou, where did you say the venue is?", "cypher": "match ((p:ENTITY{name:'2012 JSWB [Guangzhou] Home Buying Conference'}) - [:Relationship{name:'Meeting venue'}]-> (h) return h.name"}, {"query": "What are the Chinese names of the novels that are being published on 3G?", "cypher": "match (:ENTITY{name:'3G book city'}) <- [:Relationship{name:'connected website'}]-(p),(p) - [:Relationship{name:'Chinese name'}]->(x) return distinct x.name limit 3"}, {"query": "Who is the author of the Pedantic Principle and what are its applications?", "cypher": "The following is a list of all the games that are available on the App Store:"}, {"query": "Who was the winner of the 1903 Nobel Prize in Physiology or Medicine in Denmark?", "cypher": "match (:ENTITY{name:'Denmark'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'main achievements'}]->(n) where n.name='winner of the 1903 Nobel Prize in Physiology or Medicine' return distinct m.name"}, {"query": "The first is that the people born in remote areas are all cooking?", "cypher": "match (:ENTITY{name:'defined'}) <- [:Relationship{name:'place of birth'}]-(h) - [:Relationship{name:'profession'}]->(p) return distinct p.name limit 3"}, {"query": "List six vehicles and their year of manufacture.", "cypher": "match (:ENTITY{name:' Vehicle'}) <--(m), (m) - [:Relationship{name:' Year of manufacture'}]->(n) return m.name, n.name limit 6"}, {"query": "The article was written by a journalist from the local newspaper, \"The Military Network\".", "cypher": "match (:ENTITY{name:'119 military network'}) --(x) with x order by x.name where x.name <> 'professional military website' return x.name"}, {"query": "How many tactical software are running on Android 2.1? Can you name 4?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you give me some information about the myth of the Yuki [film]?", "cypher": "match (:ENTITY{name:'Mother of the Bride'}) --(h) return h.name order by h.name limit 5"}, {"query": "Please describe which player's main award is 1st Regular Season Scoring King (in 1968).", "cypher": "match (:ENTITY{name:'1st regular season scoring king ((1968) '}) <- [:Relationship{name:'main prize'}]- (x) return distinct x.name"}, {"query": "What are the names of the actors and the models?", "cypher": "match (:ENTITY{name:'model, actor'}) <- [:Relationship{name:'profession'}]-(m) - [:Relationship{name:'alias'}]->(n) return distinct n.name limit 5"}, {"query": "Help me find 10 different types of lettuce.", "cypher": "match (:ENTITY{name:'ru\u83dc'}) <-[:Relationship{name:'category'}]-(m) return m.name limit 10 The name of the match is not specified"}, {"query": "Do you know what the fair was called from 11/18/2011 to 11/20/2011?", "cypher": "match (:ENTITY{name:'2011/11/18 to 2011/11/20'}) <- [:Relationship{name:'season'}]- (p) return p.name"}, {"query": "Is there a narrow striped whale in this genus?", "cypher": "match (n:ENTITY{name:' narrow striped lemurs'}) where n is not null return 1"}, {"query": "In which regions of our country are the red nettles mainly distributed?", "cypher": "match (:ENTITY{name:' red scallopes'}) - [:Relationship{name:' distribution area'}]-> (m) return distinct m.name"}, {"query": "When was the School of Mechanical Engineering in Xuzhou founded?", "cypher": "match (:ENTITY{name:'Xuzhou City Mechanical Industrial School'}) - [:Relationship{name:'Time of founding'}]->(n) return n.name as name union all match (:ENTITY{name:'Xuzhou City Mechanical Industrial School'}) - [:Relationship{name:'Category'}]->(m) return m.name as name"}, {"query": "Did you know that 5 and comics are the fourth layer of the label relationship?", "cypher": "The following is a list of characters that appear in the game."}, {"query": "Can you tell me 10 companies registered with the Baoshan Market Supervision Authority?", "cypher": "match (:ENTITY{name:'Bohasan District Market Supervision Authority'}) <- [:Relationship{name:'Registration authority'}]- (h) return h.name limit 10"}, {"query": "What are the most representative works of talent born in California, USA? Name 5?", "cypher": "match (:ENTITY{name:'U.S. State of California'}) <- [:Relationship{name:'place of birth'}]- ((n) - [:Relationship{name:'representative work'}]->(h) return distinct h.name limit 5"}, {"query": "What is the name of the place where the Fukuoka school was founded and the place where it was established in the same year? Tell me what the labels are for each place. Please list the number of labels for each place in small to large order.", "cypher": "match (n:ENTITY{name:'Fudai area ash school'}) - [:Relationship{name:'time of foundation'}]->(:ENTITY) <-[:Relationship{name:'time of foundation'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Listed below are the topics of high school English in the simplified Chinese River English language.", "cypher": "match (n:ENTITY{name:' High school English Subject Extension Reading: High school year one'}) - [:Relationship*1..2]->(x) where x.name <>' simplified Chinese, English ' return distinct x.name"}, {"query": "Can you tell me the label of the three 2-hydro-4-acids right away?", "cypher": "match (:ENTITY{name:'2-metha-4-methyl'}) - [:Tag{name:'label'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "Please share with me what you know about Zhang Gongyuan.", "cypher": "match (:ENTITY{name:' Zhang Guoqi'}) --(h) return h.name skip 3 The name of the game is \"Skip 3\"."}, {"query": "Can you tell me the top 5 other names for congenital erectile dysfunction syndrome?", "cypher": "match (:ENTITY{name:' Congenital erectile dysfunction syndrome'}) --(x) return x.name order by x.name limit 5"}, {"query": "What is the status of Sun Yat-sen?", "cypher": "match (:ENTITY{name:'Sun\u8d44'}) - [:Relationship{name:'gentleman'}]-> (m) return distinct m.name"}, {"query": "Where are the two non-profit international member organizations headquartered?", "cypher": "match (:ENTITY{name:' non-profit international membership organization'}) <- [*]-(m), (m) - [:Relationship{name:' headquarters'}]->(n) return m.name, n.name limit 2"}, {"query": "Can you name five representative works by Sophia Kony?", "cypher": "match (:ENTITY{name:'Sophia'}) <- [:Relationship{name:'represents work'}]- (m) return distinct m.name limit 5"}, {"query": "Help me find the 10 generals of the East Han.", "cypher": "match (:ENTITY{name:'Tohhan'}) <- [:Relationship{name:'at the time'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='general' return distinct m.name limit 10"}, {"query": "What is the shortest path between the two layers of semiconductor physics and the manufacturing process of devices and electronics?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'semiconductor physics and devices'}) - [*..2]-(b:ENTITY{name:'electronic product manufacturing process'})) return count ((p)"}, {"query": "What other work should be removed besides this one?", "cypher": "match (:ENTITY{name:'Kyu-chan, born 6 August 1989 in Zhejiang, graduated from Central Academy of Drama, mainland China, actor\u3002'}) <-[:Describe{name:'description'}]-(n),(n) -[:Relationship{name:'main work'}->(m) where m.name <> '\u6b22\u00b7\u7231' return distinct m.name limit 1"}, {"query": "What are the works of the Shanghai-like publishers and when are they published?", "cypher": "match (:ENTITY{name:'Shanghai sounds like'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'publication time'}]->(q) return distinct h.name,q.name"}, {"query": "What is the beauty code for a woman to wash her face and sweat on her neck when she gets married?", "cypher": "match (:ENTITY{name:'Women get married to clean their face and sweat hairs'}) <-[:Relationship{name:'derived'}]-(m), (m) -[:Relationship{name:'attributes'}]->(n) where n.name='beauty law' return distinct m.name"}, {"query": "Do you know the nationality of Kobe Jones?", "cypher": "match (:ENTITY{name:'Coby Jones'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'nationality'}]->(n) return distinct n.name"}, {"query": "When was Sichuan Sichuan Shijiazhuang Industries Limited founded?", "cypher": "match (:ENTITY{name:' Sichuan Sichuan Wang Industrial Limited'}) - [:Relationship{name:' time of establishment'}]->(n) return n.name"}, {"query": "The following is a list of the works translated by the Julan Painting Gallery: How do you describe the relationship between my new clothes and my new clothes?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'Relationship' return distinct x.name"}, {"query": "What are the business aspects of your Shanghai Keio Clothing Co., Ltd.?", "cypher": "match ((q:ENTITY{name:' Shanghai Keio Clothing Co. Ltd'}) - [:Relationship{name:' Scope of operations'}]-> (p) return p.name"}, {"query": "What is the shortest relationship path between the two layers of the inner bean sub-leaf and the sweet spinach nightingale?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'sweet bean sub-leafy shell'}) -[:Relationship*..2]-(b:ENTITY{name:'sweet bean sub-leafy shell'})) return count ((p)"}, {"query": "What is the status of the relationship between Robert Palikuca, born in B\u00fcckeburg, and the two?", "cypher": "match (n:ENTITY{name:'Palicka Robert'}) - [*1..2]->(x) where x.name <>'B\u00fcckeburg' return distinct x.name"}, {"query": "What records have been released by the 7th Beijing Cultural Company?", "cypher": "match (:ENTITY{name:'Beijing's Seventh City'}) <- [:Relationship{name:'record company'}]-(m) return distinct m.name"}, {"query": "The contest is open to all participants, including the top 10 countries and regions.", "cypher": "match (:ENTITY{name:'164'}) <- [:Relationship{name:'contest country area'}]- (n) return distinct n.name"}, {"query": "Can you list me the three main achievements of the man who opened the screen of the statue of the man who is the representative of the statue of the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man is the man who is the man who is the man who is the man is the man who is the man is the man who is the man is the man who is the man who is the man who is the man who is", "cypher": "match (:ENTITY{name:'square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-square-squ"}, {"query": "What is the academic theory proposed by Kohonen?", "cypher": "match (:ENTITY{name:'Kohonen'}) <- [:Relationship{name:'proponent'}]- (q) return distinct q.name"}, {"query": "Please help me find two CDs for $82 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'82.0\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "Help me find 10 species of fungus in the genus M. porcupine.", "cypher": "match (:ENTITY{name:' fungal family'}) <- [:Relationship{name:' fungal family'}]-(m), (m) - [:Relationship{name:' genus'}]->(n) where n.name='phylum of fungal species' return m.name limit 10"}, {"query": "The following is a list of songs that are in the genre of rock music:", "cypher": "match (n:ENTITY{name:'Sweet Things'}) - [:Relationship*1..2]->(x) where x.name <>'rock' return distinct x.name"}, {"query": "I want to know about the information about the 1.85m Kratochv\u00edl Roman, which is not less than 3 levels of relationship?", "cypher": "match (n:ENTITY{name:'Kratochv\u00edl Roman'}) - [*1..3]->(x) where x.name <>'1.85 m' return distinct x.name"}, {"query": "I was wondering how much capacity is a 3.7V lithium battery (~1100mAh)?", "cypher": "match (:ENTITY{name:'3.7V lithium battery ((1100mAh) '}) <- [:Relationship{name:' use battery'}]- ((p) - [:Relationship{name:' storage capacity'}]->(q) return distinct p.name"}, {"query": "Please tell me what are the names of the places that belong to the city of Samsun? Please give me 5 names.", "cypher": "match (:ENTITY{name:'city'}) <- [:Relationship{name:'area'}]- ((q) - [:Relationship{name:'other name'}]->(x) return x.name order by x.name limit 5"}, {"query": "The following is a list of the topics covered by the National Health Care Education Innovation Materials: Information within the two-tier relationship of gynecological and obstetric nursing.", "cypher": "match (n:ENTITY{name:'National Health Care Professional Education Innovation Materials: Gynecological and Obstetrical Nursing'}) - [:Relationship*1..2]->(x) where x.name <>'Oregon University Press' return distinct x.name"}, {"query": "Who is the one who has the strength to fight the enemy?", "cypher": "match (:ENTITY{name:'Lovely city's candy'}) --(x) return x.name order by x.name"}, {"query": "And what will explain to you what the profession of the Jinn is?", "cypher": "match (:ENTITY{name:'songlist'}) <- [:Relationship{name:'songlist'}]- ((m),(m) - [:Relationship{name:'songlist'}]->(h) return distinct h.name limit 1"}, {"query": "Born in August 1955, he was a deputy minister of the Department of Organization of the Haryana County Commission, giving other occupations he may have been doing.", "cypher": "match (:ENTITY{name:'August 1955'}) <- [:Relationship{name:'date of birth'}]-(n),(n) - [:Relationship{name:'profession'}]->(m) where m.name <> 'Deputy Minister of the Department of the Haryana County Commission' return distinct m.name limit 1"}, {"query": "Please find me 10 Zhejiang dishes, what are the main ingredients?", "cypher": "match (:ENTITY{name:'Zhejiang bean'}) <- [*]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) return distinct m.name, n.name limit 10"}, {"query": "Do you know what the main achievements of this Chinese personage are? Can you explain three?", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(x),(x) - [:Relationship{name:'main achievements'}]->(p) return p.name skip 5 limit 3"}, {"query": "Recently learned the nature of wintering herbal acetate, do you know its molecular formula?", "cypher": "match ((:ENTITY{name:'wintergrass acetate'}) - [:Relationship{name:'molecular'}]-> (n) return n.name"}, {"query": "Curious 1209 KTV bearings correspond to what label?", "cypher": "match (:ENTITY{name:'1209KTV bearing'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "The following is a list of some of the public health activities that are being done to help children with pre-existing heart conditions.", "cypher": "match (:ENTITY{name:'pre-heart disease child'}) <- [:Relationship{name:'rescue object'}]- (q) return distinct q.name"}, {"query": "What are the labels associated with the 11/26 Wuhan bombings?", "cypher": "match (:ENTITY{name:'11\u00b726 Wuhan bombing'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "Do you know what major departments are in the university in Guangxi?", "cypher": "match (h:ENTITY{name:'Guangxi Jilin City'}) <- [:Relationship{name:'the area'}]-(m),(m) - [:Relationship{name:'the major department'}]->(x) return distinct x.name limit 1"}, {"query": "Help me find out 7 other things about Ash Booker III.", "cypher": "match (:ENTITY{name:'Ash Booker'}) - [:Relationship*1..3]-(p) where p.name <> 'American actor' return p.name limit 7"}, {"query": "Who is the author of the Mirror Garden Puzzle?", "cypher": "match (:ENTITY{name:'mirror garden'}) - [:Relationship{name:'author'}]->(m) return distinct m.name"}, {"query": "What do you achieve when you are a professor, a PhD student, a graduate tutor?", "cypher": "match (:ENTITY{name:' professor, PhD graduate advisor'}) <- [:Relationship{name:' profession'}]- ((m) - [:Relationship{name:' major achievement'}]->(x) return distinct x.name"}, {"query": "What is the name of the school where the first principal is named Li Huang?", "cypher": "match (:ENTITY{name:'\u674e\u66f0'}) <- [:Relationship{name:'first principal'}]- ((m) - [:Relationship{name:'abbreviated'}]->(h) return distinct h.name limit 3"}, {"query": "I would like to know all the information about the weekly workshop.", "cypher": "match (:ENTITY{name:'showdown'}) --(p) return distinct p.name"}, {"query": "What are the famous sights in the city of Dragon King?", "cypher": "Match (:ENTITY{name:'Long Wang countryside'}) - [:Relationship{name:'Famous attractions'}]->(m) return distinct m.name"}, {"query": "Can you get me five books for $25.80?", "cypher": "match (:ENTITY{name:' books'}) <- [:Tag{name:' labels'}]-(m), (m) - [:Relationship{name:' pricing'}]->(n) where n.name='25.80\u5143' return m.name limit 5"}]