[{"query": "United Airlines What is his slogan?", "cypher": "match (:ENTITY{name:'United Airlines'}) <- [:Relationship{name:'company name'}]-(p) - [:Relationship{name:'company slogan'}]->(n) return distinct n.name"}, {"query": "The first is the use of the term \"science-based 1-hydrogen sulfide\".", "cypher": "match (:ENTITY{name:'1-\u5168\u5df1'}) --(m) with m order by m.name where m.name <> 'science' return m.name"}, {"query": "I want all the information about the two-tier relationship and the Kazakh citizen Baginsky B.", "cypher": "match (n:ENTITY{name:'Baginsky B'}) - [*1..2]->(x) where x.name<>'Kazakhstan' return distinct x.name"}, {"query": "Please tell me the name of the explosion that occurred at 13:10 on October 17, 2011.", "cypher": "match (:ENTITY{name:'17 October 2011 at 13:10'}) <- [:Relationship{name:'date'}]- (n) return n.name"}, {"query": "The following are the five profiles of Tsing Tzu-hsiang, a Chinese politician who is currently serving as the President of the People's Republic of China.", "cypher": "match (n:ENTITY{name:'switched off'}) - [*]->(x) where x.name <>'clean' return distinct x.name limit 5"}, {"query": "What else is there in the fridge besides the mustard?", "cypher": "match (:ENTITY{name:'cold disc'}) <- [:Relationship{name:'classification'}]-(m) where m.name <> 'mustard palm' return distinct m.name"}, {"query": "The University of Wudianliulng, founded in 1959 and awarded the top 10 schools in the city for education and research, has no honour now.", "cypher": "match (p:ENTITY{name:'1959'}) <- [:Relationship{name:'time of foundation'}]-(h) - [:Relationship{name:'main award'}]->(m) where m.name <> 'top ten schools in the city for education and research' return distinct m.name limit 1"}, {"query": "Please introduce me to George Awell, and I think the top 10 are good.", "cypher": "match (:ENTITY{name:' George Ewell'}) --(m) return m.name order by m.name limit 10"}, {"query": "Which TV series won the 12th Hong Kong Film Golden Globe?", "cypher": "match (:ENTITY{name:'The 12th Hong Kong Film Award for Best Feature Film'}) <- [*]-(m), (m) - [:Relationship{name:' the lead character'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "Do you know what the main achievements of the Central Party Committee member and deputy mayor of Zhejiang District in Chongqing are?", "cypher": "match (n:ENTITY{name:'Central Zheng County Party Committee member, deputy county chairman'}) <-[:Relationship{name:'main achievements'}]-(x),(x) -->(q) return distinct x.name limit 1"}, {"query": "I need to know the profile of Mehovic Anis in Luxembourg in the 3rd level of relations?", "cypher": "match (n:ENTITY{name:'Mehovic Anis'}) - [:Relationship*1..3]->(x) where x.name<>'Luxembourg' return distinct x.name"}, {"query": "He was the first student of the Shanghai Foreign Language University's Suzhou River Bay Experiment Middle School to win the 2016 8th grade district test in Mathematics. He also received five other awards.", "cypher": "match (:ENTITY{name:'Shanghai University of Foreign Languages's Su River Bay Experimental Middle School'}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'main award'}]->(p) where p.name <> '2016 Eighth grade district test all-district first in mathematics' return distinct p.name limit 5"}, {"query": "Give me four foreign historical events and tell me when they happened.", "cypher": "match (:ENTITY{name:'foreign historical event'}) <--(m), (m) - [:Relationship{name:'time'}]->(n) return m.name, n.name limit 4"}, {"query": "Can you tell me about a significant event that happened to a person?", "cypher": "match (:ENTITY{name:'person'}) <- [:Tag{name:'tag'}]-(q),(q) - [:Relationship{name:'important event'}]->(h) return distinct h.name limit 1"}, {"query": "Do you know where the Arctic Monkey is from?", "cypher": "match (:ENTITY{name:'Third Arctic'}) <- [:Relationship{name:'Chinese name'}]- ((n) - [:Relationship{name:'origin'}]->(q) return distinct q.name"}, {"query": "Please help me find the three films released by Gahei Films, who are the directors?", "cypher": "match (:ENTITY{name:'Kahn Film Company'}) <--(m), (m) - [:Relationship{name:'director'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "What are the books of the Whangam-Ting-Mot Publishing House and what are the labels of each book?", "cypher": "The following is a list of the most commonly used tags for the game of poker: match (n:ENTITY{name:'Relationship{name:'publishing'}}) ->(:ENTITY) <-[Relationship{name:'publishing'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "I'm wondering which ship's construction unit is the Jiangxi Jiangxi Shipyard?", "cypher": "match (:ENTITY{name:'Jiangxijiang new shipyard'}) <- [:Relationship{name:'building unit'}]- (x) return x.name"}, {"query": "I wonder what the name of an accident is that killed three passengers on the spot?", "cypher": "match (:ENTITY{name:'3 passengers killed on the spot'}) <- [:Relationship{name:'consequences'}]- (q) return q.name"}, {"query": "I want to know what are the two categories of nutmeg black sugar toast apart from bread and toast?", "cypher": "match (n:ENTITY{name:'Relationship{name:'classified'}]->(h) where h.name <> 'bread' and h.name <> 'toast' return distinct h.name limit 2"}, {"query": "The main prize is the World Women's Volleyball Championship, which has won twice.", "cypher": "match (:ENTITY{name:'World Championship of Volleyball for Women 2 times'}) <- [:Relationship{name:'main award'}]- (h) return distinct h.name"}, {"query": "Can you tell me everything you know about Megawati Sugano?", "cypher": "match (:ENTITY{name:'Megawatty Sugano'}) - [:Relationship*1..3]-(p) return distinct p.name limit 10"}, {"query": "Find out where the three species of watermelon are distributed.", "cypher": "match (:ENTITY{name:'Pumpkin'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'Distributed area'}]->(n) return m.name,n.name limit 3"}, {"query": "Can you tell me about one relationship that is a two-tier relationship between the factory and the store in Taipei?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Thailand after-shop'}) UNWIND relationships(path) AS rel return distinct rel.name limit 1"}, {"query": "Did you have trouble asking about the three-layer relationship in the Bloodlines novel written by the Godfather Wizard?", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'Goddess witch witch' return distinct x.name"}, {"query": "Who is the same height as Mihael Hertelendi, and who has a tattoo on each of them?", "cypher": "The following is a list of the most commonly used tags for the game of basketball:"}, {"query": "Tell me about the Type 072III tank landing ship in my military domain?", "cypher": "match (:ENTITY{name:'072III tank landing ship'}) --(h) with h order by h.name where h.name <> 'military' return h.name"}, {"query": "Can you name 17 players who used to play right-footed?", "cypher": "match (:ENTITY{name:'right foot'}) <- [:Relationship{name:'usual foot'}]- (q) return q.name limit 17"}, {"query": "Do you know what the title of the Chinese TV show that touched the Chinese audience is?", "cypher": "match (:ENTITY{name:'Central TV channel's Yue touching Chinese eye'}) <- [:Relationship{name:' Selection unit'}]- (x) return distinct x.name"}, {"query": "What are the major awards Kimberly Hill has won? Can you name five?", "cypher": "match (:ENTITY{name:'Kimberly Hill(born November 30, 1989) is an American volleyball player. She is a member of the United States women's national volleyball team and Turkish club Vakifbank."}, {"query": "Could you tell me what the Chinese meaning of The Sadly Beautiful Love of an Emperor is?", "cypher": "match (:ENTITY{name:'The sadly beautiful love of an emperor'}) <- [:Relationship{name:'foreign name'}]- (x) return x.name"}, {"query": "Do you know this man Bert Van Tuyle?", "cypher": "The name of the game is \"Bert Van Tuyle\"."}, {"query": "Can you name three of Vanessa Cobham's representative works for me?", "cypher": "match (:ENTITY{name:'Vanessa Cobham'}) - [:Relationship{name:'represents work'}]-> (h) return distinct h.name limit 3"}, {"query": "Can you recommend 6 songs that are 3 minutes and 37 seconds long?", "cypher": "match (:ENTITY{name:'3 min 37 seconds'}) <- [:Relationship{name:' song length'}]- (m) return m.name limit 6"}, {"query": "Who is the subject of the forensic research?", "cypher": "match (:ENTITY{name:'Forensic science [discipline name]'}) - [:Relationship{name:' research object'}]->(m) return distinct m.name"}, {"query": "The following 5 things about the Ming Dynasty's Emperor in the Four Levels of Relationship?", "cypher": "match (n:ENTITY{name:'Yongshushitsu King'}) - [*1..4]->(x) where x.name<>'Ming\u671d' return distinct x.name limit 5"}, {"query": "What chemical has a molecular weight of 192? Give me four.", "cypher": "match (:ENTITY{name:'192'}) <- [:Relationship{name:'molecular mass'}]- (p) return p.name limit 4 The name of the match is the same as the name of the other match."}, {"query": "How about a description of the magic treasure trove with five labels for 0-2 year olds?", "cypher": "match (:ENTITY{name:'0-2 years old magic treasure trove'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 5"}, {"query": "How about a complete description of 100 classic literature in less than 10 words?", "cypher": "match (:ENTITY{name:'100 classical literature collections'}) --(n) with n order by n.name return n.name limit 10"}, {"query": "Do you know what food and gold foil are in tier 3 labeling?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'gold roll'}) return distinct n.name"}, {"query": "The Chinese writer, who is also a writer, has written about his achievements in the field of Chinese literature.", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(x),(x) - [:Relationship{name:'main achievements'}]->(q) return q.name order by q.name limit 5"}, {"query": "The book you are looking at, the Northeast Military Factory Spiritual Archives, how many words are in the book?", "cypher": "match ((q:ENTITY{name:'Northeast Military Factory Spiritual Archive'}) - [:Relationship{name:'word count'}]-> (p) return p.name"}, {"query": "The game is the same size as the Monster Brothers games, and what are the labels for each game?", "cypher": "match (n:ENTITY{name:'monster three brothers'}) - [:Relationship{name:'game size'}]->(:ENTITY) <-[:Relationship{name:'game size'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) BY ORDER c DESC"}, {"query": "I'm going to show you a representative work by Terry Russo.", "cypher": "match (:ENTITY{name:'Tri Lucio'}) - [:Relationship{name:'represents work'}]-> (m) return distinct m.name limit 1"}, {"query": "Can you name three more names for this thing that was built in 1974?", "cypher": "match (m:ENTITY{name:'1974'}) <- [:Relationship{name:'time of construction'}]- ((q) - [:Relationship{name:'alias'}]->(x) return x.name order by x.name limit 3"}, {"query": "What are the main awards of the 6th secondary school in Amida-ku, Taipei?", "cypher": "match (:ENTITY{name:'Sixth secondary school, Amida district, Taipei, Japan, formerly known as Amida sixth secondary school, Taipei Steel Group Limited, Japan) \u25bd'}) <- [:Describe{name:'description'}]-(h) - [:Relationship{name:'main award'}]->(x) return distinct x.name"}, {"query": "Please provide the names of the people who were born in the same place as Zhou Heilen. What are the labels of each person? Please list them in order of their number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'Zhou Heilen'}) - [:Relationship{name:'birthplace'}]->(:ENTITY) <- [:Relationship{name:'birthplace'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Help me find a soup made with red beans.", "cypher": "match (:ENTITY{name:' red bean'}) <- [:Relationship{name:' main ingredient'}]-(m), (m) - [:Relationship{name:' classification'}]->(n) where n.name='pumpkin' return distinct m.name"}, {"query": "What is the boiling point of coconut oil?", "cypher": "match (:ENTITY{name:'broth'}) - [:Relationship{name:'broth'}]->(n) return n.name as name union all match (:ENTITY{name:'broth'}) - [:Relationship{name:'broth'}]->(m) return m.name as name"}, {"query": "Please tell me about the hotel that has a label relationship with Marwa Hostel on the 2nd floor?", "cypher": "The name of the game is \"Machine\" (Machine)"}, {"query": "What is the list of the people who were released on January 19, 2016?", "cypher": "match (:ENTITY{name:'19 January 2016'}) <- [:Relationship{name:'published time'}]- (n) return distinct n.name"}, {"query": "How about a 100 TV HD player with five words?", "cypher": "match (:ENTITY{name:'100TV HD player'}) --(q) with q order by q.name return distinct q.name skip 1 limit 5"}, {"query": "What is TCL i880?", "cypher": "match (n:ENTITY{name:'TCL i880'}) --(x) return x.name"}, {"query": "I want to know about the five smartwatches produced by Guangdong Little Genius Technology Co., Ltd.", "cypher": "match (n:ENTITY{name:'small genius phone watch'}) - [*]->(x) where x.name <>'Canton Small Genius Technology Co. Ltd' return distinct x.name limit 5"}, {"query": "If you were born on December 17, 1992, do you have a tattoo that represents your work?", "cypher": "match (:ENTITY{name:'December 17, 1992'}) <- [:Relationship{name:'date of birth'}]- ((q),(q) - [:Relationship{name:'represents work'}]->(n) return distinct n.name limit 1"}, {"query": "What is the shortest path between the two layers of Doctor Who and Godzilla 920?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortestpaths'}) - [*..2]-(b:ENTITY{name:'shortestpaths'})) return count ((p)"}, {"query": "What are the 10 occupations of people born in October 1964?", "cypher": "match (:ENTITY{name:'September 1964'}) <- [:Relationship{name:' date of birth'}]-(n),(n) - [:Relationship{name:' occupation'}]->(q) return n.name order by n.name,q.name limit 10"}, {"query": "Tell me, what is the heyday of the profession in the 21st century?", "cypher": "match (:ENTITY{name:'Twenty-first Century'}) <- [:Relationship{name:'Primordial'}]- (q) return distinct q.name"}, {"query": "Which universities and which postgraduate departments of the Graduate School of Sichuan Teachers' University belong to the same category and which labels are used by each school, please sort by the number of labels for each school from small to large.", "cypher": "match (n:ENTITY{name:'Sichuan Teaching University Graduate School Graduate Department'}) - [:Relationship{name:'category'}]->(:ENTITY) <- [:Relationship{name:'category'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) ORDER BY c"}, {"query": "Do you know the chemical formula for total foliar green protein?", "cypher": "match ((:ENTITY{name:' total leaf green'}) - [:Relationship{name:' chemical formula'}]-> (x) return x.name"}, {"query": "What are the game labels? Can you tell me 3?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "What are the books published by Tianjin University Press? When were they published? Can you list 5 good ones?", "cypher": "match (:ENTITY{name:' Tianjin University Press'}) <- [:Relationship{name:' Tianjin University Press'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Can you help me find three FPS games and their developers?", "cypher": "match (:ENTITY{name:'FPS'}) <- [:Relationship{name:'game type'}]-(h),(h) - [:Relationship{name:'developer'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "I need five pieces of information about the two Sinhalese villagers in Yamuna?", "cypher": "match (n:ENTITY{name:'send countrymen to the jungle'}) - [*]->(x) where x.name <>'\u4e07\u91cc' return distinct x.name limit 5"}, {"query": "How many people have a hotline set up by the National Intellectual Property Office?", "cypher": "match (h:ENTITY{name:'Setting by the National Intellectual Property Office'}) <- [:Relationship{name:'unit'}]- (m) return m.name"}, {"query": "Can you give me a medical book about the 80 different types of double-layered relationships that occur with thyroid dysfunction?", "cypher": "match (n:ENTITY{name:'80 how to do about thyroid dysfunction'}) - [:Relationship*1..2]->(x) where x.name <> 'medicine' return distinct x.name"}, {"query": "Do you know which school Xu Zhifei is the best teacher in?", "cypher": "match (:ENTITY{name:'Huang Yue'}) <- [:Relationship{name:'Excellent teacher'}]- (q) return q.name limit 5"}, {"query": "What is the first article by Zhang Jiwa?", "cypher": "match (:ENTITY{name:' Zhang Zhihua [West double-edited as co-chair]'}) --(q) return q.name order by q.name limit 1"}, {"query": "Can you list the five types of relationships that are involved in the two layers?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'once upon a time'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 5"}, {"query": "Which film won the Best Actor Award at the Venice Film Festival?", "cypher": "Match (:ENTITY{name:'Bentley's Award for Best Actor in a Television Series - Drama)"}, {"query": "What are the main achievements of Yuen Yanqing?", "cypher": "match (:ENTITY{name:'\u91ca\u5ef6, Henan, born 28 April 1972, Han Chinese \u3014'}) <- [:Describe{name:'description'}]-(n),(n) - [:Relationship{name:'main achievements'}]->(q) return distinct q.name limit 5"}, {"query": "What are the TV series produced by SBS in South Korea?", "cypher": "Match (n:ENTITY{name:'SBS TV station in South Korea'}) <- [:Relationship{name:'production company'}]- (h) return h.name"}, {"query": "The University of Tokyo recommends 10 excellent departments in addition to craft and artistic design.", "cypher": "match (:ENTITY{name:'public office university'}) <- [:Relationship{name:'category'}]-(m) - [:Relationship{name:'main faculty'}]->(q) where q.name <> 'process artwork design' return distinct q.name limit 10"}, {"query": "The top 10 Chinese names for the world's literature analysis?", "cypher": "match (:ENTITY{name:'world literature analysis'}) - [:Relationship{name:'Chinese name'}]-> (x) with x order by x.name return distinct x.name limit 10"}, {"query": "He was awarded the title of the Hanchuan City Language Standardisation Demonstration Park by the school, which was built in 1984.", "cypher": "match (:ENTITY{name:'1984'}) <- [:Relationship{name:'time of founding'}]-(q) - [:Relationship{name:'main award'}]->(m) where m.name <> 'Hanchuan City Language Standardisation Demonstration Park' return distinct m.name limit 5"}, {"query": "Who is this man's ex-girlfriend, who works at Seed Music Limited?", "cypher": "match (:ENTITY{name:'Seed Music Ltd'}) <- [:Relationship{name:'record company'}]-(h) - [:Relationship{name:'ex-girlfriend'}]->(n) return distinct n.name"}, {"query": "The Princess of the Temple is a fantasy novel, do you know how many words it has in total?", "cypher": "match ((:ENTITY{name:' Princess of the Temple'}) - [:Relationship{name:' total number of characters'}]-> (x) return x.name"}, {"query": "The number of fighter jets has reached over 700, please?", "cypher": "match (:ENTITY{name:'700 more than'}) <- [:Relationship{name:'number'}]- (m) return distinct m.name"}, {"query": "What chemical is 22224-41-5?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "I would like to know about the 21st century curriculum published by five higher education publishers: Introduction to the five-tier relationship of numerical approximation.", "cypher": "match (n:ENTITY{name:'Teachable for 21st century curriculum: numerical approximation'}) - [*1..5]->(x) where x.name <> 'Higher education publisher' return distinct x.name limit 5"}, {"query": "Please give me a personal introduction to the relationship between five Syrian Sleman Youssef in the sixth tier?", "cypher": "match (n:ENTITY{name:'Sleman Youssef'}) - [*1..6]->(x) where x.name<>'Syria' return distinct x.name limit 5"}, {"query": "You know Mad Max is an Australian production, besides that, there are 5 messages in its 3 layers.", "cypher": "match (:ENTITY{name:'Mad Max'}) - [*1..3]-(p) where p.name <> 'Australia' return distinct p.name limit 5"}, {"query": "What is the original name of the 1972 Container Customs Convention that we follow?", "cypher": "match ((:ENTITY{name:'Container Customs Convention of 1972'}) - [:Relationship{name:'original name'}]-> (n) return n.name"}, {"query": "The earthquake's magnitude was 37.6 degrees north latitude and 102.3 degrees east longitude.", "cypher": "match (:ENTITY{name:'Northeast 37.6 degrees, east 102.3 degrees'}) <- [:Relationship{name:'Earthquake latitude'}]- (x) return x.name"}, {"query": "Do you have any titles for the Tianjin-born writer?", "cypher": "match (p:ENTITY{name:' Tianjin'}) <- [:Relationship{name:' place of birth'}]- ((m) - [:Relationship{name:' representing work'}]->(h) return distinct h.name limit 2"}, {"query": "What plants can be used as medicines by the sub-plant?", "cypher": "match (:ENTITY{name:' by sub-plant gate'}) <- [:Relationship{name:' by sub-plant gate'}]-(m), (m) - [:Tag{name:' label'}]->(n) where n.name='drug' return distinct m.name limit 10"}, {"query": "Can you name a few earthquakes of magnitude 6.1?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "The people who were born in Shandong East Luizhou Province called you \"Mummy\", what are your main achievements?", "cypher": "match (:ENTITY{name:'Santondo East Road \u76ca\u90fd\u5e9c ((now Santondo Qingzhou) '}) <-[:Relationship{name:'Born'}]-(p),(p) -[:Relationship{name:'Major achievements'}]->(m) return distinct p.name,m.name"}, {"query": "Can you summarize the 2012 research report on the cable industry in three words?", "cypher": "match (:ENTITY{name:'2012 Wire Cable Industry Research Report'}) --(h) with h order by h.name return h.name limit 3"}, {"query": "Can you tell me what kind of relationship the dolls are involved in in the three layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'confused doll'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "The following is a list of the top 20 South Korean small business towns in order of their population, in order of their population.", "cypher": "match (:ENTITY{name:'South Korea small trading city'}) - [*1..3]-(p) return p.name order by p.name DESC limit 20"}, {"query": "The following is a list of articles related to Niyonzima Haruna, a football player from Nigeria.", "cypher": "match (n:ENTITY{name:'Niyonzima Haruna'}) - [*1..4]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "Can you name the three main departments of the Laning College Sports College?", "cypher": "match (:ENTITY{name:'Lenin College Sports College'}) <- [:Relationship{name:'Chinese name'}]-(n) - [:Relationship{name:'main faculty'}]->(h) return h.name order by h.name limit 3"}, {"query": "Please tell me the company profile of the five organizations that are part of Shanghai Hebei Area High Construction Engineering Holdings Limited.", "cypher": "match (n:ENTITY{name:'Shanghai HSW High Construction Engineering Co. Ltd'}) - [*]->(x) where x.name<>'organizing entity' return distinct x.name limit 5"}, {"query": "What are the three other names of the battle besides social events and tags?", "cypher": "match (n:ENTITY{name:'Battle of Dauphin Mountain'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'social event' and h.name <> 'war' return distinct h.name limit 3"}, {"query": "Please help me find five folk songs, who are the original singers?", "cypher": "match (:ENTITY{name:' ethnicity'}) <- [*]-(m) ,(m) - [:Relationship{name:' song originally sung'}]->(n) return m.name,n.name limit 5"}, {"query": "I would like to know about the information related to Spachuck Ruben in the 2nd level relationship?", "cypher": "match (n:ENTITY{name:'Spachuck Ruben'}) - [*]->(x) where x.name<>'Spachuck Ruben' return distinct x.name limit 5"}, {"query": "You don't know who the representative of the song is?", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship{name:'representative work'}]- (m) return distinct m.name"}, {"query": "What games were released on 21-09-25? Can you list 7?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "The exclusion type is one of the four great seal stones of traditional Chinese pottery. What else do you know about the Yellow Scroll Stone?", "cypher": "match (:ENTITY{name:'\u9ec4\u7a3f\u8001\u77f3'}) - [*1..2]-(p) where p.name <> 'One of the four great seals of Chinese traditional cuisine' return p.name limit 4"}, {"query": "Can you name two people who have a relationship with Sean Ray?", "cypher": "The name of the game is \"Return\" (RETURN)"}, {"query": "Tell me what is the second level of the relationship between talking and fighting games?", "cypher": "Match (n) - [:Tag*2{name:'tag'}]->(p:ENTITY{name:'fighting game'}) RETURN distinct n.name limit 5"}, {"query": "The book is priced at what you know?", "cypher": "match (:ENTITY{name:' internal audit'}) <- [:Relationship{name:' book name'}]- ((n) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "The minimum number of pencils is 10, what is the minimum total?", "cypher": "match (:ENTITY{name:'10'}) <- [:Relationship{name:'outdoor painting'}]- ((n) - [:Relationship{name:'total painting'}]->(m) return min(m.name)"}, {"query": "Can you tell me all the information about the relationship between the two layers of the relationship that is involved in the rape?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'switched off'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you please list 16 of the authors of the novels that are under A-level contracts?", "cypher": "match (n:ENTITY{name:'A-level contract'}) <- [:Relationship{name:'authorized status'}]- (p) return p.name limit 16"}, {"query": "Can you tell me what the size of the infrared touch screen type is?", "cypher": "match (:ENTITY{name:'infrared touch screen'}) <- [:Relationship{name:'screen type'}]-(h) - [:Relationship{name:'product size'}]->(m) return distinct m.name limit 4"}, {"query": "Can you tell me which year is the leap year on the lunar calendar?", "cypher": "Match (:ENTITY{name:'three years'}) <- [:Relationship{name:'year'}]- (h) return h.name"}, {"query": "Can you recommend three mainland Chinese films?", "cypher": "match (:ENTITY{name:'Mainland China'}) <- [:Relationship{name:'producer area'}]- (n) return n.name limit 3"}, {"query": "Can you find the sites created by the three generations?", "cypher": "match (:ENTITY{name:'\u5143\u4ee3'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'geographical location'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "The first prize winner of the China Flower Show, what other three awards has he won?", "cypher": "match (:ENTITY{name:'painter'}) <- [:Relationship{name:'profession'}]-(h) - [:Relationship{name:'main achievement'}]->(n) where n.name <> 'China flower painting exhibition first class prize' return distinct n.name limit 3"}, {"query": "The geographer of which dynasty was Xu Xuan?", "cypher": "match (:ENTITY{name:'Xu San'}) - [:Relationship{name:'at the time'}]->(n) return n.name"}, {"query": "I would like to know which other two stations of the Pudong-Liangyan Mountain Reservoir Railway pass through, besides Fuzhou City and Lin Bridge?", "cypher": "match (n:ENTITY{name:'Mennatayu-Hanyang Mountain Reservoir Railway'}) - [:Relationship{name:'Passing by site'}]->(h) with h order by h.name where h.name <> 'Fuji City' and h.name <> 'Lingbridge' return h.name limit 2"}, {"query": "Do you know all the details of the relationship between Nikola Dlincic and the two?", "cypher": "The following pages link to The Unknown:"}, {"query": "What are the three occupations of Liu?", "cypher": "match (:ENTITY{name:'Liang Imping, male, Han, born March 1970, born in Liaoning, Jinzhou, participated in work in July 1993, joined the Party in June 1997, university degree\u3002'})"}, {"query": "What other names are there for the drug, besides Tamoxifen and Tamoxetine?", "cypher": "match (n:ENTITY{name:'Atosetine'}) - [:Relationship{name:'alias'}]->(h) where h.name <> 'Tomoxetine' and h.name <> 'Tomoxetine' return distinct h.name limit 1"}, {"query": "I'm not sure if you're interested in the artwork, but I'm not sure if you're interested in the artwork.", "cypher": "match (:ENTITY{name:'sandbush'}) <- [:Relationship{name:'s Chinese name'}]- ((p),(p) - [:Relationship{name:'s representative work'}]->(q) return distinct q.name"}, {"query": "I'm not sure if you're familiar with the film, but I'm curious to know what other works the director has.", "cypher": "match (q:ENTITY{name:'\u9ec4\u5de8\u9f99'}) <- [:Relationship{name:'director'}]- (x) return x.name"}, {"query": "What is the shortest path between the village of Wang Fu Bay and the village of Yangtai?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Village of the King of Fujian'}) - [*..2]-(b:ENTITY{name:'Village of the King of Fujian'})) return count ((p))"}, {"query": "What profession does the person born in 1951 have besides being a famous calligrapher? Give five results.", "cypher": "match (:ENTITY{name:'1951'}) <- [:Relationship{name:'date of birth'}]-(m) - [:Relationship{name:'profession'}]->(h) where h.name <> 'famous calligrapher' return distinct h.name limit 5"}, {"query": "What else do you know about the University of T\u00fcbingen besides the public university?", "cypher": "match (:ENTITY{name:'University of T\u00fcbingen'}) - [:Relationship*1..2]-(p) where p.name <> 'public university' return p.name limit 10"}, {"query": "Can you tell me about the main achievements of Liang Zhenping?", "cypher": "match (:ENTITY{name:'Liang Yixing'}) - [:Relationship{name:'main achievements'}]-> (n) return n.name order by n.name limit 3"}, {"query": "Please list three characters represented in Violet Noziere's work.", "cypher": "match (:ENTITY{name:'Violet Nozi\u00e8re'}) <- [:Relationship{name:'represents work'}]- (p) return distinct p.name limit 3"}, {"query": "What do people who graduate from supply and distribution schools in Henan Province do for a living?", "cypher": "match (:ENTITY{name:'School of supply and supply in Henan Province'}) <- [:Relationship{name:'Graduate School'}]-(n) - [:Relationship{name:'Profession'}]->(m) return distinct m.name"}, {"query": "Please tell me about the tags of the Zhongshan nationals.", "cypher": "match (:ENTITY{name:'sound record'}) - [:Tag{name:'tag'}]-> (q) return distinct q.name"}, {"query": "I want to know 5 personal details about this guy Jo-ju.", "cypher": "match (n:ENTITY{name:'Jo Yu-chan'}) - [*]->(x) where x.name <> 'person' return distinct x.name limit 5"}, {"query": "Can you tell me about the types of relationships that exist in the two levels of Vente Square?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)"}, {"query": "I'm going to write a list of three 1-amino acids.", "cypher": "match (:ENTITY{name:'1-amino acid'}) --(q) with q order by q.name return q.name limit 3"}, {"query": "Please tell me whose representative work is better for the mother of Moses?", "cypher": "match (x:ENTITY{name:'Relationship{name:'represents work'}]- (q) return q.name order by q.name"}, {"query": "Do you know who is the actress in the movie \"The Sisterhood of the Traveling Pants\"?", "cypher": "match (:ENTITY{name:'the starry night'}) --(n) return distinct n.name"}]