[{"query": "Where is the origin of the three-colored squirrel?", "cypher": "match (:ENTITY{name:'Triple Squirrel'}) - [:Relationship{name:'Origin'}]->(m) return distinct m.name"}, {"query": "Do you know the Chinese name of the author of the novel 1761699378?", "cypher": "match (:ENTITY{name:'1761699378'}) <- [:Relationship{name:'author'}]-(h),(h) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 1"}, {"query": "Do you have any information on Jonjo Kenny that you can give me?", "cypher": "match (q:ENTITY{name:'John Joe Kenny'}) --(m) return distinct m.name"}, {"query": "What are the works of the same year as the creation of the girl friend of the arrogant heaven? Please help me sort them in the correct order according to the number of labels of each work.", "cypher": "match (n:ENTITY{name:'spoiled girlfriend'}) - [:Relationship{name:'created time'}]->(:ENTITY) <-[:Relationship{name:'created time'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Please help me find three crime movies with the main characters.", "cypher": "match (:ENTITY{name:'crime film'}) <--(m), (m) - [:Relationship{name:'leading actor'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "What are the main achievements of students who graduated from Jiangxi Business School?", "cypher": "match (:ENTITY{name:'Jiangxi School of Economics'}) <- [:Relationship{name:' Graduate School'}]- ((n) - [:Relationship{name:' Major achievements'}]->(p) return distinct p.name"}, {"query": "I only remember that the winner of the 72nd Golden Globe Awards for Best Actress in a Musical/Comedy Series was Gina Rodriguez.", "cypher": "match (:ENTITY{name:'Virgin Romance'}) - [:Relationship{name:'Main Award'}]-> (n) with n order by n.name where n.name <> '72nd Golden Globe Awards Television category Musical/comedy series Best actress Gina Rodriguez' return n.name"}, {"query": "Can you recommend the two novels that are being published online in Chinese?", "cypher": "match (:ENTITY{name:'creation Chinese language website'}) <-[:Relationship{name:'linked website'}]-(m) -[:Relationship{name:'Chinese language name'}]->(p) return distinct p.name limit 2"}, {"query": "Who is the originator of the 12P theory in marketing theory?", "cypher": "match ((:ENTITY{name:'12p'}) - [:Relationship{name:'proponent'}]-> (p) return p.name"}, {"query": "Do you know what the name of the game king is in foreign languages?", "cypher": "match (:ENTITY{name:'game king'}) <- [:Relationship{name:'login work'}]-(x),(x) - [:Relationship{name:'foreign language name'}]->(q) return distinct q.name limit 1"}, {"query": "There is a layer 6 of the network conversion protocol called representation layer, what is this gateway?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "What do students who graduated from the photography department at Seoul National University of Arts do?", "cypher": "match (:ENTITY{name:'Seoul University of the Arts' photography department'}) <- [:Relationship{name:' graduate school'}]-(n) - [:Relationship{name:' profession'}]->(m) return distinct m.name limit 1"}, {"query": "The following is a list of the three-layer relationships in the poetic work of the poet Zhang Zhen, the poet who wrote the poem, the painting of the double-headed dragon.", "cypher": "match (n:ENTITY{name:'Picture of the double quotation marks'}) - [*1..3]->(x) where x.name<>'Picture of the double quotation marks is a poetic work by the poet Zhang Zhen;' return distinct x.name"}, {"query": "What is the altitude range of Hainan purple oak trees and where are they now mainly distributed?", "cypher": "match (:ENTITY{name:'Hainan Purple Oak'}) - [:Relationship{name:'Heavenly call upper limit'}]->(n) return n.name as name union all match (:ENTITY{name:'Hainan Purple Oak'}) - [:Relationship{name:'Distributed area'}]->(m) return m.name as name"}, {"query": "Do you know who is the most representative of the artists who are in love with the actress?", "cypher": "match (:ENTITY{name:'relationship'}) <- [Relationship{name:'representative work'}]- (n) return distinct n.name"}, {"query": "Can you list 14 Japanese novels?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'region'}]- (m) return m.name limit 14"}, {"query": "What are the areas of the Shandong Peninsula Cluster of Cities and what are the famous attractions?", "cypher": "match (:ENTITY{name:'Sandong Peninsula city group'}) - [:Relationship{name:'region'}]->(n) return n.name as name union all match (:ENTITY{name:'Sandong Peninsula city group'}) - [:Relationship{name:'famous attractions'}]->(m) return m.name as name"}, {"query": "The NATO code for Operation Allied came from what event?", "cypher": "match (p:ENTITY{name:'Allied operation'}) <- [:Relationship{name:'NATO code'}]- (m) return distinct m.name"}, {"query": "Which bands are in the acid jazz style?", "cypher": "match (:ENTITY{name:'Acid Jazz'}) --(x) return distinct x.name"}, {"query": "What is the Chinese name of Stanley Matthews?", "cypher": "The name of the game is \"Relationship\" (n.e."}, {"query": "Is there any trouble finding the next entertainment film directed by Wang Yuen?", "cypher": "The film was released on DVD in the United States on July 15, 2010, by Warner Bros. Pictures."}, {"query": "Do you have any relationship names for the students' union in the 5th floor of Shenyang Master University?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Shenyang Teachers College Student Union'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 2"}, {"query": "Can you recommend a famous attraction that is open all day?", "cypher": "match (:ENTITY{name:'all day'}) <- [:Relationship{name:'open hours'}]- ((x),(x) - [:Relationship{name:'famous attractions'}]->(n) return distinct n.name limit 1"}, {"query": "In the end, the novel was a story about a couple who wanted to marry you in a two-tiered relationship.", "cypher": "match (n:ENTITY{name:'I wanted to marry you'}) - [:Relationship*1..2]->(x) where x.name <>'complete' return distinct x.name"}, {"query": "Do you know what kind of relationship exists between the two layers of security that are covered in this film?", "cypher": "The following is a list of all the links in the link:"}, {"query": "What are the other occupations of Liu, born in 1922-1998 in Hebei's Dong County, besides being a deputy secretary? List three.", "cypher": "match (:ENTITY{name:'Coward(1922-1998), Hebei Tang County man\u3002'}) <-[:Describe{name:'description'}]-(m) -[:Relationship{name:'profession'}]->(x) where x.name <> 'Deputy secretary' return distinct x.name limit 3"}, {"query": "Please tell me how many times the car body category is 25b, 25g mixed and is currently in green?", "cypher": "match (:ENTITY{name:'25b\u300125g mixed up with green brushes'}) <- [:Relationship{name:'body type'}]- (n) return distinct n.name"}, {"query": "Tell Me a Tale of a Wolf II won the main awards in addition to the Chinese Film Week Golden Lion Award for Best Film and the Best Film at the China American Film Festival.", "cypher": "match (n:ENTITY{name:'Wolf II'}) - [:Relationship{name:'main award'}]->(h) where h.name <> 'Best film of the Chinese Film Week Golden Lion Awards' and h.name <> 'Best film of the Chinese American Film Festival' return distinct h.name limit 1"}, {"query": "What instruments are not recommended to install yourself? Can you list 10?", "cypher": "match (:ENTITY{name:'not recommended to install by yourself'}) <- [:Relationship{name:'installation type'}]- (h) return h.name limit 10"}, {"query": "The film is a tribute to the late Lee Jong-il, who was the first person to be honoured with the award.", "cypher": "match (:ENTITY{name:'sweet to meet you Lee Jung-hyun'}) <- [:Relationship{name:'represents work'}]- (q) return distinct q.name"}, {"query": "Can you help me check out this literary work, Dream Return to Liangsan, how many words is it?", "cypher": "match ((:ENTITY{name:'Relationship{name:'word count'}]-> (q) return q.name)"}, {"query": "Help me find 10 words that read ibi.", "cypher": "match (:ENTITY{name:'b\u00ec'}) <- [:Relationship{name:'spelling'}]-(m) return distinct m.name limit 10"}, {"query": "I'm looking for a list of famous alumni of Chen Yifei's school.", "cypher": "match (:ENTITY{name:'Chen Yifei'}) <- [:Relationship{name:'known alumni'}]- (n) return distinct n.name limit 1"}, {"query": "Please tell me which four categories of tofu and cheesecake can be classified apart from grilling and baking?", "cypher": "match (n:ENTITY{name:'tofu meat and cheesecake'}) -[:Relationship{name:'category'}]->(h) where h.name <> 'grill' and h.name <> 'oven' return distinct h.name limit 4"}, {"query": "Can you tell me about Zhang's profession?", "cypher": "match (:ENTITY{name:'\u5f20\u7af9\u6e05'}) <--(q) - [:Relationship{name:'profession'}]->(m) return distinct q.name"}, {"query": "What is the profession of the writer of the story?", "cypher": "match (:ENTITY{name:'Relationship{name:'profession'}}) - ((q) return distinct q.name limit 3"}, {"query": "I wondered if the time of the expedition: Martherin flew to another message line in the universe of the two-layer relationship?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' time of exploration: Martherin flew into the universe; unfolded '}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 1"}, {"query": "Can you recommend me the top 10 most popular places to visit in Bali?", "cypher": "match (:ENTITY{name:'the top ten most beautiful places'}) - [:Relationship{name:'famous places'}]-> (x) return x.name order by x.name"}, {"query": "What file is located in the root folder under the root directory?", "cypher": "match (:ENTITY{name:'in the root folder under the root directory'}) <- [:Relationship{name:'location'}]- (q) return q.name"}, {"query": "I would like to ask you the first three questions about your blog.", "cypher": "match (:ENTITY{name:'open homepage'}) --(q) return q.name order by q.name limit 3"}, {"query": "I'm looking forward to playing another European game of the same genre with ETC.", "cypher": "match (:ENTITY{name:'Europe'}) <- [:Relationship{name:'game origin'}]-(x),(x) - [:Relationship{name:'game type'}]->(p) where p.name <> 'ETC' return distinct p.name limit 1"}, {"query": "What does summer time mean?", "cypher": "match (:ENTITY{name:'summer time'}) - [:Describe{name:'describe'}]-> (m) return distinct m.name"}, {"query": "Can you tell me who the dragon is?", "cypher": "match (:ENTITY{name:'spoon'}) --(h) return h.name order by h.name"}, {"query": "Can you list the top three articles in the three island newsletter?", "cypher": "match (:ENTITY{name:'Sisi Island'}) --(p) return p.name order by p.name limit 3"}, {"query": "Can you find me three listed companies and tell me when they were founded?", "cypher": "match (:ENTITY{name:'listed company'}) <- [:Relationship{name:'company nature'}]-(h),(h) - [:Relationship{name:'time of establishment'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "Can you name three athletes who are 178 cm tall?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Do you know which family the red-flowered plant belongs to?", "cypher": "match ((:ENTITY{name:' red rose'}) - [:Relationship{name:' genus'}]-> (n) return n.name"}, {"query": "Can you list five famous alumni of pioneering, dedicated schools?", "cypher": "match (:ENTITY{name:' pioneer, dedicate'}) <- [:Relationship{name:' schoolwork'}]- ((m),(m) - [:Relationship{name:' well-known alumni'}]->(p) return distinct p.name limit 5"}, {"query": "The giant crowned warbler belongs to what family and is mainly distributed in which regions?", "cypher": "match (:ENTITY{name:'Relationship{name:'category'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'distribution area'}) ->(m) return m.name as name"}, {"query": "Show me two types of personal information in the three-tier relationship of this person Al-Alaan Rashid?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Al-Alaan Rashid'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 2 This is a list of all the different ways Al-Alaan Rashid is credited in the database."}, {"query": "When was the Guangdong Foreign Language School affiliated to the Foreign Trade University founded? Who is the principal?", "cypher": "match (:ENTITY{name:'Relationship{name:'time of foundation'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'currently rector'}) ->(m) return m.name as name"}, {"query": "Where do the Kanuri live?", "cypher": "match (:ENTITY{name:'Canurians'}) - [:Relationship{name:'residence'}]->(m) return distinct m.name"}, {"query": "I would like to know the details of the organization, the Tair\u0101hara City Education Department, the family education public benefit report, the five-tier relationship between the faculty and the teachers.", "cypher": "match (n:ENTITY{name:'Teachers' group of the Taipei City Education Department's Family Education Public Benefit Report'}) - [*1..5]->(x) where x.name <> 'organizing institution' return distinct x.name"}, {"query": "Do you know of any websites that are affiliated with the third tier of the Lifesize Network?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'lifting net'}) return distinct n.name"}, {"query": "The message of the novel No More Wish Lost Paradise?", "cypher": "match (:ENTITY{name:'No More Wish \u5931\u4e50\u56ed'}) --(x) with x order by x.name where x.name <> 'fantasy novel' return x.name"}, {"query": "What is the aurora borealis? How does it form?", "cypher": "match (n:ENTITY{name:'Southern Lights'}) - [:Relationship{name:'forming conditions'}]->(h) optional match(n) - [:Describe{name:'tags'}]->(x) return h.name,x.name"}, {"query": "Do you know the top 10 jobs that Chinese people do?", "cypher": "match (h:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]- ((p) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 10"}, {"query": "Can you tell me which game is organized by the Guangdong Provincial Football Association, the Foshan Municipal Sports Bureau?", "cypher": "match (:ENTITY{name:' Guangdong Provincial Football Association, Sports Bureau of Foshan City'}) <- [:Relationship{name:'hosting agency'}]- (h) return h.name"}, {"query": "Do you know which two primary schools in the city of Yamagata have won the most awards besides the provincial green school and the city's five-star school?", "cypher": "match (n:ENTITY{name:' Second Primary School of the City of Xiamen's Ma Store'}) - [:Relationship{name:' Major Award'}]->(h) where h.name <> ' Provincial Green School' and h.name <> ' City Five Star School' return distinct h.name limit 3"}, {"query": "Do you know whose main work is that of the youth that cries out?", "cypher": "match (:ENTITY{name:'that youth that wailed over'}) <- [:Relationship{name:'main work'}]- (h) return distinct h.name"}, {"query": "Please tell me about one of the author's representative works.", "cypher": "match (:ENTITY{name:'writer'}) <- [:Relationship{name:'profession'}]-(p) - [:Relationship{name:'representative work'}]->(x) return x.name order by x.name limit 1"}, {"query": "Can you tell us about the top three representative works of David Carmon?", "cypher": "match (:ENTITY{name:'David Carmon'}) - [:Relationship{name:'represents work'}]-> (x) return x.name order by x.name limit 3"}, {"query": "I would like to know about the English dictionary quotes in this book, besides the 481 pages, published on February 1, 2005, and the other information, you can find me 6 of them.", "cypher": "match (n:ENTITY{name:' English dictionary reference'}) -->(h) with h order by h.name where h.name <> '481 pages' and h.name <> '2005/2/1' return h.name limit 6"}, {"query": "What is the message of Little Ding except the animation?", "cypher": "match (:ENTITY{name:' little pudding'}) --(m) with m order by m.name where m.name <> 'animated image' return distinct m.name limit 1"}, {"query": "The book is priced at $2.99 per book.", "cypher": "match (:ENTITY{name:' design and reconstruction'}) <- [:Relationship{name:' book name'}]- ((n) - [:Relationship{name:' pricing'}]->(q) return distinct q.name limit 3"}, {"query": "What chemical has the CAS number 64-17-5?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "I would like to ask you if you know about the three representative works of this person born in Jiangxi.", "cypher": "match (:ENTITY{name:' Jiangxi'}) <- [:Relationship{name:' birthplace'}]-(x),(x) - [:Relationship{name:' representing work'}]->(h) return h.name order by h.name limit 3"}, {"query": "Please help me find out the names of three politicians, how long have they been in office?", "cypher": "match (:ENTITY{name:'politician'}) <--(m), (m) - [:Relationship{name:'term'}]->(n) return m.name, n.name limit 3"}, {"query": "Does anyone know what the nature of the company is of Sichuan Ryzen Family Limited?", "cypher": "match (:ENTITY{name:'Sichuan Ryzen Family Limited'}) <- [:Relationship{name:'company name'}]-(n) - [:Relationship{name:'company nature'}]->(p) return distinct p.name limit 1"}, {"query": "Can you tell me who is the representative of Chen Chen? Can you tell me 10?", "cypher": "match (:ENTITY{name:'Chen Chen's Cancan'}) <- [:Relationship{name:'Chinese name'}]- ((x) - [:Relationship{name:'representative person'}]->(h) return h.name order by h.name limit 10"}, {"query": "What other job does the group have besides running the party and personnel?", "cypher": "match (n:ENTITY{name:'Conscious group'}) - [:Relationship{name:'Career'}]->(h) where h.name <> 'responsible for party affairs' and h.name <> 'personal affairs' return distinct h.name limit 1"}, {"query": "I'd like to know about Liu Kang [the founder of finite element theory in China, pioneer of computational mathematics research], can you tell me about it?", "cypher": "match (:ENTITY{name:'Qian Kang [founder of Chinese finite element theory, pioneer of computational mathematics research]'}) --(h) return distinct h.name"}, {"query": "What country is the Karelian people from? How many people live there?", "cypher": "match (:ENTITY{name:'Karelian'}) - [:Relationship{name:'category'}]->(n) return n.name as name union all match (:ENTITY{name:'Karelian'}) - [:Relationship{name:'population'}]->(m) return m.name as name"}, {"query": "I need a game about the Agile game Owl Pump for 3 layers of relationships?", "cypher": "match (n:ENTITY{name:'Owl Pumpkin'}) - [*1..3]->(x) where x.name <>'Agile game' return distinct x.name"}, {"query": "Where will the 2013 Rage Against the Machine Pop Awards be held?", "cypher": "Match ((:ENTITY{name:'2013 annual Rage Pop Awards'}) - [:Relationship{name:' location'}]-> (h) return h.name"}, {"query": "How do you describe the 9/11 Cuban Airlines crash in 10 words?", "cypher": "match (:ENTITY{name:'11\u00b74 Cuban Airlines crash'}) --(p) with p order by p.name return p.name limit 10"}, {"query": "What are the Tier 3 protected plants in Yunnan, Tibet and other places?", "cypher": "match (:ENTITY{name:'Yunnan, Tibet (Metohija) }) <-[:Relationship{name:'Distribution area'}]-(m), (m) -[:Relationship{name:'Protection level'}]->(n) where n.name='3 level' return distinct m.name"}, {"query": "I would like to know what other important information is in the 2014 Ningbo City Government Work Report besides the four reports by former Mayor Liu Zhuo?", "cypher": "match (:ENTITY{name:'Ningbo City Government Work Report 2014'}) --(m) with m order by m.name where m.name <> 'Lu Zhuyu' return distinct m.name limit 4"}, {"query": "The story of the 012 Mayan calendar.", "cypher": "match (:ENTITY{name:'012 Maya chronicle'}) --(h) with h order by h.name return h.name"}, {"query": "The 127 hours have a rubber label feature?", "cypher": "match (:ENTITY{name:'127 hours'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "What is the shortest word for the method and the rules of poetry?", "cypher": "match (:ENTITY{name:'The method and rules of composition of poetry\u3002'}) <-[:Relationship{name:'interpretation'}]-(m) return min(m.name)"}, {"query": "What chemical has a molecular mass of 140.57?", "cypher": "The name of the function is the name of the function itself."}, {"query": "The following is a list of 7 industrial products and their characteristics.", "cypher": "match (:ENTITY{name:'Industrial product'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'attribute'}]->(n) return m.name, n.name limit 7"}, {"query": "Cold-blooded President: Little wife, what is the name of the main character in the novel?", "cypher": "match ((q:ENTITY{name:'Cold-blooded President: Little Wife, back'}) - [:Relationship{name:'The main character'}]-> (x) return x.name"}, {"query": "What happened to basketball on October 12, 2010?", "cypher": "match (:ENTITY{name:'October 12, 2010'}) <- [:Relationship{name:' time of occurrence'}]- (q) return q.name"}, {"query": "Ro lists the works of Chen Chilin, in the name of the title of the house, Five-Year-Old Four-Year-Old, can you introduce the works on the three-tier relationship?", "cypher": "match (n:ENTITY{name:'subject's name'}) - [*1..3]->(x) where x.name<>'subject' return distinct x.name"}, {"query": "Can you help me find one of the relevant labels for the London 2012 Olympic Commemorative Stamp Collection?", "cypher": "match (:ENTITY{name:'2012 London Olympics postage stamp commemorative coin collection'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 1"}, {"query": "Please help me introduce the filter server.", "cypher": "match (:ENTITY{name:'fluorescence server'}) - [:Tag{name:'tag'}]->(m) return distinct m.name"}, {"query": "Do you know how many literary genres are in the inscription genre?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Do you know of any publications that have been published on 1/6/2002 and can you tell their publishers?", "cypher": "match (:ENTITY{name:'2002/6/1'}) <- [:Relationship{name:' time of publication'}]- ((x),(x) - [:Relationship{name:' publisher'}]->(q) return distinct q.name"}, {"query": "Can you tell me five things about people who can be considered actors?", "cypher": "match (x:ENTITY{name:' actor'}) --(p) return distinct p.name limit 5"}, {"query": "I'm not sure if you can tell me the information about the statistics of the girls in the city.", "cypher": "match (:ENTITY{name:'Little girl from the slums'}) --(p) with p order by p.name return p.name"}, {"query": "What is the chemical formula for a granite?", "cypher": "match (:ENTITY{name:'Granite'}) - [:Relationship{name:'chemical formula'}]-> (m) return distinct m.name"}, {"query": "What chemical has a molecular mass of 176.26? Can you say 12?", "cypher": "The name of the function is the name of the function itself."}, {"query": "What are the names of the three levels of relationships involved in the Pingyang Province Shining Experimental School?", "cypher": "The following pages link to The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns"}, {"query": "The school's current principal, who is a teacher, recommended that the school not include three departments, including the architecture department.", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'currently rector'}]-(x) - [:Relationship{name:'main faculty'}]->(h) where h.name <> 'architecture' return distinct h.name limit 3"}, {"query": "01:30 Riyadh earthquake, your home was okay, do you know what the magnitude of the earthquake was?", "cypher": "match ((:ENTITY{name:'01\u00b730 Rijiyum earthquake'}) - [:Relationship{name:'seismic intensity'}]-> (p) return p.name"}, {"query": "Which four major awards have been won by the school at 8 Beijing Central Road in the city of Zhejiang?", "cypher": "match (:ENTITY{name:'Beijing Central Road 8 in Sichuan City'}) <- [:Relationship{name:'School address'}]-(h),(h) - [:Relationship{name:'Main award'}]->(n) return distinct n.name limit 4"}, {"query": "Please help me identify the three types of eye diseases and what are the common symptoms?", "cypher": "match (:ENTITY{name:' disease'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' common symptoms'}]->(n) return m.name, n.name limit 3"}, {"query": "Can you recommend 10 novels that are available on the Chinese website of Filu?", "cypher": "match (:ENTITY{name:'Filu Chinese Net'}) <- [:Relationship{name:'connected platform'}]- (n) return n.name limit 10"}, {"query": "Can you tell me about this person?", "cypher": "match (:ENTITY{name:'same as s}) --(m) return distinct m.name"}, {"query": "I have been asked to give me five engineers, where are they from?", "cypher": "match (:ENTITY{name:' engineer'}) <- [*]-(m), (m) - [:Relationship{name:' ethnicity'}]->(n) return m.name, n.name limit 5"}, {"query": "Which books have the same literary genre as the novel and have different labels? Show me how many of these books are in order of number of labels.", "cypher": "match (n:ENTITY{name:'\u5eb6\u672c\u5983'}) - [:Relationship{name:'literary genre'}]->(:ENTITY) <- [:Relationship{name:'literary genre'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) BY ORDER c DESC"}, {"query": "What festivals are organized by the National Tourism Authority?", "cypher": "match (:ENTITY{name:'National Tourism Agency'}) <- [:Relationship{name:'host'}]- (x) return x.name"}, {"query": "I would like to know when Shanghai Wuling Trading Co. Ltd. was founded, what is the scope of the company and what is the nature of the company?", "cypher": "match (:ENTITY{name:'Shanghai Gao Trading Limited'}) - [:Relationship{name:'time of establishment'}]->(n) return n.name as name union all match (:ENTITY{name:'Shanghai Gao Trading Limited'}) - [:Relationship{name:'Shanghai Gao Trading Limited'}->(m) return m.name as name union all match (:ENTITY{name:'Shanghai Gao Trading Limited'}) - [:Relationship{name:'Company character'}]->(r) return r.name as name"}, {"query": "Please tell me the information about the movie Room SP with lock and key.", "cypher": "match (:ENTITY{name:' locked room SP'}) --(h) return distinct h.name"}, {"query": "Is there any information on the names of the relationships involved in the three secondary schools in Hai Men City, Jiangsu Province, in the 2nd level?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'School of three factories in Haimen City, Jiangsu Province'}) UNWIND relations(path) AS rel RETURN rel.name"}, {"query": "What does it mean to bury a broken column?", "cypher": "match (:ENTITY{name:'buried round-breaking column'}) - [:Tag{name:'tag'}]-> (m) return distinct m.name"}, {"query": "I'm wondering which train has been awarded the title of Hero Train?", "cypher": "match (x:ENTITY{name:'hero train'}) <-[:Relationship{name:'honour'}]- (q) return distinct q.name"}, {"query": "I want to repeat the work topic All the materials of the work of Yomiuri Tenjudo.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name <>'' return distinct x.name"}, {"query": "Can you tell us about the types of relationships that Hu Liqin is involved in in the six levels?", "cypher": "The following pages link to The Unknown:"}, {"query": "How many children are currently being left behind in the country?", "cypher": "match (:ENTITY{name:'Relationship{name:'number'}]->(r) return r.name"}, {"query": "Can you tell me how long the barrel of the 81 is?", "cypher": "match ((:ENTITY{name:'81 type machine gun'}) - [:Relationship{name:'gun chief'}]-> (q) return q.name"}, {"query": "Find the first three tag features of .NET Web Services Solution application programming?", "cypher": "match (:ENTITY{name: .NET Web Services Solution Application Programming'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "What are the first two license plates in the tail section?", "cypher": "match (:ENTITY{name:'tail'}) - [:Relationship{name:'plate code'}]-> (m) return distinct m.name"}, {"query": "I'm not sure if I'm familiar with the 09 crane suit.", "cypher": "match (:ENTITY{name:'09 pendant'}) --(m) with m order by m.name return m.name"}, {"query": "Help me find two famous alumni of Guangzhou Chinese Medical University", "cypher": "match (:ENTITY{name:' Guangzhou Chinese Medical University'}) - [:Relationship{name:'known alumni'}]->(r) with r order by r.name limit 2 return r.name"}, {"query": "Help me find the five words for \"zh\u00f9\".", "cypher": "match (:ENTITY{name:'zh\u00f9'}) <- [:Relationship{name:'spelling'}]-(m) return distinct m.name limit 5"}, {"query": "What medications are used to treat RLS? What is the composition of the drug?", "cypher": "match (:ENTITY{name:' less hysterical'}) <- [:Relationship{name:' mainstream'}]- ((m), (m) - [:Relationship{name:' side-effect composition'}]->(n) return distinct m.name, n.name"}, {"query": "What is the rated frequency of the 1TL0002 variable frequency motor produced by your company?", "cypher": "match ((:ENTITY{name:'1TL0002 variable frequency gearbox'}) - [:Relationship{name:'rated frequency'}]-> (m) return m.name"}, {"query": "Tell me about the three positions of the Standing Committee of the Communist Party of China's Xi'an City Anhui District Commission.", "cypher": "match (:ENTITY{name:'Committee of the Chinese Communist Party's Chiang Kai-shek District Committee'}) --(x) return distinct x.name limit 3"}, {"query": "Can you tell me about the most vital care needed by babies aged 0-3 years old?", "cypher": "match (:ENTITY{name:'0-3 years old baby most in need of life care'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 1"}, {"query": "What is the name of a CD released on September 6, 2011?", "cypher": "match (:ENTITY{name:'CD (September 6, 2011) '}) <- [:Relationship{name:'disk'}]- (m) return m.name"}, {"query": "You want to know the route of Hangzhou Metro Line 2 and 5 relevant information about Hangzhou Metro Line 5 People's Square Station?", "cypher": "match (n:ENTITY{name:'Hangzhou Metro People's Square Station'}) - [*]->(x) where x.name <>'Hangzhou Metro Line 2 Hangzhou Metro Line 5' return distinct x.name limit 5"}, {"query": "The problem is that you are not able to explain to me the three main achievements of Aleksandr Pedrov.", "cypher": "match (:ENTITY{name:'Alexander Pedrov'}) - [:Relationship{name:'main achievements'}]-> (x) return distinct x.name limit 3"}, {"query": "And what will make you know the location of the dwelling place of the King of the Twelve?", "cypher": "match (:ENTITY{name:'Wang Zhengming's home town'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'geographical location'}]->(n) return distinct n.name"}]