[{"query": "What are the main awards in public high schools? List 5?", "cypher": "match (:ENTITY{name:'public high school'}) <- [:Relationship{name:' category'}]- ((x) - [:Relationship{name:' major award'}]->(h) return distinct h.name limit 5"}, {"query": "What is the fish of the genus of the squid other than the tall plains squid?", "cypher": "match (:ENTITY{name:'Key'}) <-[:Relationship{name:'Key'}]-(m) where m.name <> 'high heels' return distinct m.name"}, {"query": "Give three professions that do not include members of the Party Group of the People's Court of Huazhong County who believe in communism.", "cypher": "match (:ENTITY{name:'Communism'}) <- [:Relationship{name:'faith'}]-(h) - [:Relationship{name:'profession'}]->(p) where p.name <> 'Washington County People's Court party member' return distinct p.name limit 3"}, {"query": "The Russian President Vladimir Putin has asked the Russian government to declare a national holiday in the Russian state of Petrograd.", "cypher": "match (:ENTITY{name:'Petrosavozk'}) <- [:Relationship{name:'capital'}]- ((x),(x) - [:Relationship{name:'National Day'}]->(q) return distinct q.name"}, {"query": "Do you know what year the concept of Kabbalah was born?", "cypher": "match (:ENTITY{name:'Kaboo'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'rise time'}]->(n) return distinct n.name limit 2"}, {"query": "Can you name some of the venues where the games are held on hard courts?", "cypher": "match (:ENTITY{name:'outdoor  hard ground'}) <- [:Relationship{name:'match venue'}]- (p) return distinct p.name"}, {"query": "Do you know what kind of job Northeast Khawaja has, say the first one is better?", "cypher": "match (:ENTITY{name:'Northeast Flower'}) - [:Relationship{name:' occupation'}]-> (q) return q.name order by q.name limit 1"}, {"query": "What are the top 10 brands with Japanese and Korean brand labels?", "cypher": "match ((:ENTITY{name:'Japanese brand'}) < - [:Tag{name:'tag'}]-> (m) with m order by m.name limit 10 return m.name"}, {"query": "What are the members of the board of directors of the Shanghai Association for Cultural Exchange Abroad?", "cypher": "match (:ENTITY{name:'Shanghai City Council of the Association for Cultural Exchange'}) <- [:Relationship{name:' as '}]-(x),(x) - [:Relationship{name:' Chinese name'}]->(q) return distinct q.name"}, {"query": "Do you know what three other names for Potosi in England are?", "cypher": "match (:ENTITY{name:'Portoxy, England'}) <- [:Relationship{name:'place of birth'}]- ((n) - [:Relationship{name:'alias'}]->(p) return distinct n.name limit 3"}, {"query": "I remember a game with a score of 6 (Monk, Monk, Yellow, Hot Beer, Wonderful, Perfect)", "cypher": "match (:ENTITY{name:'6 ((monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, monk, mon"}, {"query": "Do you have any idea what the rated voltage of your 10KV circuit breakers is?", "cypher": "match ((:ENTITY{name:'10KV circuit breaker'}) - [:Relationship{name:'rated voltage'}]-> (m) return m.name"}, {"query": "It is said that there were a lot of athletes competing in the 2010 Beijing International Marathon, do you know how many?", "cypher": "match ((:ENTITY{name:'2010 Beijing International Marathon'}) - [:Relationship{name:' number of athletes'}]-> (q) return q.name"}, {"query": "Where is the worship center of the sun god Amun?", "cypher": "match (:ENTITY{name:'Center of worship of the sun god Amon'}) --(x) return distinct x.name"}, {"query": "How many books of 32 pages have been published by Kyushu Publishing, and how many of the 10 are listed?", "cypher": "The following pages link to List of Chinese newspapers by country:"}, {"query": "I'm not sure what songs Chen Yue originally sang.", "cypher": "match (x:ENTITY{name:'Chen Yue'}) <- [:Relationship{name:'original song'}]- (m) return distinct m.name"}, {"query": "The full story of the 2007 cricket match?", "cypher": "match (:ENTITY{name:'07 cricket game'}) --(p) with p order by p.name return p.name"}, {"query": "Can you name the three teams from the Eastern Conference, and help me introduce them?", "cypher": "match (:ENTITY{name:'Eastern Union'}) <- [*]-(m), (m) - [:Describe{name:'describe'}]->(n) return distinct m.name, n.name limit 3"}, {"query": "What is the most representative work of Wu Shih-Tseung, the stage technician of the People's Art Theatre in Wuhan?", "cypher": "match (:ENTITY{name:'Wang Xie Red, stage technician, stage technician of the Wuhan People's Art Theatre\u3002'}) <- [:Describe{name:'description'}]-(x),(x) - [:Relationship{name:'representing work'}]->(h) return distinct h.name"}, {"query": "Who is Antonio Margheriti do you know?", "cypher": "match (:ENTITY{name:'Antonio Margheriti'}) --(h) return h.name order by h.name"}, {"query": "Can you name the organizations that were founded in 1968?", "cypher": "match (:ENTITY{name:'1968'}) <- [:Relationship{name:'time of creation'}]- (x) return distinct x.name"}, {"query": "What is the specifications model of the 1-amino cyclohexanate for laboratory use?", "cypher": "match ((:ENTITY{name:'1-amino ring phosphate'}) - [:Relationship{name:'specifications and model'}]-> (h) return h.name"}, {"query": "Can you find me two books published by Scholastic Publishing?", "cypher": "match (:ENTITY{name:'Bachelor's degree'}) <- [:Relationship{name:'Bachelor's degree'}]- ((n) - [:Relationship{name:'Bachelor's degree'}->(q) return distinct q.name limit 2"}, {"query": "What are the characteristics of the company named 1+1 supermarket?", "cypher": "match (:ENTITY{name:'1+1 supermarket'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'company' return h.name limit 10"}, {"query": "Can you give a poetic introduction to the five-layer relationship of this poem in the frost?", "cypher": "match (n:ENTITY{name:'in the middle'}) - [*1..5]->(x) where x.name<>'poem' return distinct x.name limit 5"}, {"query": "Do you know the Canoe Shield K360A-i3BD1?", "cypher": "match (n:ENTITY{name:' the Ark of the Covenant K360A-i3BD1'}) --(x) return x.name"}, {"query": "Do you know which schools were in the 1920s in Tianjin's Baoding District?", "cypher": "match (:ENTITY{name:'1920'}) <- [:Relationship{name:'time of founding'}]-(m), (m) - [:Relationship{name:'area to which belongs'}]->(n) where n.name='Bawun District of Tianjin City' return m.name limit 2"}, {"query": "What is muscle protein?", "cypher": "Match (n:ENTITY{name:'muscle protein'}) - [:Tag{name:'tag'}]-> (h) return h.name"}, {"query": "What are the two main representations of the Yoga literature?", "cypher": "match ((:ENTITY{name:'Yue Literature [Master of Political Science, former director of the Department of Political Science at Tsinghua University]'}) - [:Relationship{name:'represents works'}]-> (n) return n.name limit 2"}, {"query": "The EINECS registration number for which chemical is 209-057-8?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Is there a way to search for the characteristic tag 103H548-0440?", "cypher": "match (:ENTITY{name:'103H548-0440'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "Do you know which versions of the software are 1.0.0 (new version coming soon?)", "cypher": "match (:ENTITY{name:'1.0.0(new version coming soon;\u00b7\u00b7) '}) <-[:Relationship{name:' version'}]- (h) return distinct h.name"}, {"query": "The project is a collaboration between the two companies, and the project is a collaboration between the two companies.", "cypher": "match (n:ENTITY{name:'7 degrees warming: creating a world of confusion'}) - [:Relationship*1..2]->(x) where x.name <>'32' return distinct x.name"}, {"query": "Can you tell me what kind of relationship is involved in summoning the dead at the two levels?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'calling the dead'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "Can you tell me 5 things about the 1.80-metre Mazurkiewicz in no more than 5 relationships?", "cypher": "match (n:ENTITY{name:'Mazurkiewicz'}) - [*1..5]->(x) where x.name <>'1.80 m' return distinct x.name limit 5"}, {"query": "What books were published on 4/1/2009? By which publisher?", "cypher": "match (:ENTITY{name:'2009/4/1'}) <- [:Relationship{name:' time of publication'}]-(h),(h) - [:Relationship{name:' publisher'}]->(q) return distinct h.name,q.name"}, {"query": "The theme of the event is Hello World, what is the name of the event?", "cypher": "Match (:ENTITY{name:'hello world'}) <- [:Relationship{name:'subject'}]- (n) return n.name"}, {"query": "The following is a list of the three levels of government relations in the 2007 Jiangmen Municipal Government Work Report:", "cypher": "match (n:ENTITY{name:'2007 Jiangmen City Government work report'}) - [*1..3]->(x) where x.name <>'2007 Jiangmen City Government work report' return distinct x.name"}, {"query": "Please list one person born in 1974 and one representative work owned by this person.", "cypher": "match (:ENTITY{name:'1974'}) <- [:Relationship{name:'date of birth'}]- ((q),(q) - [:Relationship{name:'representative work'}]->(n) return q.name,n.name skip 2 limit 1"}, {"query": "Is there any other relevant knowledge about anti-5-acrylamide besides writing C10H20O?", "cypher": "match (:ENTITY{name:' anti-5-acrylic'}) --(p) with p order by p.name where p.name <> 'C10H20O' return p.name"}, {"query": "I'm not sure if you're familiar with the Chicago Bulls.", "cypher": "match (:ENTITY{name:'Chicago Bulls'}) <--(n) return n.name The team was ranked #8 in the nation by the Associated Press."}, {"query": "Can you name three exhibitions that are on display at Dalian World Expo Square?", "cypher": "match (:ENTITY{name:'Dalyane World Expo Square'}) <- [:Relationship{name:'Holding exhibition hall'}]- (n) return n.name limit 3"}, {"query": "Can you tell me what other occupations this person who is in charge of all government work has?", "cypher": "match (:ENTITY{name:'preside over the overall work of the government\u3002'}) <- [:Describe{name:'describe'}]-(x),(x) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 3"}, {"query": "Do you know the specific parameters of the temperature probe on the 11036 thermometer?", "cypher": "match ((:ENTITY{name:'11036 central thermometer'}) - [:Relationship{name:' temperature probe'}]-> (m) return m.name"}, {"query": "What events are being held at the Johannesburg Football City Stadium?", "cypher": "match (:ENTITY{name:'Football City Stadium'}) <- [:Relationship{name:'Place of the match'}]- (p) return distinct p.name"}, {"query": "Can you help me find a songwriter, producer in the US?", "cypher": "match (p:ENTITY{name:'United States'}) <--(x) -->(q:ENTITY{name:'composer, producer'}) return x.name"}, {"query": "About Daejeon: He is the director of the gynecological department of the Kawasaki Medical College affiliated hospital and has three other professions besides physician.", "cypher": "match (:ENTITY{name:'Daiz\u00e9\u541b'}) <- [:Relationship{name:'Chinese name'}]-(h) - [:Relationship{name:'profession'}]->(q) where q.name <> 'Director of Obstetrics and Gynecology at the Hospital Affiliated to Kawahara Medical College' return distinct q.name limit 3"}, {"query": "What awards has YANG Hak Seon won?", "cypher": "match (q:ENTITY{name:'YANG Hak Seon'}) <- [:Relationship{name:'foreign language name'}]-(h),(h) - [:Relationship{name:'main award'}]->(p) return distinct p.name"}, {"query": "Can you name two books that could be worth 16?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "I would like to know what the device that is responsible for modulation, transmission and reception in the infrared remote control system is called?", "cypher": "match (:ENTITY{name:' modulation, sending and receiving'}) <- [:Relationship{name:' infrared remote control system'}]- (x) return x.name"}, {"query": "What happened on December 2, 2015?", "cypher": "match (:ENTITY{name:'December 2, 2015'}) <- [:Relationship{name:' time'}]- (m) return distinct m.name"}, {"query": "Do you know what other literature Zhang Xiahou wrote?", "cypher": "match (:ENTITY{name:'Zhang Shuhua'}) <- [:Relationship{name:'written'}]- (x) return distinct x.name"}, {"query": "The first five Chinese names for the extinguishing storm?", "cypher": "match (:ENTITY{name:'extinguishing storm'}) - [:Relationship{name:'Chinese name'}]-> (n) with n order by n.name return n.name limit 5"}, {"query": "Do you know what technology is responsible for the pre-charging?", "cypher": "match (:ENTITY{name:'pre-loaded'}) <- [:Relationship{name:'technical origin'}]- (x) return x.name"}, {"query": "Who were the parties to the 1848 European Revolutionary War and where did it take place?", "cypher": "match (:ENTITY{name:'Revolution of 1848 in Europe'}) - [:Relationship{name:'both sides of the war'}]->(n) return n.name as name union all match (:ENTITY{name:'Revolution of 1848 in Europe'}) - [:Relationship{name:'place of occurrence'}]->(m) return m.name as name"}, {"query": "The film is based on the novel of the same name by the Chinese writer, who also wrote the screenplay for the film.", "cypher": "match (n:ENTITY{name:' and Hu Midchan's Choi Hye Rain Three'}) - [*1..4]->(x) where x.name <> '' return distinct x.name limit 5"}, {"query": "What are the main awards for those who have 13 (first + second) PhDs?", "cypher": "match (:ENTITY{name:'13(first level + second level) individuals'}) <-[:Relationship{name:'ph.d. point'}]-(n) -[:Relationship{name:'main award'}]->(m) return distinct m.name"}, {"query": "The following is a list of the works by the Japanese artist and composer, who are known for their work in the genre of Kintetsu-Tsujin.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'seven times' return distinct x.name"}, {"query": "What is the price and number of pages of this book on the biology of the pineal gland?", "cypher": "match (:ENTITY{name:'Relationship'}) - (n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - (m) return m.name as name union all match (:ENTITY{name:'Relationship'}) - (r) return r.name as name"}, {"query": "The article was written by a young woman from the city of Yangzhou, China, who is a student of the University of Hong Kong.", "cypher": "match (n:ENTITY{name:' difficult to put down children's paper folding size'}) - [:Relationship*1..3]->(x) where x.name <> 'Yangjiang Publishing' return distinct x.name"}, {"query": "Can you explain 1010 to me?", "cypher": "match (:ENTITY{name:'1010'}) --(m) with m order by m.name return m.name"}, {"query": "Do you know what kind of work is represented by professionals like screenwriters/actors/producers/assistant directors/composers?", "cypher": "match (:ENTITY{name:'writer/actor/producer/assistant director/composer'}) <- [:Relationship{name:'profession'}]-(n) - [:Relationship{name:'representing work'}]->(x) return distinct x.name"}, {"query": "In which region are the striped ventriloquists mainly distributed?", "cypher": "match (:ENTITY{name:'Relationship{name:'distribution area'}]-> (m) return distinct m.name"}, {"query": "Help me find five really amazing creatures.", "cypher": "match (:ENTITY{name:'true'}) <-[:Relationship{name:'spect'}]-(m) return distinct m.name limit 5"}, {"query": "What exhibition is coming from May 25th, 2011 to May 28th, 2011?", "cypher": "match (:ENTITY{name:'2011/5/25 to 2011/5/28'}) <- [:Relationship{name:'exhibition time'}]- (m) return m.name"}, {"query": "Can you find out where the five CCP members graduated from?", "cypher": "match (:ENTITY{name:'CPC member'}) <- [*]-(m), (m) - [:Relationship{name:'Graduate school'}]->(n) return m.name, n.name limit 5"}, {"query": "I want to know the main accomplishments of John McCarthy Jr., do you have any?", "cypher": "match (:ENTITY{name:'John McCarthy Jr.'}) - [:Relationship{name:'major achievement'}]-> (q) return distinct q.name limit 5"}, {"query": "Do you know which of the accidents involved a common injured person?", "cypher": "match (:ENTITY{name:'Yunming'}) <- [:Relationship{name:'Commons'}]- (m) return m.name"}, {"query": "There's a problem in the workplace, what's the ratio of 2-deoxy-D-glucose, you know that?", "cypher": "match ((:ENTITY{name:'2-deoxy-D-glucose'}) - [:Relationship{name:'relative to rotational distance'}]-> (h) return h.name"}, {"query": "Find the book \"Professional teaching in pre-school education in secondary vocational schools: information within the two-tier relationship of music\" by Sheryl.", "cypher": "match (n:ENTITY{name:' Vocational school pre-school teaching professional textbook: music'}) - [:Relationship*1..2]->(x) where x.name<>'Sherlie' return distinct x.name"}, {"query": "What is the relationship between the two layers of the Nietzsche translation?", "cypher": "The following is a list of all the different ways Match path=(n) <- [:Relationship*2]-(p:ENTITY{name:'read Nietzsche'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What are the two other professions that are not good in literature besides master's and professor?", "cypher": "match (n:ENTITY{name:' in grammar'}) - [:Relationship{name:' profession'}]->(h) where h.name <> 'professor' and h.name <> 'master's graduate tutor' return distinct h.name limit 2"}, {"query": "What is the name of the disease in polycystic kidney disease?", "cypher": "match (:ENTITY{name:'Remove the dirty ones'}) <- [:Relationship{name:'Multiple hair groups'}]- (q) return q.name"}, {"query": "Please tell me what the name of the relationship involved in SHANKHAI TENNO Investment Management Ltd. is in the 3 layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Shanghai Teno Investment Management Ltd'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What are the fish that are mainly found in the shallow waters of the East China Sea and the South China Sea?", "cypher": "match (:ENTITY{name:'shallow waters of the East China Sea, South China Sea'}) <- [:Relationship{name:'distribution area'}]- ((h) return h.name"}, {"query": "The following is a list of information on the four-tier relationship, other than Lee Hong-won's work on the exotic animal.", "cypher": "match (n:ENTITY{name:'Lee Hongwen'}) - [*1..4]->(x) where x.name <>'Divine beast of the thief' return distinct x.name"}, {"query": "Who is the voice actor for Super Beast?", "cypher": "match (:ENTITY{name:'Super Beast Squad' is an original 3D anime series produced by Guangzhou Blue Arc Cultural Promotion Ltd. featuring the characters of the super beasts, the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the heroes of the hero"}, {"query": "What accident killed 74 people and injured 2?", "cypher": "match (:ENTITY{name:'74 dead, 2 wounded'}) <- [:Relationship{name:'casualties'}]- (n) return distinct n.name"}, {"query": "You know the other 7 pieces of information in the 3rd layer of this book, Digital Electronics Technology Basics Experiment, published by China Hydro-Hydro Electric Publishing.", "cypher": "match (:ENTITY{name:' Basic experiment in digital electronics'}) - [*1..3]-(p) where p.name <> 'China Hydroelectric Publishing' return distinct p.name limit 7"}, {"query": "Where was the poet born and what are his works?", "cypher": "match (:ENTITY{name:'Kenna'}) - [:Relationship{name:'birthplace'}]->(n) return n.name as name union all match (:ENTITY{name:'Kenna'}) - [:Relationship{name:'representative work'}]->(m) return m.name as name"}, {"query": "10 words that make you familiar with the 1039 bike map?", "cypher": "match (:ENTITY{name:'1039 bike map'}) --(n) with n order by n.name return n.name limit 10"}, {"query": "The company is based in Wanda Square in Beijing's Stone Mountain.", "cypher": "match (:ENTITY{name:'Wanda Square in the city of Beijing's Shijiazhuang Mountain'}) <- [:Relationship{name:'Hall of Residence'}]- (m) return m.name"}, {"query": "Do you know what a river showgirl does?", "cypher": "match (:ENTITY{name:' River River'}) <--(p) - [:Relationship{name:' profession'}]->(n) return distinct n.name limit 1"}, {"query": "Do you know all the relationships involved in the two levels of the Xinjiang Education Group?", "cypher": "The following pages link to The Unknown:"}, {"query": "Please describe the product description of the technology product Xiaomi Mechanical Keyboard in no more than two layers of relationship.", "cypher": "match (n:ENTITY{name:'Micro-mechanical keyboard'}) - [:Relationship*1..2]->(x) where x.name <> 'technology product' return distinct x.name"}, {"query": "I wonder what the classic fairy tale is about?", "cypher": "match (:ENTITY{name:'Classic Fairy'}) <- [:Relationship{name:'work type'}]- (n) return distinct n.name"}, {"query": "What are the characteristics of the label of the 1+1 bi-active therapy?", "cypher": "match (:ENTITY{name:'1+1 bi-active therapy'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name"}, {"query": "Are there any films with the same location as the police dog fighting, and what are the labels for each?", "cypher": "match (n:ENTITY{name:'police dog's fight'}) - [:Relationship{name:' location of shooting'}] ->(:ENTITY) <- [:Relationship{name:' location of shooting'}] - ((m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c"}, {"query": "Which tournament was held from June 8 to June 13, 2010?", "cypher": "match (:ENTITY{name:'June 8 to June 13, 2010'}) <- [:Relationship{name:'time of start'}]- (x) return x.name"}, {"query": "What are the main departments of Special Education school of GuLinn County?", "cypher": "match (p:ENTITY{name:'Special Education school of GuLinn County'}) <- [:Relationship{name:'foreign language name'}]-(h) - [:Relationship{name:'main faculty'}]->(q) return distinct q.name"}, {"query": "The revolutionary of which era was the great man? What were his major achievements?", "cypher": "match (:ENTITY{name:'Relationship{name:'Relationship'}) - (n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - (n) return m.name as name"}, {"query": "Can you tell me about the 5 recipes for Korean steamed yellow bean sprouts, which are mainly made with mince, beans, etc.?", "cypher": "match (n:ENTITY{name:'Korean steamed yellow bean sprouted minnow'}) - [*]->(x) where x.name <>' yellow bean sprouted minnow' return distinct x.name limit 5"}, {"query": "Which hotels have check-out times before 12:00? Can you tell me nine?", "cypher": "match (:ENTITY{name:'before 12:00'}) <- [:Relationship{name:'time of departure'}]- (q) return q.name limit 9"}, {"query": "I'm not sure if you're familiar with the story of the two women who were involved in the murder of the young girl, but I'm not sure if you're familiar with the story of the woman who was involved in the murder of the young girl.", "cypher": "match (n:ENTITY{name:' and Zhang's face is soaked in heat'}) - [*1..4]->(x) where x.name <>'s face is soaked in heat' return distinct x.name limit 5"}, {"query": "Can you tell me what the name of the relationship that Jody Lynch covered in Level 2 is?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Jody Lynch'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "I'm going to find two provincial media outlets and introduce him to me.", "cypher": "match (:ENTITY{name:'provincial media'}) <-[:Relationship*]-(m),(m) -[:Describe{name:'description'}]->(n) return m.name,n.name limit 2"}, {"query": "A star who retired from the sport has won the main prize of the championship?", "cypher": "match (:ENTITY{name:' has been retired'}) <- [:Relationship{name:' belongs to sports team'}]-(m),(m) - [:Relationship{name:' main award'}]->(n) return distinct n.name limit 2"}, {"query": "And what do you know of the way?", "cypher": "match (:ENTITY{name:' clouded'}) --(n) with n order by n.name return n.name"}, {"query": "I wonder which international conference all the five countries of the FASU, China, UK and USA are participating in?", "cypher": "match (:ENTITY{name:'US, UK, French, Chinese'}) <- [:Relationship{name:'number of exhibitors'}]- (n) return n.name"}, {"query": "The Trinity refers to which of the three religions?", "cypher": "match (:ENTITY{name:'triple'}) - [:Relationship{name:' is to '}]->(n) return n.name as name union all match (:ENTITY{name:'triple'}) - [:Relationship{name:' subject'}]->(m) return m.name as name"}, {"query": "The story of the four layers of the relationship between the two is a mystery, but what are the details of the four layers of the relationship?", "cypher": "match (n:ENTITY{name:'secretly attributed to the Yellow Rose'}) - [*1..4]->(x) where x.name<>'food' return distinct x.name limit 5"}, {"query": "The following is a description of the two-tier relationship between the organization and Anhui Mei Wudang Technology Co., Ltd.", "cypher": "match (n:ENTITY{name:'Anhui Mei-Won Technology Co. Ltd'}) - [*1..2]->(x) where x.name <> 'organization' return distinct x.name"}, {"query": "Who has a national model of work?", "cypher": "match (:ENTITY{name:'national labour model'}) <- [:Relationship{name:'main achievements'}]- ((m) return distinct m.name"}, {"query": "Is the film technology real?", "cypher": "match (n:ENTITY{name:'Molding membrane technology'}) where n is not null return 1"}, {"query": "Except for the People's Daily, what else do you know about the Zhejiang Public Service Examination Pre-Spring Prediction Test?", "cypher": "match (:ENTITY{name:'Zhejiang Civil Servants Exam Preliminary Sprint Test Tests Test of Administrative Ability'}) - [*1..2]-(p) where p.name <> 'People's Daily Press' return p.name limit 6"}, {"query": "Do you know what chemical is used in Palonosetron intermediate?", "cypher": "The name of the product is \"Palonosetron\" (Palonosetron)"}, {"query": "The following is a brief introduction to Robert Soros, one step at a time.", "cypher": "match (:ENTITY{name:'Robert Sorso'}) --(m) return distinct m.name limit 1 The name of the game is the name of the game."}, {"query": "Tell me, what other famous alumni of this public school are there?", "cypher": "match (:ENTITY{name:'public school'}) <- [:Relationship{name:'category'}]-(m) - [:Relationship{name:'known alumni'}]->(h) return h.name order by h.name limit 10"}, {"query": "How should lotus tea be stored?", "cypher": "match (:ENTITY{name:'\u83b2\u82af\u8336'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'storage method'}]->(n) return distinct n.name"}, {"query": "Help me find two weapons.", "cypher": "match (:ENTITY{name:' weapon equipment'}) <- [:Tag{name:' tag'}]-(m) return distinct m.name limit 2"}, {"query": "I'm looking for a game that can be played on the Internet, but I'm not sure if I can find it.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'intelligent class' return distinct x.name"}, {"query": "Tell me how many companies are operating in the port?", "cypher": "match (p:ENTITY{location:' port'}) return count ((p)"}, {"query": "I'm looking for a book by Satoshi Miyamoto that was published by a top publisher.", "cypher": "match (p:ENTITY{name:'editorial'}) <--(x) -->(q:ENTITY{name:'\u4f50\u85e4\u53cb\u54c9'}) return x.name"}, {"query": "Please tell me what other names Nanjing has. Give me an example.", "cypher": "match (h:ENTITY{name:'Nanjing'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Relationship{name:'alias'}]->(q) return q.name order by q.name limit 1"}, {"query": "What is the name of the colorful dragon that is distributed in Madagascar's tropical rainforest?", "cypher": "match (:ENTITY{name:'Madagascar rainforest area'}) <- [:Relationship{name:'distribution area'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='previously excluded' return distinct m.name"}, {"query": "The following 5 tips for helping with this software?", "cypher": "match (n:ENTITY{name:'microidentical'}) - [*]->(x) where x.name<>'microidentical' return distinct x.name limit 5"}, {"query": "Can you list academic studies related to inorganic chemistry?", "cypher": "match (:ENTITY{name:' inorganic chemistry'}) <- [:Relationship{name:' subject area'}]- (q) return distinct q.name"}, {"query": "Have you ever seen the functional food ingredient network?", "cypher": "match (n:ENTITY{name:'functional food ingredient network'}) where n is not null return 1"}, {"query": "What are the characteristics of the 143-8 label in the economic sector?", "cypher": "match (:ENTITY{name:'143-8'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'economy' return n.name"}, {"query": "The book introduces the two-tiered relationship between the occult and the Zen viewer.", "cypher": "match (n:ENTITY{name:' send a person to the abode of the unseen and the visited Zen master'}) - [*1..2]->(x) where x.name <>'' return distinct x.name"}, {"query": "06Ni9DR is what, open up?", "cypher": "match (:ENTITY{name:'06Ni9DR'}) --(p) with p order by p.name return p.name"}, {"query": "I'm going to be playing a game of RPGs.", "cypher": "match (:ENTITY{name:'rpg adventure class'}) <--(n) return n.name"}, {"query": "I would like to know the information about the company within the two-tier relationship of the organization, Hangzhou One Auto Spare Parts Limited.", "cypher": "match (n:ENTITY{name:'Hangzhou One Automobile Spare Parts Co., Ltd'}) - [*1..2]->(x) where x.name <> 'organizing entity' return distinct x.name"}, {"query": "What is the relationship between acupuncture and the three layers of acupuncture?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'needle therapy'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Do you know what browser update is the latest version 2.0.2.112?", "cypher": "The following is a list of the most commonly used keywords in the search engine."}, {"query": "Can you tell me everything you know about the Faculty of Medicine of the University of Guam?", "cypher": "match (:ENTITY{name:'Relationship*1..3]-(p) return distinct p.name limit 10"}]