[{"query": "Can you help me find the information about the 2010 BMW 5 Series 523 Li standard car?", "cypher": "match (:ENTITY{name:'2010 BMW 5 Series 523 Li standard'}) --(x) with x order by x.name where x.name <> 'car' return x.name"}, {"query": "Do you know about the island of Chiang Mai?", "cypher": "match (:ENTITY{name:'Kilometer'}) --(m) return distinct m.name"}, {"query": "The first is the representation of a Leo.", "cypher": "match (:ENTITY{name:'Leo'}) <- [:Relationship{name:'Star'}]-(h) - [:Relationship{name:'represents work'}]->(q) return q.name order by q.name limit 1"}, {"query": "What books are you familiar with that were published on 2001/6/1?", "cypher": "match (:ENTITY{name:'2001/6/1'}) <- [:Relationship{name:' time of publication'}]-(h),(h) - [:Relationship{name:' book name'}]->(q) return distinct h.name,q.name"}, {"query": "Do you know if lymphocytes are white blood cells and what else they have to do with information? Help me find 10 information in 3 layers.", "cypher": "match (:ENTITY{name:' lymphocytes'}) - [*1..3]->(p) where p.name <> ' a type of white blood cell ' return p.name limit 10"}, {"query": "The story is based on the story of the first seven stories in the second story of the novel.", "cypher": "match (:ENTITY{name:'Sky dream'}) -[:Relationship*1..2]-(p) where p.name <> 'novel' return p.name limit 7"}, {"query": "Do you have any information about the three levels of relationships that this person is involved in?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Rela"}, {"query": "You know Wang Zi6? I need 10 more information on the 2nd layer besides the water dragon character.", "cypher": "match (:ENTITY{name:'Wang Ti's six'}) - [*1..2]->(p) where p.name <> 'swimming pool' return p.name limit 10"}, {"query": "Can you tell me about the three species of tiger that you know of and where they are distributed?", "cypher": "match (:ENTITY{name:'Gekkonidae'}) <- [*]-(m), (m) - [:Relationship{name:' distribution area'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Do you know what concepts are being proposed in the Five Year Plan and what they mean?", "cypher": "match (:ENTITY{name:'five-year plan'}) <- [:Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return m.name, n.name"}, {"query": "What are the different labels of the literary works of the same period? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'wind into the spring}) - [:Relationship{name:'creation date'}]->(:ENTITY) <-[:Relationship{name:'creation date'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Tell me, what are the two main ingredients of the porridge besides the meatball and the porridge?", "cypher": "match (n:ENTITY{name:'Bubble bean pie'}) - [:Relationship{name:'main ingredient'}]->(h) with h order by h.name where h.name <> 'bullhead' and h.name <> 'Bubble bean' return h.name limit 2"}, {"query": "Check out the 5 foreign language introductions to Alshbli Alaa in the 5 tier relationship.", "cypher": "match (n:ENTITY{name:'Alshbli Alaa'}) - [*1..5]->(x) where x.name<>'Alshbli Alaa' return distinct x.name limit 5"}, {"query": "How do you find a video made in Japan?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'production area'}]-(n) return distinct n.name limit 1"}, {"query": "Tell me which Arabic numerals are the Roman numerals XXXIX?", "cypher": "match (:ENTITY{name:'XXXIX'}) <- [:Relationship{name:'Roman numerals'}]- (q) return distinct q.name"}, {"query": "Can you reveal all the labels for the 1500m race?", "cypher": "match (q:ENTITY{name:'1500 metres'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "Help me find 10 plants that are part of the seed-plant-gate-twin-leaf-plant schedule.", "cypher": "match (:ENTITY{name:'seed plant gate'}) <- [:Relationship{name:'gate'}]-(m), (m) - [:Relationship{name:'gram'}]->(n) where n.name='twin leaf plant gate' return m.name limit 10"}, {"query": "Can you name three works by Chinese artists?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(m),(m) - [:Relationship{name:'representative work'}]->(q) return distinct q.name limit 3"}, {"query": "Do you know the first three words of the name of the production company and the full name of the production company of the TV series \"The Hunger Games\"?", "cypher": "MATCH (n:ENTITY{name:'War of the Roses [TV series broadcast on MBC in 2004]'}) - [:Relationship{name:' Publisher'}]->(m) RETURN m.name,substring ((m.name,0,3))"}, {"query": "Can you name 11 non-profit social organizations?", "cypher": "match (:ENTITY{name:' non-profit social organization'}) <- [:Relationship{name:' nature'}]- (p) return p.name limit 11"}, {"query": "The experiment requires a hydrogen, can you provide a reference point?", "cypher": "match ((:ENTITY{name:''}) - [:Relationship{name:''}]-> (p) return p.name"}, {"query": "What are the books of Deng Xiaoping and what are they classified as?", "cypher": "match (:ENTITY{name:'\u5fe0\u6587 \u7f16'}) <- [:Relationship{name:' author'}]-(h),(h) - [:Tag{name:' tag'}]->(q) return distinct h.name,q.name"}, {"query": "What is the caliber of the M57 7.62mm pistol?", "cypher": "match (:ENTITY{name:'M57 type 7.62mm pistol'}) - [:Relationship{name:'gap diameter'}]->(n) return n.name as name union all match (:ENTITY{name:'M57 type 7.62mm pistol'}) - [:Relationship{name:'Airgun quality'}]->(m) return m.name as name"}, {"query": "The following is a list of all the schools in Yunyang County.", "cypher": "match (:ENTITY{name:' Yunyang County Dayang Primary School'}) --(m) return distinct m.name"}, {"query": "Please tell me 5 details about the football player Da Yao Liang.", "cypher": "match (n:ENTITY{name:'Dawg'}) - [*]->(x) where x.name <> 'footballer' return distinct x.name limit 5"}, {"query": "Who are the people who have a relationship with university teachers that is labeled as level 3?", "cypher": "match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'college teacher'}) RETURN distinct n.name limit 3"}, {"query": "Do you know what chemical has CAS number 312693-23-5?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you give me five of the five levels of the relationship between the two?", "cypher": "match (n:ENTITY{name:' Friday's music'}) - [*1..6]->(x) where x.name<>'South-North Korea' return distinct x.name limit 5"}, {"query": "Jason Terry is on which basketball team?", "cypher": "match (:ENTITY{name:'Jason Terry'}) - [:Relationship{name:'Relationship team'}]->(m) return distinct m.name"}, {"query": "How many schools have no schooling?", "cypher": "match (:ENTITY{name:'school'}) <--(m), (m) - [:Relationship{name:'school'}]->(n) where n is null return count ((distinct m.name)"}, {"query": "Interactive reading: the relationship between the two layers of the Venetian businessman?", "cypher": "match (n:ENTITY{name:' language new course interactive reading: Venetian merchant'}) - [:Relationship*1..2]->(x) where x.name <>'Shakespeare' return distinct x.name"}, {"query": "Find out what chemical has the CAS number 651-54-7?", "cypher": "match (p:ENTITY{name:'651-54-7'}) <- [:Relationship{name:'CAS number'}]- (m) return m.name"}, {"query": "If the main character lives with his mother, who are the other three actors besides Ji Yong-soo, Ji-hoon, and Ye-ye?", "cypher": "match (n:ENTITY{name:'if living with mother'}) - [:Relationship{name:'starring'}]->(h) where h.name <> 'Kyu Young-ho' and h.name <> 'Kyu and also' return distinct h.name limit 3"}, {"query": "The cave belongs to that city?", "cypher": "Match (:ENTITY{name:'white lotus hole'}) - [:Relationship{name:'place'}]->(n) return n.name"}, {"query": "What are the product features and main functions of the smart pure water water meter?", "cypher": "match (:ENTITY{name:'smart pure water meter'}) - [:Relationship{name:'product characteristics'}]->(n) return n.name as name union all match (:ENTITY{name:'smart pure water meter'}) - [:Relationship{name:'main function'}]->(m) return m.name as name"}, {"query": "Please tell me if you know of any high school in Deqing County, Zhejiang Province. Can you list the top 5?", "cypher": "match (:ENTITY{name:'Deqing County, Zhejiang Province, China's secondary school'}) --(m) return m.name order by m.name limit 5"}, {"query": "Do you know any professions in Shaanxi? Please tell me 5 of them.", "cypher": "match (:ENTITY{name:'\u7ecd\u6e05'}) <- [:Relationship{name:' Chinese name'}]-(p),(p) - [:Relationship{name:' profession'}]->(x) return x.name order by x.name limit 5"}, {"query": "The Chongqing chemical plant explosion on 11/21 exposed many questions: Do you know where the incident took place?", "cypher": "match ((:ENTITY{name:'11\u00b721 Chongqing chemical plant explosion'}) - [:Relationship{name:'place of occurrence'}]-> (p) return p.name"}, {"query": "What is the name of the province in which the county is located?", "cypher": "match (:ENTITY{name:'containing county'}) - [:Relationship{name:'belonging area'}]->(n) return n.name as name union all match (:ENTITY{name:'containing county'}) - [:Relationship{name:'famous attractions'}]->(m) return m.name as name"}, {"query": "What is the ingredient of growth hormone release inhibitor?", "cypher": "match (x:ENTITY{name:'growth hormone release inhibitor'}) <- [:Relationship{name:'meaning'}]- (n) return n.name"}, {"query": "Let's see which brokerage is the famous singer Alex da Kid?", "cypher": "Match ((:ENTITY{name:'Alex da Kid'}) - [:Relationship{name:'brokerage company'}]-> (p) return p.name"}, {"query": "Please give me three main departments that are interactive media schools.", "cypher": "match (:ENTITY{name:'interactive media'}) <- [:Relationship{name:'main faculty'}]- (h) return distinct h.name limit 3"}, {"query": "What is the name of the song sung by Lee Sung-seong, Chen E-jin, and Zhou Guo-yi?", "cypher": "match (:ENTITY{name:'Lee Zongsheng'}) <- [:Relationship{name:'Relationship'}]- ((m), (m) - [:Relationship{name:'Composition'}]->(n) where n.name='Chen Zhenjie, Zhou Guoqiu' return distinct m.name"}, {"query": "What is the name of the white person born in Lijiang County, Yunnan?", "cypher": "match (p:ENTITY{name:' Yunnan Lijiang County'}) <--(x) -->(q:ENTITY{name:' White people'}) return x.name"}, {"query": "Can you find out about the five provincial universities of higher education?", "cypher": "match (:ENTITY{name:'province-based higher education institution'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'known alumni'}]->(n) return distinct m.name,n.name limit 5"}, {"query": "Can you list any of the special stamps with the letter \"T\" in the title?", "cypher": "match (:ENTITY{name:' T initials of special stamps'}) <- [:Relationship{name:' belongs to category'}]- (m) return distinct m.name"}, {"query": "Can you tell me about the three professions that are available to you?", "cypher": "match (:ENTITY{name:'pay\u5e86\u660e'}) <--(q),(q) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 3"}, {"query": "Help me find a place to play in June.", "cypher": "match (:ENTITY{name:'5 October\u3002 weather suitable, cool winds\u202c'}) <- [:Relationship{name:'suitable for play season'}]-(n) with n order by n.name limit 1? return n.name"}, {"query": "What programs and institutions have been hosted by Hong Kong Television Broadcasting Limited?", "cypher": "match (:ENTITY{name:'Hong Kong Television Broadcasting Company Limited'}) <- [:Relationship{name:'host unit'}]- (h) return distinct h.name"}, {"query": "Can you tell me what kind of profession is there for a Mon artist?", "cypher": "match (:ENTITY{name:'Mon Arts'}) <--(q) - [:Relationship{name:'Profession'}]->(h) return h.name order by h.name limit 10"}, {"query": "What are the single-edition publications? Name 10?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Can you get me three books for $200?", "cypher": "The following is a list of the most commonly used keywords in the search results."}, {"query": "Do you know what the main achievements of the writer who wrote the book for the Chinese language, Liu He, are?", "cypher": "match (:ENTITY{name:'Changming Spring'}) <- [Relationship{name:'representative work'}]- ((n) - [Relationship{name:'main achievements'}]-> ((x) return distinct x.name limit 10"}, {"query": "How many people are estimated to have died in the 2014 Norfolk helicopter crash?", "cypher": "match ((p:ENTITY{name:'2014 helicopter crash in Norfolkshire'}) - [:Relationship{name:'number of casualties'}]-> (q) return q.name"}, {"query": "What can you make with pig's back?", "cypher": "match (:ENTITY{name:' pig's back, eggs, mustard, spirit, salt, flour'}) <- [:Relationship{name:' main ingredient'}]-(m), (m) - [:Relationship{name:' classification'}]->(n) where n.name='Tianjin dish' return distinct m.name"}, {"query": "What warship is the 052C?", "cypher": "match (:ENTITY{name:'052C'}) <- [:Relationship{name:'model'}]- (p) return distinct p.name"}, {"query": "I'm going to be playing the game with my friends and I'm going to be playing with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends and I'm going to play with my friends\".", "cypher": "match (n:ENTITY{name:'color different'}) - [*1..4]->(x) where x.name <>'game' return distinct x.name"}, {"query": "Can you help me find two books by a beautiful author?", "cypher": "match (:ENTITY{name:'Chang Li'}) <- [:Relationship{name:'author'}]-(x),(x) - [:Relationship{name:'book name'}]->(q) return distinct q.name limit 2"}, {"query": "Can you tell me about one label of the village of Kochiko, apart from the archaeological and geographical ones?", "cypher": "match (n:ENTITY{name:'Kochino village'}) - [:Tag{name:'tag'}]->(h) with h order by h.name where h.name <> 'archaeological artefacts' and h.name <> 'geography' return h.name limit 1"}, {"query": "Can you recommend 13 novels that fall into the heterosexual category?", "cypher": "match (:ENTITY{name:'Relationship{name:' novel type'}) - (x) return x.name limit 13"}, {"query": "The ridiculous profession is?", "cypher": "match (:ENTITY{name:'dangerously funny'}) <--(q) - [:Relationship{name:'profession'}]->(p) return distinct p.name"}, {"query": "I want to know about the personal information of 1.79m Han Yun Yanming in the two-tier relationship?", "cypher": "match (n:ENTITY{name:'Han Hyun Yanming'}) - [*1..2]->(x) where x.name <>'1.79 m' return distinct x.name"}, {"query": "I need you to tell me about the five types of relationships involved in the second level of Nedal Lake, okay?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Dale Lake'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 5 The name of the game is a combination of the names of the characters and the name of the game."}, {"query": "Can you recommend five novels that are available in the Cloud?", "cypher": "match (q:ENTITY{name:'cloud city'}) <- [:Relationship{name:'contact platform'}]- (n) return n.name limit 5"}, {"query": "And what will make you know what the main ingredients of the night-light stone are?", "cypher": "match (:ENTITY{name:'nightlightstone'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'main ingredient'}]->(n) return distinct n.name"}, {"query": "Do you know the name of the novel written by Liu Xiaobo?", "cypher": "match (:ENTITY{name:'\u5c0f\u4f9d'}) <- [:Relationship{name:'creator'}]- (p) return distinct p.name"}, {"query": "Can you tell us about Xu Zhizhen's ethnicity and profession?", "cypher": "match (:ENTITY{name:'\u8bb8\u5fd7\u575a'}) - [:Relationship{name:'\u6c11\u65cf'}]->(n) return n.name as name union all match (:ENTITY{name:'\u8bb8\u5fd7\u575a'}) - [:Relationship{name:'\u804c\u4e1a'}]->(m) return m.name as name"}, {"query": "What do you know about the game Supergod? I only know that it is a Tencent game, please list 10 information in 2 layers", "cypher": "match (:ENTITY{name:'All the people are supergods'}) - [*1..2]->(p) where p.name <> 'Tencent game development studio' return p.name limit 10"}, {"query": "Can you tell me the names of the four prescription drugs?", "cypher": "match (:ENTITY{name:'prescription drug'}) <- [:Relationship{name:'is the drug prescribed'}]- (m) return m.name limit 4"}, {"query": "The American director, who has filmed three films in addition to Road to Heaven, also gave a list of his films.", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(p),(p) - [:Relationship{name:'representative work'}]->(x) where x.name <> 'way to heaven' return distinct x.name limit 3"}, {"query": "Please list 10 professions of this person born in Sichuan, China.", "cypher": "match (:ENTITY{name:' Sichuan Weiyuan'}) <- [:Relationship{name:' place of birth'}]-(x) - [:Relationship{name:' profession'}]->(n) return n.name order by n.name limit 10"}, {"query": "Tell me what are the three labels that the next four years will have to say 100 words in addition to cultural activities?", "cypher": "match (:ENTITY{name:'fourth level must back 100 sentences'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'cultural activities' return p.name limit 3"}, {"query": "What do you know about the social event 1040 Solar Engineering?", "cypher": "match (:ENTITY{name:'1040 solar engineering'}) --(h) with h order by h.name where h.name <> 'social event' return h.name"}, {"query": "Can you tell me about the three-tiered relationship that Chen Yao has with the book of life's wisdom?", "cypher": "match (n:ENTITY{name:'Enjoy the wisdom of a lifetime'}) - [*1..3]->(x) where x.name <>'Chen Rock' return distinct x.name"}, {"query": "Which three of the primary schools affiliated to the Shanghai Foreign Language Vocational College have received the most awards besides the District Civilization Unit and the Shanghai City Safe Civilization Campus?", "cypher": "match (n:ENTITY{name:'Shanghai Business School of Foreign Languages' affiliated primary school'}) - [:Relationship{name:'main award'}]->(h) where h.name <> 'district civilization unit' and h.name <> 'Shanghai City Security Civilization Campus' return distinct h.name limit 3"}, {"query": "Do you know what types of relationships are included in the 3rd level of Nedobar Middle School?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Rela"}, {"query": "What are the main achievements of people born in 1857? Can you tell me two categories?", "cypher": "match (:ENTITY{name:'1857'}) <- [:Relationship{name:'date of birth'}]- ((m) - [:Relationship{name:'main achievements'}]->(n) return distinct n.name limit 2"}, {"query": "What are the latest structural analysis and design methods?", "cypher": "match (n:ENTITY{name:' the latest structural analysis and design method'}) --(x) return distinct x.name"}, {"query": "Can you tell me the name of a novel that is still being published?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)."}, {"query": "Can I have a word about formaldehyde?", "cypher": "match (:ENTITY{name:'metallic toys'}) --(x) with x order by x.name return x.name limit 1"}, {"query": "The archery is divided into what categories and when did it start?", "cypher": "match (:ENTITY{name:'Arrow[ancient weapon]'}) - [:Relationship{name:'Classification'}]->(n) return n.name as name union all match (:ENTITY{name:'Arrow[ancient weapon]'}) - [:Relationship{name:'Time of beginning'}]->(m) return m.name as name"}, {"query": "The following are 10 of the achievements of the teacher who has been involved in the research and teaching of the \"Humor Serious Teacher\" in the school.", "cypher": "match (:ENTITY{name:'humor, seriousness'}) <- [:Relationship{name:'classroom style'}]-(p),(p) - [:Relationship{name:'main achievement'}]->(h) where h.name <> 'participating in the research' return distinct h.name limit 10"}, {"query": "What is the shortest path of relationship between the dry plants and the tropical plants in the two layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'dry growing plants'}) -[:Relationship*..2]-(b:ENTITY{name:'tropical plants'})) return count ((p)"}, {"query": "What about the 1325 UV flatbed printer?", "cypher": "match (:ENTITY{name:'1325uv tablet printer'}) --(x) with x order by x.name return x.name limit 1"}, {"query": "The test books published by the Mechanical Industries Publishing House helped me find the 10 most common.", "cypher": "match (:ENTITY{name:' publisher'}) <- [:Relationship{name:' publisher'}]- (mn) - [:Tag{name:' label'}]->(n:ENTITY{name:' exam book'}) return mn.name limit 10"}, {"query": "What chemical is camphor?", "cypher": "match (:ENTITY{name:'camphor'}) <- [:Relationship{name:'English name'}]- (x) return x.name"}, {"query": "I wonder what other names the Mongols have, say ten?", "cypher": "match (:ENTITY{name:'Mann'}) <- [:Relationship{name:'ethnicity'}]-(m),(m) - [:Relationship{name:'othername'}]->(h) return distinct h.name limit 10"}, {"query": "Do you know which ships were built by Shanghai Jiangnan Shipyard?", "cypher": "match (:ENTITY{name:' Shanghai Jiangnan Shipyard'}) <- [:Relationship{name:' Manufacturing Plant'}]- (q) return distinct q.name"}, {"query": "Apart from the private university, what else do you know about the modern school of economic management at Jiangxi University of Economics and Business?", "cypher": "match (:ENTITY{name:'Class of Modern Economics and Management of Jiangxi University of Finance'}) - [*1..3]->(p) where p.name <> 'Private University' return p.name limit 20"}, {"query": "Tell me how many companies were founded in 1992?", "cypher": "match (p:ENTITY{time:'1992'}) return count ((p)"}, {"query": "What is Muhtar's most representative work?", "cypher": "match (:ENTITY{name:'Muhtar'}) <- [:Relationship{name:'foreign language name'}]-(h),(h) - [:Relationship{name:'representative work'}]->(q) return distinct q.name limit 1"}, {"query": "The answer is that the polycystic group has a three-layer relationship to osteochondrosis of the elderly.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <> 'old man' return distinct x.name"}, {"query": "Can you tell me about the terror incident that happened at the Golden Gate Bridge in Beijing?", "cypher": "match (:ENTITY{name:'Beijing Tiananmen Square'}) <- [:Relationship{name:'place of occurrence'}]- (x) return x.name"}, {"query": "Find the five elements in the four-layer relationship of Avicii's Divine Sorrow?", "cypher": "match (n:ENTITY{name:'Divine Sorrow'}) - [*1..4]->(x) where x.name<>'Avicii' return distinct x.name limit 5"}, {"query": "I need five messages from football player Jiang Sak-rin.", "cypher": "match (n:ENTITY{name:'\u6c5f\u5742\u4efb'}) - [*]->(x) where x.name <> 'footballer' return distinct x.name limit 5"}, {"query": "I want to meet this person, you know?", "cypher": "match (:ENTITY{name:'songsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsongsong"}, {"query": "I'm not sure if I should be the only one who gets the news about the iWALKDBL800i.", "cypher": "match (n:ENTITY{name:'iWALKDBL800i'}) --(x) return x.name The name of the match is given by the name of the match."}, {"query": "What types of relationships are involved in nurturing eighth graders in the third level?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Pleasing the eighth grade'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "What is the name of the vice-dean, professor, and master's student supervisor at the School of Financial Management at Shanghai University of Foreign Trade and Economics?", "cypher": "match (q:ENTITY{name:'Shanghai University of Foreign Trade and Economy Vice-Dean, Professor, Master's student tutor\u3002'}) <- [:Describe{name:'description'}]-(x),(x) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 1"}, {"query": "Do you know the nationality of Jane Goodall?", "cypher": "match (:ENTITY{name:'Jen Goodall'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'nationality'}]->(q) return distinct q.name limit 3"}, {"query": "The 59 classic pieces of wisdom that have been completed are what kind of works?", "cypher": "match (:ENTITY{name:'59 classic life wisdom'}) --(n) with n order by n.name where n.name <> 'completed' return n.name"}, {"query": "The carrot green salad is being re-uploaded on which website?", "cypher": "Match (:ENTITY{name:'carrot blue'}) - [:Relationship{name:'linked site'}]->(n) return n.name"}, {"query": "Can you name 20 of them?", "cypher": "match (:ENTITY{name:'2007'}) <- [:Relationship{name:'year'}]- (n) return n.name limit 25"}, {"query": "Tell me about the publication you know called 100 Yuan Crazy for China?", "cypher": "match (:ENTITY{name:'100\u5143\u72c2\u8d70\u4e2d\u56fd'}) --(p) with p order by p.name where p.name <> 'publication' return p.name"}, {"query": "Who has the soul of jazz?", "cypher": "match (:ENTITY{name:'the soul of jazz music'}) <- [:Relationship{name:'major achievement'}]- ((m) return distinct m.name"}, {"query": "The 11/11 Urumqi Lithium Amine Bombing reported in the newspapers, do you know where it happened?", "cypher": "match ((:ENTITY{name:'11\u00b711 Urumqi ammonia explosion'}) - [:Relationship{name:'location'}]-> (q) return q.name"}, {"query": "What do you think of the evil Emperor?", "cypher": "match (n:ENTITY{name:'Unbelievable brother'}) --(x) return x.name"}, {"query": "The conference was attended by about 1,000 people from 60 countries.", "cypher": "match (:ENTITY{name:'About 1000 people from 60 countries attended the conference'}) <- [:Relationship{name:'conference size'}]- (q) return distinct q.name"}, {"query": "What are the acronyms of the universities founded in 1982? Can you tell me three?", "cypher": "match (:ENTITY{name:'1982'}) <- [:Relationship{name:'time of creation'}]- ((p),(p) - [:Relationship{name:'abbreviated'}]->(x) return distinct x.name limit 3"}, {"query": "Help me find three national level 3 protected plants.", "cypher": "match (:ENTITY{name:'plant'}) <- [:Tag{name:'tag'}]-(m), (m) - [:Relationship{name:'protection level'}]->(n) where n.name='3' return distinct m.name limit 3"}, {"query": "Is there a village committee of 20?", "cypher": "match (:ENTITY{name:'20'}) <- [:Relationship{name:'village group'}]->(n) return distinct n.name"}, {"query": "What is the shortest path between the light cheeks and the three layers of the iris?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortestcheek'}) - [*..3]-(b:ENTITY{name:'shortestcheek'})) return count ((p)"}, {"query": "I would like to ask, what is the third level of the label for the relationship with Princess Min?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'herding'}) return distinct n.name"}, {"query": "Can you tell us about the kind of relationships that are involved in the deep underground lab on the fourth floor?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:'ultra deep underground lab'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "List of devices with throughput of 100 Mbps excluding 100 megawatts firewall", "cypher": "match (:ENTITY{name:'100Mbps'}) <- [:Relationship{name:'network throughput'}]-(h),(h) - [:Relationship{name:'device type'}]->(m) where m.name <> '100Mbps firewall' return distinct m.name limit 5"}, {"query": "Can you help me find out where the five historical sites are?", "cypher": "match (:ENTITY{name:'landmark'}) <--(m), (m) - [:Relationship{name:'landmark'}]->(n) return m.name,n.name limit 5"}, {"query": "Can you find me two dancers born in Arlington and introduce them?", "cypher": "match (:ENTITY{name:'dancer'}) <-[:Relationship*]-(m),(m) -[:Describe{name:'description'}]->(n) return m.name,n.name limit 2"}, {"query": "Please list 14 pages in the 191-page literature guide.", "cypher": "match (h:ENTITY{name:'191 pages'}) <- [:Relationship{name:'page number'}]- (x) return x.name limit 19"}, {"query": "I'm not sure what the label says about the 10 100 round stores.", "cypher": "match (:ENTITY{name:'100 round shop'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 10"}, {"query": "The incident in which 13 people were killed and 21 injured?", "cypher": "match (:ENTITY{name:'13 killed, 21 wounded'}) <- [:Relationship{name:'wounded'}]- (m) return distinct m.name"}]