[{"query": "Can you find me two books published by the Chinese Statistical Publishing House?", "cypher": "The following pages link to List of Chinese newspapers by country:"}, {"query": "Can you list 5 personal information about Vinha V\u00edtor from Portugal?", "cypher": "match (n:ENTITY{name:'Vinha V\u00edtor'}) - [*]->(x) where x.name<>'Portugal' return distinct x.name limit 5"}, {"query": "Help me find five public high schools in Wuhan", "cypher": "match (:ENTITY{name:'Wuhan, Hubei, China'}) <- [:Relationship{name:'the region'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='public high school' return distinct m.name limit 5"}, {"query": "Can you tell me who is the second-tier label for Bridget Boucherlier?", "cypher": "Match (n) <- [:Tag*2{name:'tag'}]- ((p:ENTITY{name:'Bridget Boucherlier'}) return distinct n.name"}, {"query": "The problem is that Lapeyre Benjamin, born in Castell, has all the information in his three-tier relationship.", "cypher": "match (n:ENTITY{name:'Lapeyre Benjamin'}) - [*1..3]->(x) where x.name <> 'Castle' return distinct x.name"}, {"query": "Can you tell me the geographic location of the company in Cape Verde?", "cypher": "match (p:ENTITY{name:'Crowdfunding'}) return p.location"}, {"query": "He has a triple identity of academic, host and actor, do you know his main achievements?", "cypher": "match (:ENTITY{name:'scholar, presenter, actor'}) <-[:Relationship{name:'profession'}]-(h),(h) -[:Relationship{name:'main achievement'}]->(m) return distinct m.name"}, {"query": "What are the public universities in Hunan?", "cypher": "match (:ENTITY{name:'Hunan Long Sand'}) <- [:Relationship{name:' area'}]-(m), (m) - [:Relationship{name:' category'}]->(n) where n.name='public high school' return m.name"}, {"query": "The school was founded in 1229 and has four main faculties.", "cypher": "match (:ENTITY{name:'1229 year'}) <- [:Relationship{name:'time of founding'}]- ((n) - [:Relationship{name:'main faculty'}]->(p) return distinct p.name"}, {"query": "I wonder if anyone has a name like Dwarf?", "cypher": "match (:ENTITY{name:' foreign name of the dwarf's mother}) <--(n) return n.name"}, {"query": "I heard from others that Philippe Soutto is a footballer who weighs 77 kg, please tell me 7 more things about this man.", "cypher": "match (n:ENTITY{name:'Philipe Soutto'}) -->(h) with h order by h.name where h.name <> '77 kg' and h.name <> 'football' return h.name limit 7"}, {"query": "What are the most representative works of people born in December 1937?", "cypher": "match (:ENTITY{name:'December 1937'}) <- [:Relationship{name:'date of birth'}]- ((h) - [:Relationship{name:'representative work'}]->(q) return distinct h.name"}, {"query": "What happened in Austria?", "cypher": "match (:ENTITY{name:'Austria'}) <- [:Relationship{name:'where it happened'}]- (n) return n.name"}, {"query": "What are the 8 books in the open booklet? Can you tell me who wrote them?", "cypher": "match (:ENTITY{name:'8 open'}) <- [:Relationship{name:'disguised'}]-(h),(h) - [:Relationship{name:'author'}]->(q) return distinct h.name,q.name"}, {"query": "What are the 64 books in the open booklet? Can you tell me who wrote them?", "cypher": "match (:ENTITY{name:'64 open'}) <- [:Relationship{name:'disguised'}]-(h),(h) - [:Relationship{name:'author'}]->(q) return distinct h.name,q.name"}, {"query": "The full name of the organization, Yucatec Mining Hospital, in Chinese, is?", "cypher": "match (:ENTITY{name:'\u7389\u6eaa\u77ff\u4e1a\u533b\u9662'}) <- [:Relationship{name:'Chinese name'}]- ((n) return max(n.name)"}, {"query": "The Chinese have a lot of work to do, but they don't have the skills to do it.", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(p) - [:Relationship{name:'profession'}]->(h) where h.name <> 'adjunct professor' return distinct h.name limit 10"}, {"query": "The name of the town is also called Punjab, tell me two?", "cypher": "match (n:ENTITY{name:'punishment not town'}) - [:Relationship{name:'alias'}]-> (h) return h.name limit 2"}, {"query": "Can you tell me what else you have in mind besides the teacher and Chinese nationality?", "cypher": "match (n:ENTITY{name:'\u66f9\u5b88\u548c'}) -->(h) with h order by h.name where h.name <> 'teacher' and h.name <> 'Chinese' return h.name limit 3"}, {"query": "What else do you know about Xiang Linhui besides the author, Lu Xun?", "cypher": "match (:ENTITY{name:'Shyamrin Lee'}) - [*1..2]-(p) where p.name <> 'Rushun Lee' return distinct p.name limit 10"}, {"query": "What are the main achievements of students who graduated from Hangzhou Teachers' University?", "cypher": "match (:ENTITY{name:'Hangzhou Teachers' University'}) <- [:Relationship{name:' Graduate School'}]-(p) - [:Relationship{name:' Major achievements'}]->(h) return distinct h.name limit 4"}, {"query": "What is the GNU General Public License?", "cypher": "match (:ENTITY{name:'GNU General Public License'}) --(x) return distinct x.name"}, {"query": "Can I ask what are the labels of Charles Aranguis?", "cypher": "match (:ENTITY{name:'Charles Aranguis'}) - [:Tag{name:'tag'}]-> (n) return n.name order by n.name"}, {"query": "Do you know what the main achievements of this person with the surname Meisan are?", "cypher": "match (:ENTITY{name:'Mei Yue'}) <- [:Relationship{name:' alias'}]-(h),(h) - [:Relationship{name:' major achievements'}]->(q) return q.name order by q.name limit 10"}, {"query": "What are the symptoms of mechanical bowel obstruction? Is it contagious?", "cypher": "match (:ENTITY{name:' mechanical bowel obstruction'}) - [:Relationship{name:' common symptoms'}]->(n) return n.name as name union all match (:ENTITY{name:' mechanical bowel obstruction'}) - [:Relationship{name:' infectious'}]->(m) return m.name as name"}, {"query": "Can you name another name for the three goats?", "cypher": "match (:ENTITY{name:'monkey'}) --(h) return distinct h.name limit 3"}, {"query": "Help me find the synonyms and antonyms for self-portals.", "cypher": "match (:ENTITY{name:'self-portal'}) - [:Relationship{name:'near term'}]->(n) return n.name as name union all match (:ENTITY{name:'self-portal'}) - [:Relationship{name:'self-portal'}]->(m) return m.name as name"}, {"query": "What is the relationship between the two levels of the French army?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'French Army'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "I learned that the love school is a bit interactive and uses simplified Chinese, can you give me 10 more facts about it?", "cypher": "match (n:ENTITY{name:'Amy Primary School'}) -->(h) with h order by h.name where h.name <> 'a little interactive' and h.name <> 'simplified Chinese' return h.name limit 10"}, {"query": "Please help me find the other 6 pieces of information in I Am a Cat 2 .", "cypher": "match (:ENTITY{name:' I am a cat'}) - [:Relationship*1..2]-(p) where p.name <> 'novel' return p.name limit 6"}, {"query": "I'm going to be a little bit more specific about the three layers of relationships between Wang Zhou and the artwork.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'Wangzhou' return distinct x.name"}, {"query": "I need a personal profile of sports personality Steep Kenny in a five-tier relationship?", "cypher": "match (n:ENTITY{name:'Step Kenny'}) - [*1..5]->(x) where x.name <> 'sportsman' return distinct x.name limit 5"}, {"query": "Do you know what the 1927 Gangwon-gu earthquake is called?", "cypher": "match (:ENTITY{name:'Gangzhou tsunami'}) <- [:Relationship{name:'1927'}]- (x) return distinct x.name"}, {"query": "What kind of game is the game? What is the size of the game? What is the language of the game?", "cypher": "Match (:ENTITY{name:'Relationship's unlocked 2 ratings full open version'}) - [:Relationship's unlocked 2 ratings full open version'}->(n) return n.name as name union all match (:ENTITY{name:'Relationship's unlocked 2 ratings full open version'}) - [:Relationship's unlocked 2 ratings full open version'}-[:Relationship's unlocked 2 ratings full open version'}->(m) return m.name as name union all match (:ENTITY{name:'Relationship's unlocked 2 ratings full open version'}) - [name:Relationship's unlocked 2 ratings full open version'}->(r) return r.name as name"}, {"query": "Can you tell me about the three main achievements of this Chinese person?", "cypher": "match (:ENTITY{name:'Hank'}) <- [:Relationship{name:'ethnicity'}]-(q),(q) - [:Relationship{name:'main achievements'}]->(h) return h.name order by h.name limit 3"}, {"query": "Help me find the five words next to the syllable.", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'the head of the department'}]-(m) return distinct m.name limit 5"}, {"query": "What do you know about the American film Goodbye, Father-in-Law 3? Help me find the other 4 pieces of information in the 2nd layer.", "cypher": "match (:ENTITY{name:'Bye bye father-in-law 3'}) - [:Relationship*1..2]-(p) where p.name <> 'United States' return p.name limit 4"}, {"query": "What else does director Liu Xiaobo have to do with his work other than work?", "cypher": "match (:ENTITY{name:'Relationship{name:'director'}]-(m) where m.name<>' when it comes to running [1985 film directed by Liu Xiaobo]' return distinct m.name"}, {"query": "Greg Eagles' career, do you know anything about it?", "cypher": "match (:ENTITY{name:'Greg Eagles'}) - [:Relationship{name:'profession'}]-> (m) return m.name order by m.name limit 3"}, {"query": "I need to be classified as a urine pregnancy test in the 2nd level of the relationship?", "cypher": "match (n:ENTITY{name:' pregnancy test'}) - [:Relationship*1..2]->(x) where x.name <> 'urinate' return distinct x.name"}, {"query": "Can you recommend 5 2D games?", "cypher": "match (:ENTITY{name:'2D'}) <- [:Relationship{name:'game screen'}]- (x) return distinct x.name limit 5"}, {"query": "What do you know about the movie \"The Witcher 3\"? Please tell me 10 things.", "cypher": "match (:ENTITY{name:'switch3 ((2006)'}) --(h) return h.name limit 10"}, {"query": "Do you know what the movie is about the mercenaries who cheat?", "cypher": "match (:ENTITY{name:'squad'}) --(h) return distinct h.name"}, {"query": "I asked if any of the American writers represented you?", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(x) - [:Relationship{name:'representative work'}]->(p) return distinct p.name limit 5"}, {"query": "What chemical has a surface tension of 63.9?", "cypher": "match (:ENTITY{name:'63.9'}) <- [:Relationship{name:'surface tension'}]- (q) return distinct q.name"}, {"query": "What is the information about the two-layer relationship of Eposylon D with a molecular weight of 291.38?", "cypher": "match (n:ENTITY{name:'Epoxy D'}) - [:Relationship*1..2]->(x) where x.name<>'291.38' return distinct x.name"}, {"query": "What do you know about the 1+X Professional Skills Identification Exam Manual, Computer Installation and Maintenance?", "cypher": "match (:ENTITY{name:'1+X Professional Skills Identification Assessment Manual\u00b7 Computer Installation Deployment and Maintenance'}) --(h) with h order by h.name where h.name <> 'Exam books' return h.name limit 10"}, {"query": "What are the tourist attractions where you can play for free?", "cypher": "match (:ENTITY{name:' free'}) <- [:Relationship{name:' ticket price'}]-(p) - [:Relationship{name:' Chinese name'}]->(n) return distinct n.name limit 2"}, {"query": "Please help me find out 5 other information about the 2 layers of love in the movie Fair Love.", "cypher": "match (:ENTITY{name:'fair love'}) - [*1..2]-(p) where p.name <> 'love movie' return p.name limit 5"}, {"query": "The candy cane is a candy cane. Do you know whose work this is?", "cypher": "match (:ENTITY{name:'Candy cane'}) <- [:Relationship{name:'represents work'}]- (x) return x.name order by x.name"}, {"query": "What is the profession of people born on April 3rd?", "cypher": "match (:ENTITY{name:'04.03'}) <- [:Relationship{name:' date of birth'}]-(p),(p) - [:Relationship{name:' profession'}]->(x) return distinct x.name limit 1"}, {"query": "I'm not sure if you've heard of the musical \"1.825m\", but I'm not sure.", "cypher": "match (:ENTITY{name:'1.825m'}) --(p) with p order by p.name where p.name <> 'musical work' return p.name"}, {"query": "What competition is organized by the School of Business of Tsinghua University?", "cypher": "match (:ENTITY{name:'Chinghua University School of Management'}) <- [:Relationship{name:'host'}]- (q) return q.name"}, {"query": "Can you tell me about the 3 layer relationship of the XTC900 series, which uses multi-zone independent backlight control and HiView graphics engine technology?", "cypher": "match (n:ENTITY{name:'XTC900 series'}) - [*1..3]->(x) where x.name<>'XTC900 series is a LED backlight LCD display released by XTC, using multi-zone independent backlight control and HiView picture-screen engine technology."}, {"query": "What parks are open from 09:00-19:00 for free?", "cypher": "match (:ENTITY{name:'09:00-19:00'}) <- [:Relationship{name:'open hours'}]-(m), (m) - [:Relationship{name:'ticket prices'}]->(n) where n.name='the park is free to enter (some amusement activities in the park are subject to additional charges) ' return m.name"}, {"query": "Can you give me 10 types of e-commerce platforms?", "cypher": "match (:ENTITY{name:' e-commerce platform'}) <- [:Relationship{name:' site type'}]- (h) return h.name limit 10"}, {"query": "Can you recommend some types of web management software?", "cypher": "match (:ENTITY{name:' network management'}) <- [:Relationship{name:' type'}]- (p) return p.name"}, {"query": "Help me find a major international financial market in Germany.", "cypher": "match (:ENTITY{name:' Germany'}) <- [:Relationship{name:' location'}]-(m), (m) - [:Relationship{name:' position'}]->(n) where n.name='one of the major international financial markets' return distinct m.name limit 1"}, {"query": "The following is a list of all the information about Tony Popovic, born in Sydney, in no less than two levels of relationship.", "cypher": "match (n:ENTITY{name:'Popovic Tony'}) - [*1..2]->(x) where x.name<>'Sydney' return distinct x.name"}, {"query": "Do you know what exhibitions were held in 2012/05/16?", "cypher": "match (:ENTITY{name:'2012/05/16'}) <- [:Relationship{name:' time of holding'}]- (x) return distinct x.name"}, {"query": "What are the main departments of the school? Please tell me one. The school is described as one of the leading national comprehensive universities in Japan, located in the city of East Bridge, in the prefecture of Goma. Its predecessor originated from the Goma Teacher's School, founded in 1873, and was established as Goma University in 1949.", "cypher": "match (:ENTITY{name:'Kiroma University is one of Japan's leading national comprehensive universities located in the city of East Bridge, Kiroma Prefecture, with its predecessor originating from the Kiroma Teacher's School founded in 1873 and the establishment of Kiroma University in 1949.'}) <-[:Describe{name:'description'}]-(q),(q) -[:Relationship{name:'main faculty'}->(x) return x.name order by x.name limit 1"}, {"query": "What is the boiling point of DL-3-methyl rings, can you help me check?", "cypher": "match ((:ENTITY{name:'DL-3-methyl ring'}) - [:Relationship{name:'boiling point'}]-> (n) return n.name"}, {"query": "What books are published in 2001/1/1? By which publisher?", "cypher": "match (:ENTITY{name:'2001/1/1'}) <- [:Relationship{name:' time of publication'}]-(h),(h) - [:Relationship{name:' publisher'}]->(q) return distinct h.name,q.name"}, {"query": "Can you tell me about the five types of relationships that Hopkin is involved in in the 3 layers?", "cypher": "The following is a list of all the different ways Unwind is credited in the database:"}, {"query": "Tell me about this man, Ernest Van Pelt, who walks?", "cypher": "match (:ENTITY{name:'Ernest Van Pelt'}) --(p) return p.name order by p.name limit 3"}, {"query": "Looking for a link to the 10/17 Inner Mongolia Ho and Pante Riots escape?", "cypher": "match (:ENTITY{name:'10\u00b717 Inner Mongolia Huang and Qut Riot escape case'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 1"}, {"query": "Can you give me ten facts about 185 years?", "cypher": "match (:ENTITY{name:'185'}) --(n) with n order by n.name return n.name limit 10"}, {"query": "What are the works published by the Electronic Industry Publishers? When are they published? Can you name five?", "cypher": "match (:ENTITY{name:'electronic industry publisher'}) <- [:Relationship{name:'publisher'}]-(h),(h) - [:Relationship{name:'publication time'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "What new technology video products does Flexplay Korea have in store?", "cypher": "match (:ENTITY{name:'Flexplay Korea Company'}) <- [:Relationship{name:' proposer'}]- (h) return h.name"}, {"query": "Can you tell me about the festival of the connecting chickens?", "cypher": "match (:ENTITY{name:'supplement'}) --(h) with h order by h.name where h.name <> 'connected' return h.name"}, {"query": "How much do you know about the novel Nine of the Zeroes?", "cypher": "match (x:ENTITY{name:'0cancer'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'novel' return q.name"}, {"query": "In the meantime, let's talk about the five people in the five levels of relationship of sports personality Yuki Nakamura.", "cypher": "match (n:ENTITY{name:'Name of the game'}) - [*1..5]->(x) where x.name <> 'Sportsman' return distinct x.name limit 5"}, {"query": "Can you give us a brief overview of the two-tier relationship between the temperate climate of Jiangsu and the Pacific Ocean?", "cypher": "match (n:ENTITY{name:'Guangzhou'}) - [*1..3]->(x) where x.name <>'temperate climate' return distinct x.name"}, {"query": "I want to use all the information in Chinese language [language and literature]?", "cypher": "match (n:ENTITY{name:' language [language and literature]'}) - [:Relationship*]->(x) where x.name <>'Chinese language' return distinct x.name"}, {"query": "Help me find a French composer.", "cypher": "match (:ENTITY{name:'France'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='composer' return distinct m.name limit 2"}, {"query": "What was the name of the website that was launched in September 2010?", "cypher": "match (:ENTITY{name:'September 2010'}) <- [:Relationship{name:'time of operation'}]- (p) return p.name"}, {"query": "Give me three full-time secondary schools and describe them.", "cypher": "match (:ENTITY{name:' Full-time secondary school'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Can you name three types of animals that are used for meat?", "cypher": "Match (:ENTITY{name:'sweet'}) <- [:Relationship{name:'sweet'}]- (m) return m.name limit 3"}, {"query": "Japan is frequently hit by earthquakes, do you know the magnitude of the 10/21 Hokkaido earthquake in Japan?", "cypher": "match ((:ENTITY{name:'10\u00b721 Hokkaido earthquake in Japan'}) - [:Relationship{name:'class'}]-> (p) return p.name"}, {"query": "What are the benefits of white hair?", "cypher": "match (:ENTITY{name:'whiteheaded'}) - [:Relationship{name:'function'}]->(m) return distinct m.name"}, {"query": "The number of companies that have been established in the last 12 years?", "cypher": "match (p:ENTITY{time:'2012'}) return count ((p)"}, {"query": "Can you name five representative works of people who graduated from Hanyang University?", "cypher": "match (q:ENTITY{name:'Hanyang University'}) <- [:Relationship{name:'Graduate School'}]-(h),(h) - [:Relationship{name:'representing work'}]->(m) return m.name order by m.name limit 5"}, {"query": "100 Intellectual Museums looking for the first four tags sent to me?", "cypher": "match (:ENTITY{name:'100 intellectual museums'}) - [:Tag{name:'tags'}]-> (n) with n order by n.name return n.name limit 4"}, {"query": "Why drive to read the 25th Shichikoku?", "cypher": "match (m:ENTITY{name:'(15CD) driving read twenty-five history\u00b7\u4e09\u56fd\u5fd7'}) --(h) with h order by h.name return h.name"}, {"query": "I want three American representative works and the author's name?", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(n),(n) - [:Relationship{name:'representative work'}]->(p) return distinct n.name,p.name limit 3"}, {"query": "Do you have the label information for three fish looking for water, but I don't want both music and music?", "cypher": "match (n:ENTITY{name:'fish looking for water'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'musical work' and h.name <> 'musical' return distinct h.name limit 3"}, {"query": "The liver of which animal is used by the lamb?", "cypher": "Match (:ENTITY{name:' liver lamb'}) - [:Relationship{name:' main ingredient'}]-> (m) return distinct m.name"}, {"query": "Please tell me if the three locations and topography are related to the third layer of the label?", "cypher": "match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'topographic landscape'}) return distinct n.name limit 3"}, {"query": "Do you know which report says that the 2011 Tai Chi Wind construction yearbook and the 2011 Tai Chi tender?", "cypher": "match (:ENTITY{name:'2011 is the year of the typhoon and the typhoon build-up}) <- [:Relationship{name:'content'}]- (p) return p.name"}, {"query": "The two-tiered relationship between the five-tiered system and the state of deportation is described in the article.", "cypher": "match (n:ENTITY{name:' and state of return'}) - [:Relationship*1..2]->(x) where x.name <>'five-line' return distinct x.name"}, {"query": "Can you tell me who Constance Purdy is?", "cypher": "match (:ENTITY{name:'Constance Purdy'}) --(q) return q.name order by q.name"}, {"query": "The following is a detailed introduction of Hu Jinshou's 1000 MW thermal power plant training material: Steam turbine equipment system and operation.", "cypher": "match (:ENTITY{name:'1000MW thermal power plant training material: steam turbine equipment system and operation'}) --(x) with x order by x.name where x.name <> 'Hu Xian Su' return x.name"}, {"query": "As far as I know Moonlight Twilight Night is from the album Spring Again, it is a pure piano song, and I'm looking for 4 more information about this song.", "cypher": "match (n:ENTITY{name:'moonlight twilight night'}) -->(h) with h order by h.name where h.name <> 'spring again' and h.name <> 'pure piano' return h.name limit 4"}, {"query": "I'm not sure if I can understand the Queen's request for me to be silent in more than three words, can you?", "cypher": "match (:ENTITY{name:' Queen's mother let me suck'}) --(m) with m order by m.name return m.name limit 3"}, {"query": "Can you describe the types of relationships within the four layers of the Four Yellow Liaisons?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "Can you list the personal information within the two-tier relationship of the Japanese Kikuyu language?", "cypher": "match (n:ENTITY{name:'space'}) - [*1..2]->(x) where x.name<>'Japan' return distinct x.name"}, {"query": "Do you have any representation of the people who graduated from the Central Party School of Adult Education?", "cypher": "match (:ENTITY{name:'Adult Education College'}) <- [:Relationship{name:'Graduate School'}]-(n),(n) - [:Relationship{name:'represents work'}]->(x) return distinct x.name"}, {"query": "The film is based on the story of the famous Japanese artist, who was born in the city of Tokyo, Japan.", "cypher": "match (n:ENTITY{name:'send floaters to the east'}) - [:Relationship*1..2]->(x) where x.name <>'' return distinct x.name"}, {"query": "How many subspecies of the butterfly are there? Who named them?", "cypher": "match (:ENTITY{name:'Cinnamon Butterfly'}) - [:Relationship{name:'Subspecies'}]->(n) return n.name as name union all match (:ENTITY{name:'Cinnamon Butterfly'}) - [:Relationship{name:'Name and date'}]->(m) return m.name as name"}, {"query": "The story is about the ancient tombs, which are also crazy.", "cypher": "match (:ENTITY{name:'Ancient Tombs are also crazy'}) - [:Relationship*1..2]-(p) where p.name <> 'dialogue' return p.name limit 4"}, {"query": "Who is the founder of elementary number theory and who are its representatives?", "cypher": "match (:ENTITY{name:' primary number theory [mathematical branch]'}) - [:Relationship{name:' pioneer'}]->(n) return n.name as name union all match (:ENTITY{name:' primary number theory [mathematical branch]'}) - [:Relationship{name:' representative person'}]->(m) return m.name as name"}, {"query": "Tell me what the word for today is.", "cypher": "match (:ENTITY{name:'\u672c\u663c'}) <- [:Relationship{name:'\u672c\u540d'}]-(h),(h) - [:Relationship{name:'wordnumber'}]->(m) return distinct m.name limit 1"}, {"query": "Please list the names of the people who have served as the standing committee of the Xionghua District Committee.", "cypher": "match (:ENTITY{name:'Standing Committee of the Xinjiang District Commission'}) --(x) return distinct x.name"}, {"query": "I'm going to be the director of the secondary school chemistry experiment by Yu-Rung Zhang, and I'm going to study the three-tier relationship.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <> 'Ren Yu-rong Zhang Qu' return distinct x.name"}, {"query": "What types of relationships are involved in the two layers of marriage intelligence do you know about?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'marriage wisdom'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "Can you help me find a representation of a Yale graduate?", "cypher": "match (:ENTITY{name:'Yale University'}) <- [:Relationship{name:'Graduate School'}]-(n),(n) - [:Relationship{name:'Representative work'}]->(p) return distinct p.name limit 3"}, {"query": "What is the nickname of the 2nd generation wireless telephone technology?", "cypher": "match (:ENTITY{name:'2-Generation wireless telephone technology'}) <- [:Relationship{name:'other foreign names'}]- (h) return distinct h.name"}, {"query": "What is the shortest relationship between the two layers of cabinet and the glass bulb?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortest'}) -[:Relationship*..2]-(b:ENTITY{name:'shortest'})) return count ((p)"}, {"query": "What is the shortest route between the two levels of the village of Ryujo and the village of White River?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Ryuo Village [lower subdivision of the township of Jiaoyuan City, Jiaoyuan City, Henan Province]'}) - [*..2]-(b:ENTITY{name:'Whiteway River Village'})) return count ((p))"}, {"query": "What is the shortest relationship path between the two layers of the flat thoracic and the squamous?", "cypher": "The following table lists the most commonly used methods of measuring the length of a path."}, {"query": "What is the IPSAN?", "cypher": "match (:ENTITY{name:'IPSAN'}) - [:Relationship{name:'attributes'}]->(m) return distinct m.name"}, {"query": "The following are the main departments of the online education institutions in the category of online schools:", "cypher": "match (:ENTITY{name:'online school'}) <- [:Relationship{name:'category'}]-(m),(m) - [:Relationship{name:'main faculty'}]->(q) return distinct q.name"}, {"query": "I'm not sure if I'm going to be able to do it, but I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it.", "cypher": "match (n:ENTITY{name:'\u8d39\u76ca\u4e30'}) - [:Relationship{name:'representing work'}]->(h) with h order by h.name where h.name <> 'the mother grows up after the mother' and h.name <> 'the mother grows up after the mother' return h.name limit 1"}, {"query": "The following is a list of the topics covered in the book:", "cypher": "match (n:ENTITY{name:'\u8fd1\u541f'}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "Tell me about the three layers of relationships that are involved in wearing asphalt. Can you name three?", "cypher": "The following is a list of all the different ways Unwind is credited in the database:"}, {"query": "What is the name of the classic work of the Western master painter?", "cypher": "match (:ENTITY{name:'Western painting master's classic work'}) <- [:Relationship{name:'spoonful book name'}]- (h) return h.name"}, {"query": "Can you tell me the brands of the five small appliance companies?", "cypher": "match (:ENTITY{name:' small appliance'}) <- [:Relationship{name:' industry'}]- (x) return x.name limit 5"}, {"query": "The film is based on the novel of the same name by the writer, who is also a writer.", "cypher": "match (n:ENTITY{name:'\u83e9\u85a9\u86ee\u00b7\u897f\u98a8\u90fd\u662f\u884c\u4eba\u6068'}) - [:Relationship*1..2]->(x) where x.name <>'\u5357' return distinct x.name"}, {"query": "What books are published by foreign language publishers and who are their authors?", "cypher": "match (:ENTITY{name:' foreign language publisher'}) <- [:Relationship{name:' foreign language publisher'}]-(h),(h) - [:Relationship{name:' author'}]->(q) return distinct h.name,q.name"}, {"query": "I'm wondering where is the area in the southwest of Nanming District?", "cypher": "match (:ENTITY{name:'Southwest Narrow Area of Nanming District'}) <- [:Relationship{name:'Geographical location'}]- (n) return distinct n.name"}, {"query": "The Chinese writer, who is also a writer, has been a key figure in the development of the Chinese language.", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(m) - [:Relationship{name:'main achievements'}]->(h) return h.name order by h.name limit 5"}, {"query": "Which software's tagline is \"I'm here\"?", "cypher": "match (:ENTITY{name:'I'm here'}) <- [:Relationship{name:'software password'}]- (n) return distinct n.name"}, {"query": "Can you find five labels for 11 o'clock poker?", "cypher": "match (:ENTITY{name:'11-point poker card'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "Do you know how many European brands of ceramics there are?", "cypher": "match (:ENTITY{name:'Europe'}) <- [:Relationship{name:'from'}]- (x) return x.name limit 5"}, {"query": "Tell me about the five basic relationships in the four layers of a man named Abihazira Shimon.", "cypher": "match (n:ENTITY{name:'Abihazira Shimon'}) - [*1..4]->(x) where x.name <>' foreign name' return distinct x.name limit 5"}, {"query": "0412 is a scientific number and what is the label?", "cypher": "match (:ENTITY{name:'0412'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'science' return m.name"}, {"query": "Do you know what important events happened to this Go player in the game?", "cypher": "match (:ENTITY{name:'gochess'}) <- [:Relationship{name:'sporting project'}]-(n),(n) - [:Relationship{name:'important event'}]->(h) return h.name skip 1 limit 5"}, {"query": "Can you recommend the two novels that are being serialized?", "cypher": "match (h:ENTITY{name:'continued'}) <- [:Relationship{name:'novel progress'}]-(x),(x) - [:Relationship{name:'Chinese name'}]->(p) return distinct p.name limit 2"}, {"query": "Tell me about the stoning?", "cypher": "match (n:ENTITY{name:'drumming'}) --(x) return x.name"}]