[{"query": "The name of the person who died on September 28, 1898 is?", "cypher": "match (x:ENTITY{name:'28 September 1898'}) <- [:Relationship{name:'date of death'}]- ((q),(q) - [:Relationship{name:'alias'}]->(n) return distinct q.name,n.name"}, {"query": "Can you tell me about the company that is a limited liability company and its location?", "cypher": "match (:ENTITY{name:' limited company'}) <- [:Relationship{name:' type'}]- ((q) - [:Relationship{name:' location'}]->(m) return q.name, m.name skip 1 limit 1"}, {"query": "I would like to know which command was established by the Ministry of Defence?", "cypher": "match (:ENTITY{name:'Defense Ministry'}) <- [:Relationship{name:'establishing organization'}]- (m) return distinct m.name"}, {"query": "Can you recommend 10 novels that cross the space shuttle?", "cypher": "match (:ENTITY{name:' crossing shelf class'}) <- [:Relationship{name:' type'}]- (n) return n.name limit 10"}, {"query": "What are the names of the people who graduated from the same university as Liu Xiaobo and what are their labels?", "cypher": "match (n:ENTITY{name:'\u6653\u98ce'}) - [:Relationship{name:' graduate school'}] ->(:ENTITY) <- [:Relationship{name:' graduate school'}] - ((m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "What is Cinnabar?", "cypher": "match (:ENTITY{name:'Cinnabar'}) --(x) return distinct x.name"}, {"query": "Tell me about the three main ingredients of the food, which are the onion, cucumber and other cold-pressed foods.", "cypher": "match (:ENTITY{name:'slice coldface'}) --(m) with m order by m.name where m.name <> 'slice, cucumber' return distinct m.name limit 3"}, {"query": "The first article you gave me about Putin's tagline.", "cypher": "match (:ENTITY{name:'Pudi'}) - [:Tag{name:'tag'}]-> (h) return h.name order by h.name limit 1"}, {"query": "The story of the three layers of relationships that the poet Yuri Yuka created in his work.", "cypher": "match (n:ENTITY{name:'\u8fc7\u5de2\u9091'}) - [:Relationship*1..3]->(x) where x.name<>'\u8fc7\u5de2\u9091' is a poem by the poet Yue Yi."}, {"query": "I would like to know about five or more relationships with Australian citizen Horvat Steve.", "cypher": "match (n:ENTITY{name:'Horvat Steve'}) - [*1..4]->(x) where x.name<>'Australia' return distinct x.name limit 5"}, {"query": "Please tell me what songs are on AKB48's albums?", "cypher": "match (:ENTITY{name:'AKB48'}) <- [:Relationship{name:'album singer'}]- (x) return distinct x.name"}, {"query": "Do you know which of the five books used in literature are on paper?", "cypher": "match (x:ENTITY{name:'canvas paper'}) <- [:Relationship{name:'paper'}]- (p) return distinct p.name limit 5"}, {"query": "Do you know what chemical is CAS number 13115-43-0?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Search for the properties of state-owned Mahjong?", "cypher": "match (:ENTITY{name:'with state mahjong'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'attributes'}]->(m) return distinct m.name"}, {"query": "Do you know what Guo Wei does for a living?", "cypher": "match (:ENTITY{name:'\u5173\u80b2\u4f1f'}) <- [:Relationship{name:' Chinese name'}]-(m),(m) - [:Relationship{name:' profession'}]->(h) return distinct h.name limit 1"}, {"query": "Is there any problem listing 2 items other than the one-man operation of the Tianjin-based company that operates the X-ray instruments in the East Li district?", "cypher": "match (:ENTITY{name:'Stanley Spectrometer Operating Department of Tianjin City's East Li District'}) --(m) with m order by m.name where m.name <> 'individual operating' return distinct m.name limit 2"}, {"query": "Please identify 5 people who have directed in this profession.", "cypher": "match (:ENTITY{name:' director'}) <- [:Relationship{name:' profession'}]- (p) return distinct p.name limit 5"}, {"query": "The book is about 101 stories that reach the heart of a child.", "cypher": "match (:ENTITY{name:'101 stories that reach the heart of the child'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'books' return n.name limit 1"}, {"query": "The 178 graduation thesis web has a fancy label in your mind?", "cypher": "match (:ENTITY{name:'178 graduation thesis web'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Can you sort out the three label attributes of Project 211?", "cypher": "match (:ENTITY{name:'211 project'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 3"}, {"query": "The website is a product of the Internet, but does it have other label attributes?", "cypher": "match (:ENTITY{name:'136 lawyer's net'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'Internet product' return m.name"}, {"query": "In which regions are the red beans mainly distributed?", "cypher": "match (:ENTITY{name:'Relationship{name:'distribution area'}]-> (m) return distinct m.name"}, {"query": "I know that Toyota Mirai was launched on December 15, 2014 and has a range of almost 500 km, you can find me more information, find 6 more.", "cypher": "match (n:ENTITY{name:'Toyota Mirai'}) -->(h) with h order by h.name where h.name <> 'nearly 500 kilometers' and h.name <> 'December 15, 2014 ((Japan) ' return h.name limit 6"}, {"query": "Can you recommend two novels that are still in print?", "cypher": "The following pages link to List of Chinese novels by name:"}, {"query": "Who has the most representative work of Odysseus?", "cypher": "match (:ENTITY{name:'Relationship{name:'represents work'}]- (m) return m.name order by m.name limit 10"}, {"query": "Have you heard of .top?", "cypher": "match (:ENTITY{name: '.top'}) --(m) with m order by m.name return m.name"}, {"query": "What books have you translated?", "cypher": "match (:ENTITY{name:'super'}) <- [:Relationship{name:'translator'}]- (q) return distinct q.name"}, {"query": "Please help me find three companies, where are their addresses?", "cypher": "match (:ENTITY{name:' company'}) <- [*]-(m), (m) - [:Relationship{name:' address'}]->(n) return m.name, n.name limit 3"}, {"query": "I was curious to know if the 1st grade - primary school language reading the King's book?", "cypher": "match (:ENTITY{name:'1st grade - Primary language reading King'}) --(n) with n order by n.name where n.name <> ' publication' return n.name"}, {"query": "Do you know any specific information about the Meizu? Can you give me 10?", "cypher": "match (:ENTITY{name:'supplement'}) --(h) return distinct h.name limit 10"}, {"query": "What are the labels of the people who work with Wang Yan in the same profession? Please show them in order of number of labels.", "cypher": "match (n:ENTITY{name:'King's Daughter'}) - [:Relationship{name:'Career'}]->(:ENTITY) <- [:Relationship{name:'Career'}]- ((m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you tell me the name of the author of the deaf?", "cypher": "match (:ENTITY{name:'hollow ear'}) <- [:Relationship{name:'author'}]-(q),(q) - [:Relationship{name:'Chinese name'}]->(m) return distinct m.name limit 1"}, {"query": "Tell me, what is a full-size 4.3?", "cypher": "match (:ENTITY{name:'4.3'}) <- [:Relationship{name:'full weight'}]- (p) return distinct p.name"}, {"query": "Tell me about 1999 - the 10th Annual Congress of the Chinese Archaeological Society, a collection of five articles.", "cypher": "match (p:ENTITY{name:'1999- Tenth Annual Meeting of the Chinese Archaeological Society's Selected Papers'}) --(m) with m order by m.name return distinct m.name skip 1 limit 5"}, {"query": "Please tell me what happened in the United States (local time) on August 5, 2015?", "cypher": "match (:ENTITY{name:'(local time) August 5, 2015'}) <- [:Relationship{name:'occurred time'}]- (q) return distinct q.name"}, {"query": "Who is the leader of the Four Kingdoms?", "cypher": "match (:ENTITY{name:'the head of the four kingdoms'}) <- [:Relationship{name:'status'}]- ((m) return distinct m.name"}, {"query": "Do you know the song by your name?", "cypher": "match (:ENTITY{name:'with his name'}) --(h) return distinct h.name"}, {"query": "The following is a list of articles that have been written about the two layers of the relationship between the Moon and the Moon in the book of Kosan Shammei.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'Luo Linggu' return distinct x.name"}, {"query": "Please help me find 10 albums by Zhang Shijiazhuang", "cypher": "match (:ENTITY{name:'Zhang Shijie'}) <- [:Relationship{name:'album singer'}]-(m) return distinct m.name limit 10"}, {"query": "Do you know which major awards Polish films have won? Name three?", "cypher": "match (p:ENTITY{name:'Polish'}) <- [:Relationship{name:'for the White language'}]- ((q) - [:Relationship{name:'main prize'}]->(x) return distinct x.name limit 3"}, {"query": "I wonder what the name of the financial institution that focuses on serving small micro-enterprises and individual business owners is?", "cypher": "match (:ENTITY{name:' cater to small and micro businesses and individual business owners'}) <- [:Relationship{name:' focus'}]- (p) return p.name"}, {"query": "I wonder what day the incident happened with Swiss rocket scientist, Yves Rossi?", "cypher": "match (:ENTITY{name:'Swiss rocket rocket man Boev Rossi'}) <- [:Relationship{name:'event'}]- (n) return n.name order by n.name"}, {"query": "Is there another name for this thing with the natural label?", "cypher": "match (:ENTITY{name:'natural'}) <- [:Tag{name:'tag'}]-(p),(p) - [:Relationship{name:'alias'}]->(m) return m.name order by m.name limit 5"}, {"query": "What are the main achievements of Dong Silver Flower?", "cypher": "match (x:ENTITY{name:'\u8463\u94f6\u82b1'}) <- [:Relationship{name:'Chinese name'}]- ((m) - [:Relationship{name:'main achievement'}]->(n) return distinct n.name"}, {"query": "The book is a book about the life of a young man named Rudyard Kipling.", "cypher": "match (:ENTITY{name:'Rouchen Jen and Lee Joseph'}) <- [:Relationship{name:' book name'}]- ((n) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "123 Online Schools have subject tags and what tags?", "cypher": "match (:ENTITY{name:'123 online school'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'discipline' return n.name"}, {"query": "I'm not sure what the novel is about, but I'm not sure what the novel is about.", "cypher": "match (:ENTITY{name:'Jingjiang City'}) <- [:Relationship{name:'connected website'}]- (h) return h.name order by h.name limit 10"}, {"query": "The first five labels for the 2002 Hong Kong concert?", "cypher": "match (q:ENTITY{name:'2002 Hong Kong Concert (s) 1) '}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "The author of the novel, Demon Blue, is nicknamed?", "cypher": "match (:ENTITY{name:'\u5996\u5996\u84dd'}) <- [:Relationship{name:' author'}]-(m),(m) - [:Relationship{name:' Chinese name'}]->(h) return distinct h.name limit 1"}, {"query": "Is there a label for Chan's Chronicles other than fiction and books?", "cypher": "match (n:ENTITY{name:'Cheng's Chronicles'}) - [:Tag{name:'tags'}]->(h) with h order by h.name where h.name <> 'novel' and h.name <> 'book' return h.name limit 1"}, {"query": "Do you know what exhibition was on the day of the event?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "How many people are involved in the underground waterways secret room? What is the estimated time of arrival? What is the first time of arrival?", "cypher": "match (:ENTITY{name:'underground waterway secret room'}) - [:Relationship{name:'number of participants'}]->(n) return n.name as name union all match (:ENTITY{name:'underground waterway secret room'}) - [:Relationship{name:'estimated appearance'}->(m) return m.name as name union all match (:ENTITY{name:'underground waterway secret room'}) - [:Relationship{name:'time of first entry'}->(r) return r.name as name"}, {"query": "Do you know what holiday is 3/3/32023?", "cypher": "match (n:ENTITY{name:'March 3rd'}) <- [:Relationship{name:'Holiday time'}]- (mn) return mn.name"}, {"query": "What is the first Chinese name of Huaxia's son?", "cypher": "match (:ENTITY{name:'Huaxing's Son'}) - [:Relationship{name:'Chinese name'}]-> (q) with q order by q.name return q.name limit 1"}, {"query": "I was asked to list a volunteer service station at Northeastern Electricity University.", "cypher": "match (:ENTITY{name:'Northeast Electric University Volunteer Service Station'}) --(m) return distinct m.name limit 1 The name of the station is not known"}, {"query": "The following is a list of the most important things you can find in the world of Albu-Muttair Mokhalad A. Nasser:", "cypher": "match (n:ENTITY{name:'Albu-Muttair Mokhalad A. Nasser'}) - [*1..3]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "Can you list which are the 5th tier label affiliations of Barbarossa Football Club?", "cypher": "Match (n) <- [:Tag*5{name:'tag'}]- ((p:ENTITY{name:'Barbarossa Football Club'}) RETURN distinct n.name"}, {"query": "What do you know about the party of the son of Chen Zhen?", "cypher": "match (:ENTITY{name:'\u9648\u5176\u4e1a'}) <- [:Relationship{name:'father'}]- ((p) - [:Relationship{name:'party'}]->(n) return distinct n.name"}, {"query": "Can you give an example of the main achievements of Grigori Savanna?", "cypher": "match (:ENTITY{name:'Gigandari Sailor'}) - [:Relationship{name:'main work'}]-> (q) return q.name order by q.name limit 1"}, {"query": "Tell me which games are the same size as Escape from the Haunted Mansion? What are the labels for each game? Please sort by the number of labels in each game from small to large.", "cypher": "match (n:ENTITY{name:'escape from weird old house'}) - [:Relationship{name:'game size'}]->(:ENTITY) <-[:Relationship{name:'game size'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "What else is there to say about the name of the liquid white wine?", "cypher": "match (:ENTITY{name:' Liquid French white wine is liquid fermented French white wine\u3002'}) <- [:Describe{name:'describe'}]- ((q) - [:Relationship{name:'alias'}]->(h) return distinct h.name"}, {"query": "The song is from the album of which you might not expect it to be, how long the song is and who is the singer?", "cypher": "match (:ENTITY{name:'unanticipated'}) - [:Relationship{name:'belonging to album'}]->(n) return n.name as name union all match (:ENTITY{name:'unanticipated'}) - [:Relationship{name:'song duration'}->(m) return m.name as name union all match (:ENTITY{name:'unanticipated'}) - [:Relationship{name:'song originalsongs'}]->r) return r.name as name"}, {"query": "Can you find me two Zhejiang dishes and introduce them?", "cypher": "match (:ENTITY{name:'Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "How many video apps are running on Android 1.5? Can you name two?", "cypher": "The following is a list of the most commonly used operating systems for Android:"}, {"query": "The Chinese Navy is a global leader in the field of maritime science and technology, with a strong presence in the world's largest maritime industries.", "cypher": "match (n:ENTITY{name:'Yuxinghai Qijian: China's modern naval history novel'}) - [:Relationship*]->(x) where x.name <> 'Sociology of the humanities' return distinct x.name limit 5"}, {"query": "The name of the drug is called what it is, but don't forget about the Sushi Mountain and the Chicken Soup for the Soul.", "cypher": "match (n:ENTITY{name:'Tendamine'}) - [:Relationship{name:'alias'}]->(h) where h.name <> 'Sushibiyama' and h.name <> 'Tenderness' return distinct h.name limit 1"}, {"query": "Do you have any tags for the three Suzhou-based Twitter companies, other than their website and company?", "cypher": "match (n:ENTITY{name:'Suzhou Shuangye Corporation'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'website' and h.name <> 'company' return distinct h.name limit 3"}, {"query": "The 10-step tabletop game, is it paid, do you know?", "cypher": "match ((:ENTITY{name:'10-step chart'}) - [:Relationship{name:'has been paid'}]-> (x) return x.name"}, {"query": "Can you list some of the representative works of ceramic artists?", "cypher": "match (q:ENTITY{name:' ceramic artist'}) <- [:Relationship{name:' profession'}]- ((m) - [:Relationship{name:' representing work'}]->(x) return distinct x.name"}, {"query": "What does the word \"lonely\" mean? Where did it come from?", "cypher": "The name of the game is \"Relationship\" (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relationship) - (Relations) - (Relations) - (Relations) -) - (Relations) - (Relations) - (Relations) - (Relations) - (Relations) -) - (Relations) - (Relations) - (Relations) - (Relations) - (Relations) -) - (Relations) - (Relations) - (Relations) - (Relations) - (Relations) -) - (Relations) - (Relations)"}, {"query": "I'm not sure what other companies have labels for the same place as Beijing Dragon Wrestling and Security Prevention Technology Co., Ltd.", "cypher": "match (n:ENTITY{name:'Beijing Dragon Wrestling and Security Prevention Technology Co. Ltd'}) - [:Relationship{name:'HQ location'}]->(:ENTITY) <- [:Relationship{name:'HQ location'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c)"}, {"query": "I want to execute the date of the 1980 Ministry of Higher Education Budget Package and other 5 information in the second level of the methodology.", "cypher": "match (:ENTITY{name:'the method of testing the budget package of the higher education institution'}) -[*1..2]-(p) where p.name <> '1980/12/1' return p.name limit 5"}, {"query": "What is the job of the next president?", "cypher": "match (:ENTITY{name:'\u4efb, Sanshi Shouyang, graduated from the Graduate School of Journalism of the Faculty of Social Sciences\u3002'}) <- [:Describe{name:'description'}]-(h) - [:Relationship{name:'profession'}]->(q) return distinct q.name"}, {"query": "Can you tell me the labels of the three little short-legged leather ones besides the two labels of the pets and the movie?", "cypher": "match (n:ENTITY{name:' small short leged leather'}) - [:Tag{name:' tag'}]->(h) where h.name <> 'pet' and h.name <> 'film' return distinct h.name limit 3"}, {"query": "I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies and I'm going to go to the movies.", "cypher": "match (:ENTITY{name:'actor of the comedy film'}) <-[:Relationship*]-(m),(m) -[:Describe{name:'description'}]->(n) return m.name,n.name limit 1"}, {"query": "There is a technology that has developed non-uniform correction technology and so on, what is this technology?", "cypher": "match (:ENTITY{name:'Non-uniform correction technology etc'}) <- [:Relationship{name:'new technology'}]- (x) return distinct x.name"}, {"query": "Can you tell me which species of Chinese hardwood tree the teacher introduced in class belongs to?", "cypher": "match ((:ENTITY{name:'China Hardware'}) - [:Relationship{name:'\u5c5e'}]-> (p) return p.name"}, {"query": "Can you tell me which books are published on 2001/1/1?", "cypher": "match (:ENTITY{name:'2001/1/1'}) <- [:Relationship{name:' time of publication'}]- ((x),(x) - [:Relationship{name:' book name'}]->(q) return distinct q.name"}, {"query": "I'm going to have to get two of these, what are the main ingredients?", "cypher": "match (:ENTITY{name:'Hong Kong dishes'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:' main ingredient'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "The first thing I want to do is write down all the information about the other name of the aromatic aluminate.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name <>'flavor essence' return distinct x.name"}, {"query": "Where are the people who speak Nauruan?", "cypher": "match (:ENTITY{name:'Nauru official language, Central official language, Central official language'}) <- [:Relationship{name:'dialect'}]-(h) return h.name skip 1"}, {"query": "Please help me find the other 7 stories in the movie Undersea Monster 3 .", "cypher": "match (:ENTITY{name:' underwater freak'}) - [:Relationship*1..3]-(p) where p.name <> 'film' return p.name limit 7"}, {"query": "The eight-tier system was used in what era and what did it include?", "cypher": "match (:ENTITY{name:'eight-part match'}) - [:Relationship{name:'time'}]->(n) return n.name as name union all match (:ENTITY{name:'eight-part match'}) - [:Relationship{name:'composition'}]->(m) return m.name as name"}, {"query": "Can you tell me everything you know about the Great Cretaceous?", "cypher": "match (:ENTITY{name:'Big rock lipid'}) - [*1..3]-(p) return p.name limit 10"}, {"query": "I need details on the relationship between the five 2015 RBMs and the 5th level?", "cypher": "match (n:ENTITY{name:'Ripper armored personnel carrier'}) - [*1..5]->(x) where x.name <>'2015' return distinct x.name limit 5"}, {"query": "Do you know when she published this book, The Eight O'Clock Software BD0226 World Cinema Classic vs. White?", "cypher": "match (:ENTITY{name:' eight-point software BD0226 world cinema classic versus white'}) <- [:Relationship{name:' book name'}]- ((x),(x) - [:Relationship{name:' time of publication'}]->(q) return distinct q.name"}, {"query": "What is the name of the web model that was derived from Alex Rampell?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What kind of jobs would people with uncommon personality traits do?", "cypher": "match (:ENTITY{name:' not so ordinary'}) <- [:Relationship{name:' characteristic'}]- ((h) - [:Relationship{name:' profession'}]->(q) return distinct q.name"}, {"query": "The five species and their distribution areas have been identified.", "cypher": "match (:ENTITY{name:'animal'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'distributed area'}]->(n) return m.name, n.name limit 5"}, {"query": "In 10 words, tell me the list of events for the 1987 Spring Festival?", "cypher": "match (:ENTITY{name:'1987 Spring Festival party schedule'}) --(m) with m order by m.name return m.name limit 10"}, {"query": "Do you know which 5 are related to the economy with the 4th tier label?", "cypher": "The following is a list of the most commonly used tags in the world:"}, {"query": "Please tell me which of the following people were the main achievers of the liberation war?", "cypher": "match (:ENTITY{name:'participated in the Liberation War'}) <- [:Relationship{name:'main achievements'}]- (x) return x.name skip 4"}, {"query": "Can you find 10 beauty books? Who are the authors?", "cypher": "match (:ENTITY{name:'beauty books'}) <--(m), (m) - [:Relationship{name:'author'}]->(n) return m.name, n.name limit 10"}, {"query": "Do you know which schools were founded in 1984 in Jilin, China? Can you find two for me?", "cypher": "match (:ENTITY{name:'1984'}) <- [:Relationship{name:'time of founding'}]-(m), (m) - [:Relationship{name:'area to which belongs'}]->(n) where n.name='Chinese shilling' return m.name limit 2"}, {"query": "The following is a list of people who have the same occupation as Holger Baum. What are their labels?", "cypher": "match (n:ENTITY{name:'Holger-Behm'}) - [:Relationship{name:'profession'}]->(:ENTITY) <- [:Relationship{name:'profession'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c)"}, {"query": "Help me find five sights in Shenyang.", "cypher": "match (:ENTITY{name:'Shenyang City, Liaoning Province'}) <- [:Relationship{name:'City'}]-(m), (m) - [:Tag{name:'Tag'}]->(n) where n.name='Landscape attractions' return distinct m.name limit 5"}, {"query": "When did Russia come to power?", "cypher": "Match (:ENTITY{name:'Russian Empire'}) - [:Relationship{name:'Russian Empire'}]->(m) return distinct m.name"}, {"query": "Do you know which ones have three jump tags to do with the publications?", "cypher": "The following is a list of all the different ways Match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'publications'}) RETURN distinct n.name limit 3"}, {"query": "What is the name of the beauty program based on the hyperbolic dynamic aesthetic curve?", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship{name:'base'}]- (x) return x.name"}, {"query": "The first is the scientific term 1-hydroxybenzyl?", "cypher": "match (:ENTITY{name:'1-methionine'}) --(m) with m order by m.name where m.name <> 'discipline' return m.name"}, {"query": "The publisher is an electronic industry publisher, so please find the 6 information in the 3 layers of this book.", "cypher": "match (:ENTITY{name:'180 cases of practical circuits with 4017 numerical counter}) - [*1..3]-(p) where p.name <> 'electronic industry publisher' return distinct p.name limit 6"}, {"query": "Tell me about 100 heroic role models who have made outstanding contributions to the founding of a new China: Chen Yueyang?", "cypher": "match (:ENTITY{name:'100 heroic role models who made outstanding contributions to the founding of a new China: Chen Yue'}) --(n) with n order by n.name return n.name"}, {"query": "I would like to know if Zhang is a military man, what other personal information is there? Please help me find 10 information on him in 2 layers.", "cypher": "match (:ENTITY{name:'Zhang Mu'}) - [*1..3]-(p) where p.name <> 'military' return distinct p.name limit 10"}, {"query": "I've been using 09 Returns to buy stuff lately, do you know which specific company is affiliated with it?", "cypher": "match ((:ENTITY{name:'09 return net'}) - [:Relationship{name:'affiliated company'}]-> (x) return x.name"}, {"query": "Ask who's main achievement was to become president of Dominica on March 5, 1878 and then on July 6, 1878.", "cypher": "match (:ENTITY{name:'March 5, 1878 - July 6, as President of the Dominican Republic'}) <- [:Relationship{name:'main achievements'}]- (p) return distinct p.name"}, {"query": "Tell me what are the three representative works of the Pearl of Konhai?", "cypher": "match (:ENTITY{name:'Kong's Sea Pearl' ((1942 ): Kong's other frontier chieftainswoman\u3002'}) <- [:Describe{name:'Description'}]-(m),(m) - [:Relationship{name:'represents works'}]->(p) return distinct p.name limit 3"}, {"query": "What documents are there on the thirty-first anniversary of the Republic [1942]?", "cypher": "match (q:ENTITY{name:'Republic of the Thirty-first Year [1942]'}) <- [:Relationship{name:'publication time'}]- (h) return h.name"}, {"query": "Tell me, what is the most dangerous substance to swallow and inhale?", "cypher": "match (m:ENTITY{name:'swallow, inhale highly toxic carcinogenic'}) <- [:Relationship{name:'danger description'}]- (n) return distinct n.name"}, {"query": "The 2nd World Internet Congress was hosted by China, with 10 forums and 22 topics, please find me 5 more for this conference.", "cypher": "match (n:ENTITY{name:'Second World Internet Congress'}) -->(h) with h order by h.name where h.name <> 'People's Republic of China' and h.name <> '10 forums, 22 topics' return h.name limit 5"}, {"query": "What are the Chinese names of people born in November 1979?", "cypher": "match (:ENTITY{name:'November 1979'}) <- [:Relationship{name:'date of birth'}]- ((n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 5"}, {"query": "Can you tell me about Timko Milan, a Slovak citizen, in two different relationships?", "cypher": "match (n:ENTITY{name:'Timko Milan'}) - [*1..2]->(x) where x.name<>'Slovakia' return distinct x.name"}, {"query": "Can you find out the five monarchs and what their respective roles are?", "cypher": "match (:ENTITY{name:' monarch'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' function'}]->(n) return m.name, n.name limit 5"}, {"query": "Where is the village of Zaron?", "cypher": "match (:ENTITY{name:'Zaron's home town'}) - [:Relationship{name:'geographical location'}]-> (m) return distinct m.name"}, {"query": "I want Zhang Zulin and Hu Jintao's book on the process of making electronics to help me find five information in the three layers of the book.", "cypher": "match (:ENTITY{name:' Electronic product manufacturing process'}) - [*1..3]-(p) where p.name <> 'Zhang Zulin Hu Jindong' return distinct p.name limit 5"}, {"query": "Who else in the infantry regiment, besides Colonel Alfred Wood, is there?", "cypher": "match (:ENTITY{name:'infantryman'}) <- [:Relationship{name:'army'}]-(n),(n) - [:Relationship{name:'colonel'}]->(m) where m.name <> 'Alfred Wood' return distinct m.name limit 1"}, {"query": "Can you describe the three types of relationships that are involved in the melancholy of a tennis player?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'the melancholy of a tennis player'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "Find me two rivers that flow into the Yellow Sea, where do they all come from?", "cypher": "match (:ENTITY{name:'\u9ec4\u6d77'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'source'}]->(n) return m.name, n.name limit 2"}, {"query": "What problems can magnetic exploration solve and where can it be applied?", "cypher": "match (:ENTITY{name:'magnetic exploration'}) - [:Relationship{name:'fundamental mission'}]->(n) return n.name as name union all match (:ENTITY{name:'magnetic exploration'}) - [:Relationship{name:'area'}]->(m) return m.name as name"}, {"query": "The website of the trade fair is called \"Sex Trade Network\".", "cypher": "Match (:ENTITY{name:'sex business network'}) <- [:Relationship{name:'collaborative media'}]- (m) return m.name"}, {"query": "What are the streets in Tianjin City?", "cypher": "match (n:ENTITY{name:' Tianjin City'}) <- [:Relationship{name:' City'}]- ((m) return distinct m.name"}, {"query": "Do you know what the predecessor of this school belonging to the public category is?", "cypher": "match (p:ENTITY{name:' public'}) <- [:Relationship{name:' category'}]-(x),(x) - [:Relationship{name:' predecessor'}]->(m) return m.name order by m.name limit 3"}, {"query": "What is the name of a book written by author Huang Wan in 2010 about the emperor?", "cypher": "match (:ENTITY{name:'Relationship{name:'author'}]-(m), (m) -[:Relationship{name:'published time'}]->(n) where n.name='2010-1-1' return distinct m.name"}, {"query": "List three professions that are communist, not including party group members.", "cypher": "match (:ENTITY{name:'Communist Party'}) <- [:Relationship{name:'faith'}]-(h),(h) - [:Relationship{name:'profession'}]->(n) where n.name <> 'party group member' return distinct n.name limit 3"}, {"query": "Can you tell me about the 2010 report of the People's Government of Wuwei?", "cypher": "match (n:ENTITY{name:'2010 Work Report of the People's Government of the City of Wuwei'}) --(x) with x order by x.name return x.name"}]