[{"query": "What are the private companies in Chengdu?", "cypher": "match (:ENTITY{name:'military enterprise'}) <- [:Relationship{name:'company nature'}]- (mn) - [:Relationship{name:'headquarters location'}]->(n:ENTITY{name:'\u6210\u90fd'}) return mn.name"}, {"query": "Tell me, what is the profession of this man, Chou Yanshan?", "cypher": "match (:ENTITY{name:'Chou yanshan'}) <- [:Relationship{name:'foreign language name'}]-(p) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 3"}, {"query": "What is the logP of the chemical: 1.86480?", "cypher": "The name of the file is \"Relationship\" (name: \"logP\"})"}, {"query": "Can you tell me the name of the relationship between the two layers involved in Jiangxi Stone City?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Jiangxi Stone City'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "Please help me find three ancient cities, what are their names?", "cypher": "match (:ENTITY{name:'Ancient City'}) <- [*]-(m), (m) - [:Relationship{name:'alias'}]->(n) return m.name, n.name limit 3"}, {"query": "The next parade of which parade is the 1950 National Day Parade?", "cypher": "match (:ENTITY{name:'1950 National Day Parade'}) <- [:Relationship{name:'Next time parade'}]- (m) return m.name"}, {"query": "What is the landmark building of the Shandong Provincial Capital Culture and Art Center?", "cypher": "match (:ENTITY{name:'Shandong Provincial Capital Culture and Art Center'}) <- [:Relationship{name:'foreign name'}]-(n) - [:Relationship{name:'landmark building'}]->(x) return distinct x.name limit 1"}, {"query": "What is the acronym used by the National Academic Conference on Sensitive Elements and Sensors?", "cypher": "match ((:ENTITY{name:'National Academic Conference on Sensitive Elements and Sensors'}) - [:Relationship{name:' abbreviated '}]-> (h) return h.name"}, {"query": "Can you tell us about the three-tier relationship of the Chinese Practical Clinical Skills curriculum in simple Chinese?", "cypher": "match (n:ENTITY{name:' Practical Chinese Medicine Clinical Skills Tutorial'}) - [:Relationship*1..3]->(x) where x.name <> 'simplified Chinese' return distinct x.name"}, {"query": "Do you know what works were published in January 2016?", "cypher": "match (x:ENTITY{name:'2016-1'}) <- [:Relationship{name:' year of publication'}]- (m) return distinct m.name"}, {"query": "Please recommend a famous place to visit in Kangme-ta Lake Rock, if not the Great Wall of Japan and the Taichung Rock Prophecy.", "cypher": "match (n:ENTITY{name:'Relationship{name:'famous attractions'}]->(h) where h.name <> 'Kazakya' and h.name <> 'Kazakya' return distinct h.name limit 1"}, {"query": "Please list three articles about the world's poorest president.", "cypher": "match (:ENTITY{name:'The poorest president in the world'}) --(p) return distinct p.name limit 3"}, {"query": "Please help me with the new Chinese proverb: The Goddess of Happiness knocks on the door, introducing a relationship with no less than two layers.", "cypher": "match (n:ENTITY{name:'Chinese proverb: The Goddess of Happiness is knocking at the door'}) - [:Relationship*1..2]->(x) where x.name <>'Relationship' return distinct x.name"}, {"query": "What is the shortest path of corn starch to corn stem rot in the two layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' corn wrinkle disease'}) - [:Relationship*..2]-(b:ENTITY{name:' corn stump disease'})) return count ((p)"}, {"query": "Do you know which countries have subtropical monsoon climates and what dialects they speak?", "cypher": "match (:ENTITY{name:'subtropical monsoon climate'}) <- [:Relationship{name:'climate conditions'}]-(h),(h) - [:Relationship{name:'dialect'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "I want to know about the three games that are dancing gold, except for the costume genre?", "cypher": "match (:ENTITY{name:'dancing gold'}) --(m) with m order by m.name where m.name <> 'dress' return distinct m.name limit 3"}, {"query": "Please list the actors who have been cast in the movie The Sisterhood of the Traveling Pants.", "cypher": "match (:ENTITY{name:'swinging'}) --(m) return distinct m.name"}, {"query": "Can you tell us about the two-layer relationship between the early education of the iconography of cultural works?", "cypher": "match (n:ENTITY{name:' Early education graphic version'}) - [*1..2]->(x) where x.name <> 'cultural work' return distinct x.name"}, {"query": "What are the five jobs that Liu Yan has?", "cypher": "match (:ENTITY{name:'Yun Yang'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 5"}, {"query": "The magazine is published in Shanghai and where is it published?", "cypher": "match (:ENTITY{name:' eat all over Shanghai'}) <- [:Relationship{name:' book name'}]- ((p) - [:Relationship{name:' publishing house'}]->(n) return distinct n.name limit 3"}, {"query": "Can you name the name of this thing with the life tag?", "cypher": "The following is a list of all the characters that are in the game:"}, {"query": "Which five novels are listed in the Jinjiang Literary City?", "cypher": "match (:ENTITY{name:'Jingjiang Literary City'}) <- [:Relationship{name:'connected website'}]- ((q) - [:Relationship{name:'Chinese name'}]->(p) return distinct p.name limit 5"}, {"query": "Do you remember the labels of the 110m hurdles?", "cypher": "match (:ENTITY{name:'110m final'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "What is the location of the outer islands?", "cypher": "match (:ENTITY{name:'shell island'}) - [:Relationship{name:'geographical location'}]->(n) return n.name"}, {"query": "Can you tell me about the artwork of the teen adventure series; The audiobook: Predator 2 in no more than 2 layers of relationships?", "cypher": "match (n:ENTITY{name:'young adult adventure series\u00b7known comic book superheroes: The Hunted 2'}) - [:Relationship*1..3]->(x) where x.name<>'Artwork' return distinct x.name"}, {"query": "Do you know what the most representative works of the leaf fly are?", "cypher": "match (:ENTITY{name:'spoonful'}) - [:Relationship{name:'represents work'}]-> (x) return x.name skip 2"}, {"query": "What are the main awards for the company located in the northern part of the city of Pyongyang?", "cypher": "match (:ENTITY{name:'From the North Road of the Rich People of Yangyang City (Northern Ring Road) ') }) <-[:Relationship{name:' address'}]-(q) -[:Relationship{name:' main award'}]->(m) return distinct m.name"}, {"query": "I want to know about 100 Chinese versions of everything.", "cypher": "match (:ENTITY{name:'100 layer Chinese version'}) --(m) with m order by m.name return m.name"}, {"query": "What are the advantages and disadvantages of polishing rubber?", "cypher": "The name of the function is the name of the function itself. The name of the function is the name of the function itself."}, {"query": "Can you type 10 labels for 100 economic class violations that are investigated and convicted?", "cypher": "match (:ENTITY{name:'100 economic class breaches investigated and identified'}) - [:Tag{name:'label'}]-> (x) with x order by x.name return x.name limit 10"}, {"query": "When was the experimental school in Cape Town founded? Who is the principal?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'time of foundation'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'current principal'}]->(m) return m.name as name"}, {"query": "I want to publish all the information about .NET XML Advanced Programming?", "cypher": "match (:ENTITY{name: .NET XML Advanced Programming'}) --(n) with n order by n.name where n.name <> 'publication' return n.name"}, {"query": "When the reporter is Chinese, who is there?", "cypher": "match (p:ENTITY{name:'Chinese'}) <--(x) --> ((q:ENTITY{name:'journalist'}) return x.name"}, {"query": "Can you tell us about the three attributes of 1234?", "cypher": "match (:ENTITY{name:'1234]) --(h) with h order by h.name return h.name limit 3"}, {"query": "I see Tite is a Brazilian football coach, can you tell me 7 more things about him?", "cypher": "match (n:ENTITY{name:'Tite'}) -->(h) with h order by h.name where h.name <> 'Brazil' and h.name <> 'football coach' return h.name limit 7"}, {"query": "Can you tell us about your knowledge of the nearshore space?", "cypher": "match (n:ENTITY{name:'nearshore space'}) --(x) return x.name"}, {"query": "Do you have five books of encouragement in plain clothes?", "cypher": "The following is a list of all the characters that appear in the game."}, {"query": "I'm not sure if I'm right, but I'm not sure I'm right.", "cypher": "match (n:ENTITY{name:'\u7389\u697c\u6625\u00b7\u7626\u5026\u4f5c\u767b\u9ad8\u53bb'}) - [:Relationship*1..3]->(x) where x.name <> 'return x.name'"}, {"query": "The basic syntax of a modeling language is written in upper case.", "cypher": "match (m:ENTITY{name:'distinguish between upper and lower case'}) <- [:Relationship{name:'basic syntax'}]- (q) return q.name"}, {"query": "You are the one who filled me with the words red, blue and moon, the one who is the most important person I want to marry in my three-tiered relationship?", "cypher": "match (n:ENTITY{name:'you are the one I want to marry'}) - [*1..3]->(x) where x.name <>'red day blue moon' return distinct x.name"}, {"query": "Can you tell me the main achievements of a person who has a career as an oil painter, art educator?", "cypher": "match (:ENTITY{name:'painter, art educator'}) <- [:Relationship{name:'profession'}]-(h) - [:Relationship{name:'representative work'}]->(p) return p.name order by p.name limit 1"}, {"query": "Who and where was born in the same place, and who have all these people with a tag? Show these people in order of their tag number.", "cypher": "match (n:ENTITY{name:'\u4e95\u4e0a\u9065\u4e43'}) - [:Relationship{name:'birthplace'}]->(:ENTITY) <- [:Relationship{name:'birthplace'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Do you know what this Chinese person does for a living?", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(n) - [:Relationship{name:'profession'}]->(m) return m.name order by m.name limit 1"}, {"query": "The head of the four noble families is from which family?", "cypher": "match (:ENTITY{name:'the head of the four great nobles'}) <- [:Relationship{name:'status'}]- ((m) return distinct m.name"}, {"query": "What is the name of a software book called Learn to Learn?", "cypher": "match (n:ENTITY{name:' is going to be a match}) <- [:Relationship{name:' is going to be a match}]- (q) return q.name"}, {"query": "How many companies are located in Philadelphia, USA? Can you name 11?", "cypher": "match (:ENTITY{name:'Philippines'}) <- [:Relationship{name:'location'}]- (m) return m.name limit 11 The name of the game is the same as the name of the game itself."}, {"query": "What is the relationship between the two layers of the banana egg breakfast cake?", "cypher": "The following pages link to The Unknown:"}, {"query": "What else is there to know about the WCO Alliance other than WCO?", "cypher": "match (h:ENTITY{name:'World Trade Organization'}) --(p) with p order by p.name where p.name <> 'World Trade Organization' return p.name"}, {"query": "I recommend three Korean pop songs similar to Every Night.", "cypher": "match (:ENTITY{name:'Korea'}) <- [:Relationship{name:'nationality'}]-(h) - [:Relationship{name:'representative work'}]->(x) where x.name <> 'Every Night' return distinct x.name limit 3"}, {"query": "So if you've learned to decimal, what's the decimal of 10, would you do it?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Do you know what chemical is the molecular formula is C10H10N2O2?", "cypher": "match (:ENTITY{name:'C10H10N2O2'}) <- [:Relationship{name:'molecular'}]- (x) return distinct x.name"}, {"query": "I want to find 6 tabletop games, what type of games?", "cypher": "match (:ENTITY{name:'tabletop game'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'game type'}]->(n) return m.name,n.name limit 6"}, {"query": "Where is the site of the Kirochitia? When was it excavated?", "cypher": "match (:ENTITY{name:'Kiroquitia site'}) - [:Relationship{name:'location'}]->(n) return n.name as name union all match (:ENTITY{name:'Kiroquitia site'}) - [:Relationship{name:'time of excavation'}]->(m) return m.name as name"}, {"query": "Where is the Forest Botanical Garden in Helanggang Province?", "cypher": "match (:ENTITY{name:'Forest Botanical Garden of Helanggang Province'}) <- [:Relationship{name:'Famous attractions'}]-(m), (m) - [:Relationship{name:'Administrative district category'}]->(n) where n.name='municipality' return distinct m.name"}, {"query": "Can you find me the first three Chinese names for the collection of Yexin's short stories?", "cypher": "match (:ENTITY{name:'Yeshin short story collection'}) - [:Relationship{name:'Chinese name'}]-> (p) with p order by p.name return p.name limit 3"}, {"query": "What about the 037000 communities?", "cypher": "match (:ENTITY{name:'037000 community'}) --(q) with q order by q.name return q.name"}, {"query": "What is the main ingredient of fried chicken balls?", "cypher": "match (:ENTITY{name:' fried balls'}) - [:Relationship{name:' main ingredient'}]->(n) return n.name as name union all match (:ENTITY{name:' fried balls'}) - [:Relationship{name:' classification'}]->(m) return m.name as name"}, {"query": "Do you know the time of the loading of the 2S31 self-propelled gun I have?", "cypher": "match ((:ENTITY{name:'2S31 self-propelled gun'}) - [:Relationship{name:'setup time'}]-> (p) return p.name"}, {"query": "When was Sichuan Confucius Pharmaceutical Group founded?", "cypher": "match (:ENTITY{name:' Sichuan Konzhen Pharmaceutical Group'}) - [:Relationship{name:' time of establishment'}]-> (m) return distinct m.name"}, {"query": "The list of 50 free apps on Android?", "cypher": "The following is a list of all the games that are available on Android:"}, {"query": "Do you know what the profession of the whale is?", "cypher": "match (:ENTITY{name:'swing'}) <- [:Relationship{name:'swing'}]- ((n) - [:Relationship{name:'swing'}]->(p) return distinct p.name limit 1"}, {"query": "What is the species of the striped parrot and where is it mainly distributed?", "cypher": "The name of the function is the name of the function itself. The function is the name of the function itself."}, {"query": "Do you have any other information about Tendai other than social activities?", "cypher": "match (:ENTITY{name:'Detail'}) --(m) with m order by m.name where m.name <> 'social activity' return distinct m.name limit 1"}, {"query": "I'm looking for two alumni of the T\u00fcbingen University of Fine Arts who have something to represent their work.", "cypher": "match (:ENTITY{name:'Tibetano University of Fine Arts'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:'representing work'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "Can you recommend 3 Chinese language software?", "cypher": "match (:ENTITY{name:' in Chinese'}) <- [:Relationship{name:' in Chinese'}]- (m) return m.name limit 3"}, {"query": "Do you know the five Chinese occupations?", "cypher": "match (n:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]- ((h) - [:Relationship{name:'profession'}]->(q) return q.name skip 1 limit 10"}, {"query": "Where will the 2004 Swiss Women's Elite League be held?", "cypher": "match ((:ENTITY{name:'2004 Swiss Women's Elite Championship'}) - [:Relationship{name:'place of the match'}]-> (n) return n.name"}, {"query": "Which version of the software is v2.5.4?", "cypher": "The following is a list of the most commonly used versions of the game."}, {"query": "Find out where the two national nature reserves are located.", "cypher": "match (:ENTITY{name:'national nature reserve'}) <- [*]-(m), (m) - [:Relationship{name:'area to which it belongs'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "What are the main achievements of people born in 1982? Can you list 5?", "cypher": "match (:ENTITY{name:'1982'}) <- [:Relationship{name:'date of birth'}]- ((p) - [:Relationship{name:'main achievements'}]->(m) return distinct m.name limit 5"}, {"query": "Tell me, what is the profile of the company within the three-tier relationship of this organization, the management consultancy company of Meiji United [Beijing] Limited?", "cypher": "match (n:ENTITY{name:'Mejid United [Beijing] Management Consulting Limited'}) - [*1..3]->(x) where x.name<>'organizing entity' return distinct x.name"}, {"query": "The men's team SUPER131 represents the team that plays football and also football.", "cypher": "match (:ENTITY{name:'SUPER131'}) - [:Relationship{name:'representative work'}]-> (n) with n order by n.name where n.name <> 'ball to play' return n.name"}, {"query": "Do you know which of the five relationship names in the two layers that the girl in the factory is involved in?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'the girl in the factory'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 5"}, {"query": "What is the shortest path between the village of Rai Bay and the village of Bergo Bay on the second floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Lay Bay Village'}) - [*..2]-(b:ENTITY{name:'Berg Bay Village'})) return count ((p)"}, {"query": "Can you recommend 5 games for iOS?", "cypher": "match (:ENTITY{name:'ios'}) <- [:Relationship{name:'game platform'}]- (n) return distinct n.name limit 5"}, {"query": "What are the songs of the singers who won the most important awards in the Songwriting Competition in Liaoning?", "cypher": "match (:ENTITY{name:'original song by Liu Dong-mun-yu won the important award in the Ningbo Good Sound Awards\u3002'})"}, {"query": "What is the molecular weight of 3-hydro-5-hydroxybutyric acid?", "cypher": "match ((:ENTITY{name:'3-methacrylate-5-methacrylate'}) -[:Relationship{name:'molecular mass'}]-> (h) return h.name"}, {"query": "What are the three letters of the alphabet? What do they mean?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)."}, {"query": "What are the 10 types of teaching materials published by Tsinghua University Press and how much do they cost?", "cypher": "match (:ENTITY{name:'Chinghua University Press'}) <- [*]-(m), (m) - [:Relationship{name:'Pricing'}]->(n) return m.name, n.name limit 10"}, {"query": "Please write me the first ten articles on 4-methoxy-sulfonyl acetate.", "cypher": "match (:ENTITY{name:'4-morphosphatase sulfide acetate'}) --(p) with p order by p.name return p.name limit 10"}, {"query": "I'm going to give you five anime characters, what gender are they?", "cypher": "match (:ENTITY{name:'animated character'}) <- [*]-(m), (m) - [:Relationship{name:' gender'}]->(n) return m.name, n.name limit 5"}, {"query": "Find out the details of the four-tier relationships of five British citizens, Smith Ben, OK?", "cypher": "match (n:ENTITY{name:'Smith Ben'}) - [*1..4]->(x) where x.name<>'UK' return distinct x.name limit 5"}, {"query": "What other ways to visit the Park of the Yangmye Rinpoche Scenic Area are there besides cycling and hiking?", "cypher": "match (n:ENTITY{name:'River River River's Scenic Park'}) -[:Relationship{name:'Tourism'}]->(h) where h.name <> 'hiking' and h.name <> 'biking' return distinct h.name limit 2"}, {"query": "What are the labels that describe 09Soft Piano?", "cypher": "match (:ENTITY{name:'09Soft Piano'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "What are the main characters in the film written by Tao Jianhui?", "cypher": "Match (:ENTITY{name:'Ciao Tian's}) <- [:Relationship{name:'writer'}]- ((p) - [:Relationship{name:'lead actor'}]->(m) return distinct p.name"}, {"query": "Do you know anything about the food poisoning incident in Yangzhou, Yangzhou, 12th-19th District?", "cypher": "match (:ENTITY{name:'12\u00b719 Yangzhou Township, Yangzhou County'}) --(n) with n order by n.name return n.name"}, {"query": "How do you understand 101 attempts to marry?", "cypher": "match (p:ENTITY{name:'101 times married'}) --(n) with n order by n.name return n.name"}, {"query": "Can you name 10 jobs that men do?", "cypher": "match (p:ENTITY{name:'man'}) <- [:Relationship{name:' gender'}]- ((q),(q) - [:Relationship{name:' profession'}]->(m) return distinct m.name limit 10"}, {"query": "Can you help me check the noise parameter of a 2X vacuum tube?", "cypher": "match ((:ENTITY{name:'2X spiral vacuum tube'}) - [:Relationship{name:'noise'}]-> (q) return q.name"}, {"query": "I'm not sure if you know Stephen Soderbergh, but I'd like to know his message.", "cypher": "match (:ENTITY{name:'Stephen Soderbergh'}) --(p) return distinct p.name"}, {"query": "Would you recommend a bus that can take you to the hotel complex?", "cypher": "match (:ENTITY{name:'complex hotel'}) <- [:Relationship{name:'nature'}]- ((q),(q) - [:Relationship{name:'bus'}]->(x) return distinct x.name limit 1"}, {"query": "Can you list three representative works by Chinese writers?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(n) - [:Relationship{name:'representative work'}]->(x) return distinct x.name limit 3"}, {"query": "Can you tell me where the baby was born?", "cypher": "match (:ENTITY{name:'sub'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'birthplace'}]->(n) return distinct n.name"}, {"query": "Can you tell me about five cultural events?", "cypher": "match (:ENTITY{name:' cultural activities'}) <--(n) return n.name limit 5"}, {"query": "The name of the person is Yue and the name Yue Wei is another name for him.", "cypher": "match (:ENTITY{name:'swing'}) <- [:Relationship{name:'swing'}]-(p) - [:Relationship{name:'swing'}]->(n) where n.name <> 'swing' return distinct n.name limit 1"}, {"query": "The film is based on the novel of the same name by the British writer and filmmaker, who is also the main character of the film.", "cypher": "match (:ENTITY{name:'British Imperial Entertainment Group Limited'}) <- [:Relationship{name:'brokerage company'}]-(m), (m) - [:Relationship{name:'representing work'}]->(n) where n.name='Hurricane rises (feat. wheat) ' return m.name"}, {"query": "Can you tell me what the ISBN is for a book of 278 pages?", "cypher": "The following is a list of the most commonly used tags for the game:"}, {"query": "Please let me know what are the main achievements of this person who believes in the Communist Party? 3 lines?", "cypher": "match (:ENTITY{name:' Communist Party'}) <- [:Relationship{name:' faith'}]- ((q),(q) - [:Relationship{name:' major achievements'}]->(m) return m.name skip 2 limit 5"}, {"query": "Is the 1-acrylamide cord used on the label of the drug also used on the label?", "cypher": "match (:ENTITY{name:'1-acrylic string'}) - [:Tag{name:'label'}]-> (p) with p order by p.name where p.name <> 'drug' return p.name"}, {"query": "Guess how many companies are in Dalian?", "cypher": "match (p:ENTITY{location:'\u5927\u8fde'}) return count ((p)"}, {"query": "What is a three-color algorithm, a four-color algorithm in a real-world algorithm?", "cypher": "match (:ENTITY{name:'three-color algorithm, four-color algorithm'}) <- [:Relationship{name:'reality algorithm'}]- (p) return distinct p.name"}, {"query": "And I'm going to explain the +ve that is commonly used in hospitals.", "cypher": "match (:ENTITY{name:'+ve'}) --(q) with q order by q.name where q.name <> 'hospital' return q.name"}, {"query": "What chemical is the CAS number 71-36-3?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What is the work of someone born in April 1973?", "cypher": "match (:ENTITY{name:'April 1973'}) <- [:Relationship{name:'date of birth'}]- ((p),(p) - [:Relationship{name:'representing work'}]->(x) return distinct x.name"}, {"query": "The final was held on 20 September and 1 October 1983.", "cypher": "match (:ENTITY{name:' preliminary round: 24 April-5 May 2; final: 20 September to 1 October 1983) }) <- [:Relationship{name:' time of holding'}]- (m) return distinct m.name"}, {"query": "The following is a list of the best-selling paintings in the world, published by Beijing Joint Publishing Company: Inspirational Selection: The Bridge 2 Levels Relationship.", "cypher": "match (n:ENTITY{name:'Inspired by selected world best-selling paintings: bridge'}) - [:Relationship*1..2]->(x) where x.name<>'Beijing Joint Publishing Company' return distinct x.name"}, {"query": "Please tell me who created this piece of work, the eye of the meteorite?", "cypher": "match (:ENTITY{name:'eyeballs of the meteorite'}) --(p) return distinct p.name limit 3"}, {"query": "Can you recommend a software for booking tickets, inquiries, travel tools?", "cypher": "match (:ENTITY{name:' booking, inquiry, travel tool'}) <- [:Relationship{name:' software category'}]- (m) return m.name"}, {"query": "I want to know which novels are being re-posted on 17k Novels. Do you know which five?", "cypher": "match (:ENTITY{name:'17k novel network'}) <- [:Relationship{name:'connecting platform'}]- (p) return distinct p.name limit 5"}, {"query": "How much is a ticket to Shenzhen Zoo?", "cypher": "Match (:ENTITY{name:'Shenzhen Wildlife Park'}) - [:Relationship{name:'Ticket price'}]->(n) return n.name"}, {"query": "What is the maximum speed of the AIM-9X Rattlesnake in common use?", "cypher": "match ((p:ENTITY{name:'AIM-9X rattlesnake missile'}) - [:Relationship{name:'maximum speed'}]-> (h) return h.name"}, {"query": "Can you tell me about the first three professions of paper people?", "cypher": "match (:ENTITY{name:'producer'}) <- [:Relationship{name:'profession'}]- (q) return q.name order by q.name limit 3"}, {"query": "Where is the charity receiving donations?", "cypher": "match (:ENTITY{name:' charitable donation'}) - [:Relationship{name:' receiving institution'}]->(m) return distinct m.name"}, {"query": "Can you tell me about the famous sights of the Revolutionary History Memorial of the Middle East Primary School?", "cypher": "match (:ENTITY{name:'Relationship{name:'Famous attractions'}}-> (h) return h.name order by h.name limit 10"}, {"query": "Can you tell me about the content of the Khaos Legions dish?", "cypher": "match (:ENTITY{name:' Khaos Legions''}) --(q) return q.name order by q.name"}, {"query": "I heard that the .se domain name has several link tags, can you give me 5 of them?", "cypher": "match (:ENTITY{name:'.se domain name'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 5"}, {"query": "Do you know what the men's, women's, and half marathon events are?", "cypher": "match (:ENTITY{name:'man, woman, half marathon'}) <- [:Relationship{name:'competition project'}]- (m) return distinct m.name"}, {"query": "I want to attend the 2012 China International Rental Industry Expo, which venue do I need to go to?", "cypher": "match ((:ENTITY{name:'2012 China International Rental Industry Expo'}) - [:Relationship{name:'conference venue'}]-> (x) return x.name"}, {"query": "Do you know the magnitude of the 11.10 Taiwan earthquake in Yilan?", "cypher": "match ((:ENTITY{name:'11\u00b710 Taiwan Yilan earthquake'}) - [:Relationship{name:'seismic grade'}]-> (m) return m.name"}, {"query": "Can you recommend 20 novels that are currently being published?", "cypher": "match (:ENTITY{name:'linked'}) <- [:Relationship{name:'status'}]- (m) return m.name limit 20"}, {"query": "Can you give me information on 5 3G energy-saving lights?", "cypher": "match (:ENTITY{name:'3G energy saving lamp'}) --(n) with n order by n.name return n.name limit 5"}, {"query": "What is the profession of the person who represents love in the Himalayas?", "cypher": "match (q:ENTITY{name:'Love in the Himalayas'}) <- [:Relationship{name:'represents work'}]-(m),(m) - [:Relationship{name:'profession'}]->(x) return distinct x.name"}, {"query": "Can you give me information on the three-layer relationship of the abdominal vein and peripheral vascular MRI technology to the liver vein, the cavernous vein thrombus or the tumor thrombus?", "cypher": "match (n:ENTITY{name:' Magnetic resonance imaging technology for abdominal veins and peripheral blood vessels'}) - [:Relationship*1..3]->(x) where x.name <> 'Hepatal vein, cavernous vein thrombus or tumor thrombus' return distinct x.name"}, {"query": "This guy was born in Guizhou, Guizhou, what is his profession and can you tell me 10 things about him?", "cypher": "match (:ENTITY{name:'Kuwait'}) <- [:Relationship{name:'birthplace'}]-(q),(q) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 10"}, {"query": "Please list one of the occupations of this female figure for me.", "cypher": "match (:ENTITY{name:' female'}) <- [:Relationship{name:' gender'}]- ((q),(q) - [:Relationship{name:' profession'}]->(m) return m.name skip 1 limit 1"}, {"query": "The film is based on the novel of the same name by the writer, who is the author of the book.", "cypher": "match (:ENTITY{name:'Relationship{name:'The year of creation'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'The author'}) ->(m) return m.name as name"}, {"query": "Can you tell me what is the name of the foreign language of Jida Takami?", "cypher": "match (:ENTITY{name:'Kazuki'}) <- [:Relationship{name:' Chinese name'}]- ((p) - [:Relationship{name:' foreign name'}]->(n) return distinct n.name"}, {"query": "What is the meaning of the phrase \"the lowest of the low\" in the Chinese historian, the merchant king?", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship'}- (m), (m) - [Relationship'}-> (n) where n.name='under the thumb' return distinct m.name"}, {"query": "I would like to ask what are the relations between the two levels of the bilateral monopoly?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'binary monopoly'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What is the shortest path between the two levels of Umun and Nauru?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Umun village'}) - [*..2]-(b:ENTITY{name:'Nauru village'})) return count ((p)"}, {"query": "What are the other two things in the post about the music industry besides music?", "cypher": "match (:ENTITY{name:'sendlabs'}) - [:Tag{name:'tags'}]-> (p) with p order by p.name where p.name <> 'art' return p.name limit 2"}, {"query": "The following is a list of all the different ways Marvel's Four Horsemen: Alien 2009 is credited in the database:", "cypher": "match (:ENTITY{name:' Marvel Knights: Alien 2009'}) --(m) with m order by m.name where m.name <> 'Europe and America' return distinct m.name limit 4"}, {"query": "In addition to being the 98th Lieutenant, can you tell me 10 things you know about the two layers of journalism?", "cypher": "match (:ENTITY{name:'focus'}) - [*1..2]->(p) where p.name <> 'ninety-eighth' return p.name limit 10"}, {"query": "The problem is that the content of the five literary works is in the four-tier relationship with the Hanmin Palace of the Chancellor of the Exchequer, Lee Kuan Yew.", "cypher": "match (n:ENTITY{name:'Born and raised in the King's Bench of the King's Bench'}) - [*1..4]->(x) where x.name<> 'Literary works' return distinct x.name limit 5"}, {"query": "What is the pressure difference between the company's new 0110R003BH5HC core and the current one?", "cypher": "The name of the file is \"Relationship\" (Relationship)"}, {"query": "Tell me about the three-layer relationship of the drug Famotidine, the bottle of Famotidine in English.", "cypher": "match (n:ENTITY{name:'Famotidine'}) - [*]->(x) where x.name <>'Famotidine' return distinct x.name"}]