[{"query": "The following is a list of all the relevant information about male polycystic ovary syndrome.", "cypher": "match (n:ENTITY{name:'man-in-the-middle'}) -[:Relationship*]->(x) where x.name <> 'man' return distinct x.name"}, {"query": "Do you know what 32 books are selling for $15.8?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Can you recommend a book for a quick class on building engineering skills?", "cypher": "match (:ENTITY{name:' Construction engineering skills and abilities'}) <- [:Relationship{name:' category'}]- (p) return distinct p.name"}, {"query": "I would like to know about the organization's relationship with Kim City Hemp Development Co. Ltd.", "cypher": "match (n:ENTITY{name:' from Kimyo-shi Hen developed Enterprises Limited'}) - [*1..4]->(x) where x.name<>'organization' return distinct x.name"}, {"query": "What are the most representative works of a writer born in Jilin? Can you tell me three?", "cypher": "match (:ENTITY{name:'Jilin Province'}) <- [:Relationship{name:'place of birth'}]-(q),(q) - [:Relationship{name:'representative work'}]->(p) return distinct p.name limit 3"}, {"query": "What is the Chinese name of Love in Christmas? When was the song released?", "cypher": "The name of the song is \"Love in Christmas\" (Relationship) and the name of the song is \"Love in Christmas\" (Relationship)."}, {"query": "Can you show me a brief description of the two-tier relationship between the station and the station on the Sanjay Ganges Road?", "cypher": "match (n:ENTITY{name:'Panoah River Road Station'}) - [:Relationship*1..2]->(x) where x.name<>'station' return distinct x.name"}, {"query": "Please tell me the nationality of Konstantin Dmitrievich Ushensky, please.", "cypher": "match (:ENTITY{name:'Konstantin Dmitrievich Ushensky'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'nationality'}]->(q) return distinct q.name"}, {"query": "Please introduce me to the first three articles of Charles Knapp.", "cypher": "match (:ENTITY{name:'Charles Knapp'}) --(h) return h.name order by h.name limit 3"}, {"query": "The company was founded in what year?", "cypher": "match (p:ENTITY{name:' long sign company'}) return p.time"}, {"query": "Please tell me what are the main achievements of Zornik?", "cypher": "match (:ENTITY{name:'Zornik'}) - [:Relationship{name:'main achievement'}]-> (q) return distinct q.name"}, {"query": "What is the label attribute of a 1020 social event?", "cypher": "match (:ENTITY{name:'1020'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'social event' return p.name limit 1"}, {"query": "What were the occupations of the Ming Dynasty?", "cypher": "match (:ENTITY{name:'Ming'}) <- [:Relationship{name:'at the time'}]-(h),(h) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 5"}, {"query": "I'm not sure if you're familiar with the topic.", "cypher": "match (n:ENTITY{name:'scholarly life'}) --(x) return x.name"}, {"query": "Super Hacker is back in action game is there anything similar? 10 games to play.", "cypher": "match (n:ENTITY{name:'Super Hacker is back in the best version'}) <-[:Relationship{name:'Chinese name'}]-(p),(p) -[:Relationship{name:'game size'}]->(q) where q.name <> 'action game' return distinct q.name limit 10"}, {"query": "Do you know what the names of the relationships within the two levels of the Ole Hotel are?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Ole Hotel'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "The following is a list of the top 10 best online accounting courses in the world.", "cypher": "match (n:ENTITY{name:' Higher education institution twelve-fifths planning material: accounting principles'}) - [:Relationship*1..3]->(x) where x.name<>'Hang Mengfei' return distinct x.name"}, {"query": "Can you list all the relationships within the two tiers of Social Security income?", "cypher": "The following pages link to The Unknowns:"}, {"query": "Do you know what concerts were held at Shanghai Stadium?", "cypher": "match (:ENTITY{name:'Shanghai Stadium'}) <- [:Relationship{name:'Show venue'}]- (x) return distinct x.name"}, {"query": "What is the shortest relationship path between the respiratory and the pyloric veins?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'breathing path'}) -[:Relationship*..2]-(b:ENTITY{name:'pillar jamming path'})) return count ((p)"}, {"query": "I just finished watching 007: The Skybreaker, do you know when it was filmed?", "cypher": "Match (s) (h) return (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h ("}, {"query": "The Chinese website started with eight non-verbal works.", "cypher": "match (:ENTITY{name:' starting point Chinese web'}) <--(m), (m) -->> ((n) where n.name <> 'speech' return distinct m.name limit 8"}, {"query": "Can you tell me which celebrity's husband is Wen Shen?", "cypher": "match (:ENTITY{name:'Wen Hsien'}) <- [:Relationship{name:'husband'}]- ((x) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name"}, {"query": "Can you tell me which institutions have a tier 3 label relationship with scientific research institutions?", "cypher": "match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'research institution'}) return distinct n.name limit 6"}, {"query": "The traditional line drawings of characters are good for more than simple Chinese.", "cypher": "match (:ENTITY{name:'Chinese painting: traditional line drawing characters'}) --(m) with m order by m.name where m.name <> 'Simplified Chinese' return distinct m.name limit 2"}, {"query": "Please tell me what kind of work I do as an American citizen?", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(n),(n) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 3"}, {"query": "Can you tell me about the three famous alumni of the school that was founded in 1960?", "cypher": "match (:ENTITY{name:'1960'}) <- [:Relationship{name:'time of founding'}]- ((p),(p) - [:Relationship{name:'known alumni'}]->(x) return x.name skip 1 limit 3"}, {"query": "How many species of animals are known by the Latin name Diptera?", "cypher": "match (n:ENTITY{name:'DIPTERA'}) <- [:Relationship{name:'Latin name'}]- (m) return m.name limit 4"}, {"query": "Did you know that Zhang Shaoqi works as a cook?", "cypher": "match (:ENTITY{name:'Zhang Shaoqi'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 1"}, {"query": "What is the biggest award in civil engineering?", "cypher": "match (n:ENTITY{name:'the largest award established in civil engineering'}) --(x) return distinct x.name"}, {"query": "Wang Bingfeng has three other achievements besides being the person responsible for the advanced land management in Huanggang City.", "cypher": "match (:ENTITY{name:'Wang Bingbing'}) <- [:Relationship{name:'Chinese name'}]- ((q) - [:Relationship{name:'main achievements'}]->(n) where n.name <> 'Advanced person in land management in Huanggang City' return distinct n.name limit 3"}, {"query": "Please tell me what events and institutions are happening in Gujarat?", "cypher": "match (:ENTITY{name:'for the county'}) <-[:Relationship{name:'place'}]- (x) return distinct x.name"}, {"query": "Do you know of any other works by a person with a fresh, unconventional, and unique style of songwriting?", "cypher": "match (:ENTITY{name:'fresh out of the box, unusual'}) <-[:Relationship{name:'tracklist style'}]-(h) -[:Relationship{name:'representing work'}]->(q) return q.name order by q.name limit 5"}, {"query": "Tell me about the 10 most relevant topics in the road transport tourism map of Shanghai, Jiangsu, Jiangsu, and Anhui.", "cypher": "match (:ENTITY{name:'07- Shanghai Jiangsu Zhejiang Anhui region-road traffic tourism details'}) --(x) with x order by x.name return x.name limit 10"}, {"query": "I need to know the details of the 10/13 Guangnan High Speed Gun Hostage Abduction.", "cypher": "match (:ENTITY{name:'10\u00b713 Guangnan high-speed gun-wielding hostage case'}) --(p) with p order by p.name where p.name <> 'social event' return p.name"}, {"query": "What else do you know about Lang Chow Show besides being a female singer? Find 10 information in 2 layers.", "cypher": "match (:ENTITY{name:'Lang-Yun-Shui'}) - [:Relationship*1..2]-(p) where p.name <> 'high-pitched female singer' return distinct p.name limit 10"}, {"query": "Do you know what kind of events are held at the Honshu Stadium?", "cypher": "match (:ENTITY{name:'Hong Kong Stadium'}) <- [:Relationship{name:'Show venue'}]- (q) return q.name"}, {"query": "Can you name 10 of the famous sights of the Gossip Shrine?", "cypher": "match (:ENTITY{name:'Relationship'}) <- [:Relationship{name:'Relationship' type'}]- ((p) - [:Relationship{name:'Famous attractions'}]->(n) return n.name order by n.name limit 10"}, {"query": "And what do you know of the first three verses?", "cypher": "match (x:ENTITY{name:'P'}) --(p) return p.name order by p.name limit 3"}, {"query": "Can you find me the website of this company?", "cypher": "match (:ENTITY{name:'resident business'}) <-[:Relationship{name:'Chinese name'}]-(p) -[:Relationship{name:'official website'}]->(n) return distinct n.name"}, {"query": "Is there any specific label for the 2.19 magnitude earthquake?", "cypher": "match (:ENTITY{name:'2.19 triple earthquake'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'natural' return x.name"}, {"query": "Baby's cognitive picture book: How does a baby recognize food?", "cypher": "match (:ENTITY{name:'0-2 years old baby's cognitive picture book: baby recognizes food'}) - [:Tag{name:'label'}]-> (m) with m order by m.name where m.name <> 'publication' return m.name"}, {"query": "I would like to know the relevant information about this person Oikonomou in the four levels of relationships?", "cypher": "match (n:ENTITY{name:'Oikonomou'}) - [*1..4]->(x) where x.name <> 'person' return distinct x.name limit 5"}, {"query": "Which book has the barcode 9787564208752 on the top?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What are the advantages and disadvantages of distributed processing?", "cypher": "The name of the function is the name of the function itself. The name of the function is the name of the function itself."}, {"query": "Do you know which exhibitions have a floor area of 46,000 square meters?", "cypher": "match (:ENTITY{name:'46000 square metres'}) <- [:Relationship{name:'exhibition area'}]- (m) return m.name"}, {"query": "Do you know what the main prizes are for this 105kg man? Please give me 10 of them.", "cypher": "match (:ENTITY{name:'105KG'}) <- [:Relationship{name:'weight'}]-(m) - [:Relationship{name:'main prize'}]->(x) return x.name order by x.name limit 10"}, {"query": "What is the name of the social event published by Deng Kwun Che?", "cypher": "match (:ENTITY{name:'Relationship{name:' publisher'}]- (x) return x.name"}, {"query": "Can you name an anime agency in Anhui?", "cypher": "match (:ENTITY{name:'Anhui Huangsan'}) <- [:Relationship{name:'location'}]- (n) return distinct n.name"}, {"query": "Please tell me what is the third level of the Chinese university label?", "cypher": "match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'University of China'}) return distinct n.name"}, {"query": "I would like to know the name of this Chinese person and his last name, can you tell me five lines?", "cypher": "The following is a list of the most commonly used characters in the game."}, {"query": "I would like to know the main achievements of this teacher and researcher.", "cypher": "match (:ENTITY{name:'teacher and researcher'}) <- [:Relationship{name:'profession'}]- ((m) - [:Relationship{name:'main achievement'}]->(x) return x.name skip 2 limit 5"}, {"query": "I'm not sure how to say the word animal in English.", "cypher": "match (:ENTITY{name:'animal domain'}) <- [:Relationship{name:'domain'}]-(n),(n) - [:Relationship{name:'name'}]->(x) return distinct x.name limit 1"}, {"query": "I'm currently working on a book called Industrial Design Instructional Materials for Higher Education: The Three Levels of Design Psychology.", "cypher": "match (n:ENTITY{name:' Higher education institution industrial design planning teaching material: design psychology'}) - [:Relationship*1..3]->(x) where x.name <> 'publication' return distinct x.name"}, {"query": "The following is a list of five personal information in the five levels of relationship of sports personality Midori Kimura.", "cypher": "match (n:ENTITY{name:'\u4ef2\u6751\u4eac\u96c5'}) - [*1..5]->(x) where x.name <> 'sportsman' return distinct x.name limit 5"}, {"query": "Who has the longest name of the graduate of Sichuan Art Vocational College?", "cypher": "match (:ENTITY{name:' Sichuan Art Vocational College'}) <- [:Relationship{name:' Graduate School'}]-(m) return max(m.name)"}, {"query": "I have trouble finding the Sima Yan Literature and Life Writing Exercise Book published by Electronic Industries Publishing: 5 information materials for 5th grade?", "cypher": "match (n:ENTITY{name:'Shimura Yamamoto; Lifework: 5th grade'}) - [:Relationship*]->(x) where x.name <> 'Electronic industry publisher' return distinct x.name limit 5"}, {"query": "Who are the people who helped me find the tennis players in the USA?", "cypher": "match (p:ENTITY{name:'United States'}) <--(x) --> ((q:ENTITY{name:' tennis player'}) return x.name"}, {"query": "Looking for 10 people weighing 65 kg?", "cypher": "match (:ENTITY{name:'65 kg'}) <- [:Relationship{name:'weight'}]- ((n) return distinct n.name limit 10"}, {"query": "Who has won the title of the 10 most outstanding young entrepreneurs in Enschede?", "cypher": "match (q:ENTITY{name:'The 10 most prominent young entrepreneurs in Enschede'}) --(p) return p.name order by p.name"}, {"query": "Can you tell us about the kind of relationships involved in the 23rd International Film Festival of Logano in the two layers?", "cypher": "Match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'23rd Locarno International Film Festival'}) UNWIND relations(path) AS rel RETURN distinct rel.name"}, {"query": "Can you name a company that is based in the suburbs of Yangon?", "cypher": "match (:ENTITY{name:'suburb of the city'}) <- [:Relationship{name:'headquarters location'}]- (q) return q.name"}, {"query": "The following is a list of the topics covered by the blog of the writer and the author of the book, Ranjaya.", "cypher": "match (n:ENTITY{name:' listen to Ranjay say stone\u00b7Mapawan poetry'}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "What are the main ingredients and additives of the mycorrhizal?", "cypher": "match (:ENTITY{name:'Pyramidal'}) - [:Relationship{name:'Main ingredient'}]->(n) return n.name as name union all match (:ENTITY{name:'Pyramidal'}) - [:Relationship{name:'Supplementary'}]->(m) return m.name as name"}, {"query": "How to find all the product information for a 5.62MB application software that is easy to learn?", "cypher": "match (n:ENTITY{name:'easy to learn'}) - [*1..5]->(x) where x.name<>'easy to learn is a 5.62MB application for Android 2.2 and above. return distinct x.name"}, {"query": "Can you tell me which school won the main prize for the 7th place in the French Business School, Figaro 2015?", "cypher": "match (:ENTITY{name:' French Business School ranked 7th, Figaro newspaper, 2015,'}) <- [:Relationship{name:' major award'}]- (q) return distinct q.name"}, {"query": "Please help me find out who the six scientists are, and what their qualifications are.", "cypher": "match (:ENTITY{name:'researchers'}) <- [*]-(m), (m) - [:Relationship{name:'academic degrees'}]->(n) return m.name, n.name limit 6"}, {"query": "What is the role of moonflower oil and where is it distributed?", "cypher": "match (:ENTITY{name:'Relationship{name:'function'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'distribution'}) ->(m) return m.name as name"}, {"query": "What other occupations does this man born on March 28, 1937 have? Do you know 10?", "cypher": "match (:ENTITY{name:'28 March 1937'}) <- [:Relationship{name:'date of birth'}]-(m),(m) - [:Relationship{name:'profession'}]->(q) return q.name order by q.name limit 10"}, {"query": "What is the name of the shellfish species known as the watermelon?", "cypher": "match (:ENTITY{name:'hybrid chickpeas, peaches, flowers'}) <- [:Relationship{name:'Chinese place name'}]-(m) return distinct m.name"}, {"query": "Do you have all the types of relationships involved in the urban market in the 4 levels?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:' Urban Market'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "What is the definition of the '03 Platinum Generation' in 10 words?", "cypher": "match (:ENTITY{name:'03 platinum generation'}) --(q) with q order by q.name return q.name limit 10"}, {"query": "What historical events took place in the first five years of the Qing Dynasty?", "cypher": "match (:ENTITY{name:'Relationship{name:'period'}) - ((x) - [Relationship{name:'historical record'}]->(n) return distinct n.name"}, {"query": "Can you tell me the two labels of Zhou Zhen, but not sports and personality?", "cypher": "match (n:ENTITY{name:'showdown9'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'sports' and h.name <> 'person' return distinct h.name limit 2"}, {"query": "The University of Chicago-educated author lists three other works in addition to writing The Bridge on the River Kwai.", "cypher": "match (:ENTITY{name:'University of Chicago'}) <- [:Relationship{name:'Graduate School'}]-(x) - [:Relationship{name:'Representative work'}]->(m) where m.name <> 'Mother cheating mother' return distinct m.name limit 3"}, {"query": "What is the Chinese name for the animal with the same wings?", "cypher": "match (:ENTITY{name:' equal wings'}) <- [:Relationship{name:' Chinese name'}]- ((h) - [:Relationship{name:' Chinese name'}]->(x) return distinct x.name"}, {"query": "Please help me find three economists, what are their qualifications?", "cypher": "match (:ENTITY{name:'economic person'}) <- [*]-(m), (m) - [:Relationship{name:'academic degree'}]->(n) return m.name, n.name limit 3"}, {"query": "What is the name of the terrorist attack that took place in a foreign country on November 13, 2010?", "cypher": "match (:ENTITY{name:'November 13, 2010'}) <- [:Relationship{name:' time of occurrence'}]- (p) return p.name"}, {"query": "The name of the famous mountain Tibetan is from which dynasty?", "cypher": "match (:ENTITY{name:'Name'}) - [:Relationship{name:'Name'}]->(n) return n.name as name union all match ((:ENTITY{name:'Name'}) - [:Relationship{name:'Author'}]->(m) return m.name as name"}, {"query": "Can you name 13 online novels?", "cypher": "match (x:ENTITY{name:'network novel'}) <- [:Relationship{name:' type'}]- (n) return n.name limit 13"}, {"query": "Please tell me which government reporting plan has chapters in chapter 8?", "cypher": "match (:ENTITY{name:' eight chapters'}) <- [:Relationship{name:' chapter number'}]- (m) return m.name limit 3"}, {"query": "Zhu Boen was removed from the civil service, what other information?", "cypher": "match (:ENTITY{name:'Zhou's'}) --(m) with m order by m.name where m.name <> 'public servant' return distinct m.name limit 1"}, {"query": "Do you know what chemical has a molecular weight of 400.38?", "cypher": "The name of the function is the same as the name of the function itself."}, {"query": "Can you give me some information about the three levels of relationship of this person, Hategekimana Bonaventure?", "cypher": "match (n:ENTITY{name:'Hategekimana Bonaventure'}) - [*1..3]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "I need to know if the work of Tan Dai is related to a two-tier relationship with less than 1?", "cypher": "match (n:ENTITY{name:' send less than 1'}) - [:Relationship*1..2]->(x) where x.name <>'\u5510' return distinct x.name"}, {"query": "The first is to find out the content of the poem in the second layer of the relationship between the theme and the light bulb.", "cypher": "match (n:ENTITY{name:'theme flashlight'}) - [:Relationship*1..2]->(x) where x.name<>'Symbol' return distinct x.name"}, {"query": "What concerts did Zhang's schoolmates have in 2011?", "cypher": "match (x:ENTITY{name:'Relationship{name:'performer'}]) - (h) return h.name"}, {"query": "What lists did Forbes publish on March 29? Can you list four?", "cypher": "match (:ENTITY{name:'March 29'}) <- [:Relationship{name:' time of publication'}]- (m) return m.name limit 4"}, {"query": "What are the methods used to do this?", "cypher": "match (:ENTITY{name:'requirement analysis'}) - [:Relationship{name:'discipline'}]->(n) return n.name as name union all match (:ENTITY{name:'requirement analysis'}) - [:Relationship{name:'method'}]->(m) return m.name as name"}, {"query": "What kind of profession does a person who believes in the Chinese Communist Party do?", "cypher": "match (:ENTITY{name:'CPC'}) <- [:Relationship{name:'faith'}]-(m),(m) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 1"}, {"query": "Which princes are there in England?", "cypher": "match (p:ENTITY{name:'UK'}) <--(x) --> ((q:ENTITY{name:'Prince'}) return x.name"}, {"query": "What else do you know about Martin Ryle besides that he is British?", "cypher": "match (:ENTITY{name:' Martin Ryle'}) - [:Relationship*1..2]-(p) where p.name <> 'UK' return distinct p.name limit 10"}, {"query": "Tell me, what is Li Zhengya's profession?", "cypher": "match (:ENTITY{name:'Li Chengzai, male, Han, born December 1964, native of Nungjiang, Heilongjiang, joined the party in August 1986, entered the party in January 1991, university education\u3002'})"}, {"query": "In which publishing houses did Mujiwara's books appear?", "cypher": "match (:ENTITY{name:'Mu\u7389\u534e'}) <- [:Relationship{name:'author'}]- ((n) - [:Relationship{name:'publisher'}]->(q) return distinct q.name limit 2"}, {"query": "I need to know three jobs for Claude Chagrin, you know?", "cypher": "match (:ENTITY{name:'Claude Chagrin'}) - [:Relationship{name:'profession'}]-> (h) return distinct h.name limit 3"}, {"query": "I'm not sure who is the collaborator of Max Martini.", "cypher": "match (:ENTITY{name:' Max Martini'}) <- [:Relationship{name:' collaborator'}]- (x) return distinct x.name"}, {"query": "In addition to accounting and computer science, what are the two main departments of Zhongning Vocational Secondary School?", "cypher": "match (n:ENTITY{name:'Zhouning Vocational Secondary School'}) -[:Relationship{name:'Main Faculty'}]->(h) where h.name <> 'Accounting major' and h.name <> 'Computer major' return distinct h.name limit 2"}, {"query": "I recently heard that Beccaro Daniel is an Italian footballer, can you tell me four more things about him?", "cypher": "match (n:ENTITY{name:'Beccaro Daniel'}) -->(h) with h order by h.name where h.name <> 'Italy' and h.name <> 'football' return h.name limit 4"}, {"query": "The minimum pressure of a storm is 993 millimeter (Pa); 29.32 inHg?", "cypher": "The name of the game is \"Relationship\" (Relationship: Minimum Pressure)"}, {"query": "The International English School of Harbin Global ATS has opened the Advanced Placement Testing Training School in addition to the main department and recommended three other important departments.", "cypher": "match (:ENTITY{name:'Harbin Global Athletic International English School'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'Main Faculty'}]->(q) where q.name <> 'Athletic Training Centre ' return distinct q.name limit 3"}, {"query": "So let me find the hash function expression.", "cypher": "match (:ENTITY{name:'hash function'}) - [:Relationship{name:'expression'}]->(m) return distinct m.name"}, {"query": "Do you know what kind of novels Christina wrote?", "cypher": "match (:ENTITY{name:'\u989c\u6db5_Christina'}) <- [:Relationship{name:' author'}]-(m),(m) - [:Relationship{name:' Chinese name'}]->(p) return distinct p.name limit 1"}, {"query": "Speaking of the six Virgo stars, what is their nationality?", "cypher": "match (:ENTITY{name:' virgin'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' nationality'}]->(n) return m.name, n.name limit 6"}, {"query": "He died on October 8, 1935 (Ethyl year). His name and occupation is?", "cypher": "match (:ENTITY{name:'1935 (((Ethyl) October 8'}) <- [:Relationship{name:'date of death'}]- ((h) - [:Relationship{name:'profession'}]->(m) return distinct h.name, m.name"}, {"query": "What is the shortest relationship path between the two layers of the butterflyfish and the elephant-nosed guyfish?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Pete's butterflyfish'}) - [:Relationship*..2]-(b:ENTITY{name:'Pete's elephant-nosed fish'})) return count ((p)"}, {"query": "The food labels and the food labels are not the only thing that can be used to sell food.", "cypher": "match (:ENTITY{name:'110 outlet'}) - [:Tag{name:'label'}]-> (n) with n order by n.name where n.name <> 'food' return n.name"}, {"query": "The tribal team that is leading the battle is the one that is the most popular.", "cypher": "match (:ENTITY{name:'view'}) <- [:Relationship{name:'team leader'}]- (q) return distinct q.name"}, {"query": "What is the Chinese dramatic vocal range that is close to the southern curve?", "cypher": "match (:ENTITY{name:'Southern Song'}) <- [:Relationship{name:'closest to the South Song'}]-(m), (m) - [:Relationship{name:'type'}]->(n) where n.name='one of the vocal cords' return distinct m.name"}, {"query": "Help me find the five species of pine trees", "cypher": "match (:ENTITY{name:'Pine Tree'}) <- [:Relationship{name:'Pine Tree'}]-(m) return distinct m.name limit 5"}, {"query": "I wonder what the Chinese name of Love You Seven Day is?", "cypher": "match (:ENTITY{name:'Love you seven day'}) <- [:Relationship{name:'foreign language name'}]- ((q) - [:Relationship{name:'Chinese language name'}]->(m) return distinct m.name"}, {"query": "Do you know what subfamily the spider belongs to?", "cypher": "match ((:ENTITY{name:'forked long-spotted spider'}) - [:Relationship{name:'sub-species'}]-> (m) return m.name"}, {"query": "Can you please tell me about the 0.15% of the ingredients of the plant-based herbal medicine called herbal cabinet?", "cypher": "match (:ENTITY{name:'0.15% spinach'}) --(m) with m order by m.name where m.name <> 'spinach' return m.name"}, {"query": "This 0-12 month visual stimulation card: black and white card books, which age group is targeted?", "cypher": "match ((:ENTITY{name:'0-12 months visual stimulation card: black and white card'}) - [:Relationship{name:'reader object'}]-> (m) return m.name"}, {"query": "Do you know which game makes foxes, mages, angels and fairies the main characters?", "cypher": "match (:ENTITY{name:'\u4ee4\u72d0,\u9b54\u5c0a,\u5929\u4f7f,\u7384\u4ed9,'}) <- [:Relationship{name:'main character'}]- (n) return distinct n.name"}, {"query": "What are the businesses of the Hideido Group?", "cypher": "match (:ENTITY{name:'resident group'}) - [:Relationship{name:'subsidiary'}]->(m) return distinct m.name"}, {"query": "Can you write about Kim Ji-young's three most representative works besides the great women are all in the line of duty and the golden years?", "cypher": "match (n:ENTITY{name:'\u91d1\u5fd7'}) - [:Relationship{name:'main works'}]->(h) with h order by h.name where h.name <> 'Great women are obeyed' and h.name <> 'light years' return h.name limit 3"}, {"query": "Can you list some of the trains that are rated as air-conditioned fast?", "cypher": "match (:ENTITY{name:' air conditioning fast'}) <- [:Relationship{name:' train grade'}]- (p) return distinct p.name"}, {"query": "Do you know about the progress of human rights in China in 2009?", "cypher": "match (:ENTITY{name:'Progress in China's human rights case in 2009'}) --(p) with p order by p.name return p.name"}, {"query": "The first Chinese name of the two-faced princess of the Three Kingdoms?", "cypher": "match (:ENTITY{name:'Triple-faced Princess'}) - [:Relationship{name:'Chinese name'}]-> (p) with p order by p.name return p.name limit 1"}, {"query": "Can you please provide the density of NH4 2 SO3?", "cypher": "The name of the function is the same as the name of the function itself."}, {"query": "What kind of jobs do people born in Yangon do?", "cypher": "match (:ENTITY{name:'Anhui Province's Yangon City'}) <- [:Relationship{name:'place of birth'}]- ((h) - [:Relationship{name:'profession'}]->(p) return distinct p.name"}, {"query": "What is the work of this person who is a citizen of the People's Republic of China? Can you name 10?", "cypher": "match (:ENTITY{name:'People's Republic of China'}) <- [:Relationship{name:'nationality'}]- ((h) - [:Relationship{name:'representative work'}]->(p) return h.name skip 1 limit 10"}, {"query": "Can you list two books in simplified Chinese?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What do you know about the drug 4-[4-methacrylate] methylate?", "cypher": "match (:ENTITY{name:'4-[4-methacrylate]methacrylate'}) --(h) with h order by h.name where h.name <> 'drug' return h.name"}, {"query": "What is the name of a parameter that is created in Microsoft SQL Server?", "cypher": "match (:ENTITY{name:'Microsoft SQL Server'}) <- [:Relationship{name:' created in '}]- (h) return h.name"}, {"query": "Can you tell me the 10 career secrets of this man who believes in communism?", "cypher": "match (:ENTITY{name:' Communism'}) <- [:Relationship{name:' faith'}]-(h) - [:Relationship{name:' profession'}]->(n) return n.name order by n.name limit 10"}, {"query": "What is the numerical sequence number of the agent known as methylphenidate in Chinese?", "cypher": "match (:ENTITY{name:'a-threading'}) <- [:Relationship{name:'s Chinese name'}]- (h) return h.name"}, {"query": "What are the names of people born on the same day as Cavichioli Matheus, and what are the labels on each of them?", "cypher": "The following is a list of all the different ways CAVICHIOLI MATHEUS is credited in the database:"}, {"query": "I'm not sure what kind of job a Chinese person would do.", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(h) - [:Relationship{name:'profession'}]->(m) return distinct m.name limit 1 The name of the match is not known."}, {"query": "Ask a 3S overview: What is the term for the world that controls everything?", "cypher": "match (x:ENTITY{name:' will take care of everything in the world'}) <- [:Relationship{name:'3S overview'}] - (p) return p.name"}, {"query": "The book is called The Pity Arrow.", "cypher": "match (:ENTITY{name:'pleased arrow'}) <- [:Relationship{name:'book name'}]- ((n) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "What other departments are there besides the horticulture department at Liaoning Agricultural Vocational Technology College?", "cypher": "match (:ENTITY{name:'Lenin Agricultural Vocational Technology College'}) - [:Relationship{name:'main faculty'}]->(n) where n.name <> 'gardening faculty' return n.name"}, {"query": "Help me find three provincial protection units.", "cypher": "match (:ENTITY{name:'provincial protected unit'}) <- [:Relationship{name:'protection level'}]-(m) return distinct m.name limit 3"}]