[{"query": "Try the big feature label line for the 12.31 Shanghai subway collapse at a parking lot?", "cypher": "match (:ENTITY{name:'12.31 Shanghai subway collapses in construction of a parking lot'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "What do you think I should do except tell my daughter to cry if she can't hold her baby?", "cypher": "match (:ENTITY{name:'You can't take my name'}) - [:Relationship{name:'alias'}]-> (h) with h order by h.name where h.name <> return h.name"}, {"query": "I would like to know what exhibitions are being held in the New International Convention and Exhibition Center in Chengdu, Sichuan.", "cypher": "match (:ENTITY{name:' Sichuan. Chengdu Century City New International Convention and Exhibition Center'}) <- [:Relationship{name:' Held exhibition hall'}]- (q) return q.name"}, {"query": "The book published on 2/1/2002 was published by which publisher?", "cypher": "match (:ENTITY{name:'2002/2/1'}) <- [:Relationship{name:' time of publication'}]-(h),(h) - [:Relationship{name:' publisher'}]->(q) return distinct h.name,q.name"}, {"query": "I just want to know a little bit about this person.", "cypher": "match (:ENTITY{name:'swing'}) --(m) return m.name skip 3"}, {"query": "Help me find two knife fish dishes.", "cypher": "match (:ENTITY{name:' knifefish'}) <- [:Relationship{name:' main ingredient'}]-(m) return distinct m.name limit 2"}, {"query": "He is a medical doctor by training and a member of the Medical Accident Technology Identification Expert Library. He has five other professions.", "cypher": "match (:ENTITY{name:'Relationship{name:'Graduate School'}) <-[:Relationship{name:'Graduate School'}]-(h) -[:Relationship{name:'Major achievement'}]->(q) where q.name <> 'Medicine Accident Technology Identification Expert Member' return distinct q.name limit 5"}, {"query": "Can you tell me about the anatomy of the anterior superior temporal bone? Can you name three?", "cypher": "match (:ENTITY{name:' upper jawbone anterior'}) <- [:Relationship{name:' Chinese name'}]- ((p) - [:Relationship{name:' hollow'}]->(n) return n.name order by n.name limit 3"}, {"query": "The following is a list of some of the most popular works by the author of the book, \"The Little Garden of the Tang Dynasty: The Story of the Little Garden of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Time: The Time: The Time: The Time: The Time: The Time: The Time", "cypher": "match (n:ENTITY{name:'children's garden peaches, occasionally with addiction'}) - [:Relationship*1..2]->(x) where x.name <>'\u5510' return distinct x.name"}, {"query": "Which schools are under the jurisdiction of the Jinjiang District Education Board?", "cypher": "match (:ENTITY{name:'Jinjiang District Education Board'}) <--(m), (m) --(n) where n.name='school' return distinct m.name"}, {"query": "Do you know what Dong Xiao Shu does for a living?", "cypher": "match (:ENTITY{name:'\u8463\u65b0\u8212'}) <- [:Relationship{name:' Chinese name'}]-(m),(m) - [:Relationship{name:' profession'}]->(h) return distinct h.name limit 1"}]