[{"query": "Can you give me an example of five famous alumni of this school? This school is a historic key secondary school in Yao City, the famous secondary school in Yao City, Yang Han Yun Secondary School.", "cypher": "match (q:ENTITY{name:'Yangon City Historic Key Secondary School, Yangon City well-known secondary school, Yang Han\u6e90\u4e00\u4e2d\u3002'}) <-[:Describe{name:'Description'}]-(n) -[:Relationship{name:'Known alumni'}]->(m) return m.name order by m.name limit 5"}, {"query": "Can you tell me if Xinjiang is not the kind of relationship that guests are involved in in the four-tier dream?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:'Xinjiang is not a guest in dreams'}) UNWIND relationships(path) AS rel RETURN rel.name limit 1"}, {"query": "What are the most representative works of people named Guo Gong in Chinese?", "cypher": "match (:ENTITY{name:'consortium'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'representative work'}]->(h) return distinct h.name"}, {"query": "What kind of lyric poems does Li Wei have?", "cypher": "match (:ENTITY{name:'Lee White'}) <- [:Relationship{name:'author'}]-(m), (m) - [:Relationship{name:'body style'}]->(n) where n.name='\u4e50\u5e9c\u8bd7' return m.name"}, {"query": "Is there a book called 100 Gambling Wisdoms and can you find information about it?", "cypher": "match (:ENTITY{name:'100 games of wisdom'}) --(m) with m order by m.name where m.name <> 'books' return m.name"}, {"query": "I'm not sure what the mechanism is for college students to study for two years.", "cypher": "match (:ENTITY{name:' two years of college student'}) <- [:Relationship{name:' called'}]- (p) return p.name"}, {"query": "Can you tell me the names of five Chinese people?", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnicity'}]- ((q) return distinct q.name limit 5"}, {"query": "The following is a list of Chinese people who are known to have been involved in the three-tiered relationship of Wu Medjun:", "cypher": "match (n:ENTITY{name:'\u6b66\u4ef2\u5143'}) - [:Relationship*1..3]->(x) where x.name <>'China' return distinct x.name"}, {"query": "I remember a fire in a closet, and my name is coming up?", "cypher": "match (:ENTITY{name:' closet, lots of clothes'}) <- [:Relationship{name:' clothes'}]- (p) return p.name"}, {"query": "Can you tell me about the five car shows?", "cypher": "match (:ENTITY{name:' car show'}) <- [:Relationship{name:' show type'}]- (x) return x.name limit 5"}, {"query": "Please tell me which one of the most representative works of art is the seduction of the mother: the confessional of a marriage counselor?", "cypher": "match (p:ENTITY{name:'Relationship's a marriage counselor's confession'})"}, {"query": "Do you know which exhibitions are held in Shanghai? Please provide five.", "cypher": "match (:ENTITY{name:' Shanghai'}) <- [:Relationship{name:' Exhibition city'}]- (q) return q.name limit 5"}, {"query": "What are the three jobs that graduates of the Department of Industrial Economics at the People's University of China can do besides being an associate professor at the University of Foreign Trade and Economics?", "cypher": "match (:ENTITY{name:'Industrial Economics Department'}) <- [:Relationship{name:' Graduate School'}]-(q),(q) - [:Relationship{name:' Occupation'}]->(x) where x.name <> 'Associate Professor at the University of Foreign Trade and Economics' return distinct x.name limit 3"}, {"query": "I'm not sure what I'm going to do if I get a job that three British people would do.", "cypher": "match (:ENTITY{name:'UK'}) <- [:Relationship{name:'nationality'}]- ((m) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 3"}, {"query": "Please tell me I'm not there to watch this movie.", "cypher": "match (:ENTITY{name:'Hey I'm not there'}) --(m) return m.name order by m.name limit 5"}, {"query": "Can you get me five books for 10 bucks?", "cypher": "match (:ENTITY{name:'10\u5143'}) <- [:Relationship{name:' priced'}]-(m), (m) - [:Relationship{name:' category'}]->(n) where n.name='report' return m.name limit 5"}, {"query": "The following is a list of the 1st to 3rd level relationships of personal information about Shevchenko S.", "cypher": "match (n:ENTITY{name:'Shevchenko S'}) - [*1..3]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "I'm not sure if I can find a rep for Ben Block.", "cypher": "match (:ENTITY{name:'block'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'representing work'}]->(n) return distinct n.name limit 1"}, {"query": "Do you have a Chinese nickname for the 7th?", "cypher": "match (:ENTITY{name:'Seventh Museum'}) - [:Relationship{name:'Chinese name'}]-> (q) with q order by q.name where q.name <> 'Seventh Museum' return q.name"}, {"query": "What are the publications of the Beijing Language University Press and what are the prices?", "cypher": "match (:ENTITY{name:'Peking Language University Press'}) <- [:Relationship{name:'Publications'}]-(h),(h) - [:Relationship{name:'Pricing'}]->(q) return distinct h.name,q.name"}, {"query": "Who among the actors graduated from China Media University?", "cypher": "match (:ENTITY{name:'China Media University'}) <- [:Relationship{name:'Graduate School'}]-(m), (m) - [:Tag{name:'tag'}]->(n) where n.name='actor' return distinct m.name"}, {"query": "How did I get to be successful and what is the shortest path to the three layers of book enlightenment?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'How did I succeed'}) - [*..3]-(b:ENTITY{name:'the book's path'})) return count ((p)"}, {"query": "Do you know what happened on the night of October 22, 2017?", "cypher": "match (:ENTITY{name:'October 22, 2017 at night'}) <- [:Relationship{name:'time of occurrence'}]- (m) return distinct m.name"}, {"query": "I want to know.", "cypher": "match (:ENTITY{name:'.gs'}) --(m) with m order by m.name return m.name"}, {"query": "I'm not sure what you mean by \"stop\" but I'm not sure what you mean by \"stop\".", "cypher": "match (:ENTITY{name:'\u7136\u800c\u6b62'}) <- [:Relationship{name:'Chinese name'}]- ((n) - [:Relationship{name:'translated'}]->(q) return distinct q.name"}, {"query": "Please tell me what content awards are included in the selection, including the Business Awards, Innovation Awards, and the People of the Cloud Awards?", "cypher": "match (:ENTITY{name:' enterprise award, innovation product, figure of the cloud'}) <- [:Relationship{name:' award'}]- (p) return distinct p.name"}, {"query": "Do you have any information about the two-tiered relationship involved in the NPC?", "cypher": "The following pages link to The Unknown:"}, {"query": "Is 2-methylbenzene safe to be used in five knowledge points?", "cypher": "match (:ENTITY{name:'2-methacrylate and methyl methacrylate'}) --(q) with q order by q.name return q.name limit 5"}, {"query": "What is the name of the film written by Liu Xiaobo?", "cypher": "Match (:ENTITY{name:'Relationship{name:'writer'}]- (n) return distinct n.name"}, {"query": "The 09MND cold-pressed steel pipe we developed is mainly used for what?", "cypher": "match ((:ENTITY{name:'09MND cold-pressure steel pipe'}) - [:Relationship{name:'use'}]-> (n) return n.name"}, {"query": "There is a scientific category for 00Cr17Ni12Mo2, what else do you know about it?", "cypher": "match (:ENTITY{name:'00Cr17Ni12Mo2'}) --(h) with h order by h.name where h.name <> 'science' return h.name"}, {"query": "Can you describe this person, what are his labels?", "cypher": "The name of the game is the same as the name of the game itself. The name of the game is the same as the name of the game itself."}, {"query": "Do you know what chemical is C5H7N?", "cypher": "match (:ENTITY{name:'C5H7 N'}) <- [:Relationship{name:'molecular'}]- (m) return distinct m.name"}, {"query": "I'm interested in three things.", "cypher": "match (:ENTITY{name:' diamond pencil tip award'}) --(q) return distinct q.name limit 3"}, {"query": "Can you tell me how many companies that offer exhibition services you know about?", "cypher": "match (:ENTITY{name:' exhibition services'}) <- [:Relationship{name:' business scope'}]- (x) return x.name limit 5"}, {"query": "Which of Charles Edward Barber's works is the Barber 10 and Barber 25?", "cypher": "match (n:ENTITY{name:'Charles Edward Barber'}) - [:Relationship{name:'represents works'}]->(h) where h.name <> 'Barber 10 cents' and h.name <> 'Barber 25 cents' return distinct h.name limit 1"}, {"query": "Can you tell me about 10 incidents of fire?", "cypher": "match (:ENTITY{name:'fire'}) <- [:Relationship{name:'event type'}]- (p) return p.name limit 10"}, {"query": "Do you know the Chinese Hong Kong film distributor for the film Generation Flowers?", "cypher": "match ((:ENTITY{name:'a generation of names'}) - [:Relationship{name:'a company of issuers'}]-> (p) return p.name"}, {"query": "Can you describe in one sentence the E-6-sub-alkyl-1,3-dimethyl-dihydroxy-2-,4-,1-H,3H-dihydroxy?", "cypher": "match (:ENTITY{name:'1.18 Hebei County Tang District Fireworks Bombing Accident'}) --(q) with q order by q.name return distinct q.name skip 1 limit 1"}, {"query": "What does it mean to break the boundaries?", "cypher": "match (:ENTITY{name:'delimitation'}) - [:Relationship{name:'interpretation'}]-> (m) return distinct m.name"}, {"query": "The first thing I want to do is to find out about the four-tiered relationship between the mainstream and the small-town cucumbers.", "cypher": "match (n:ENTITY{name:'squirt'}) - [*1..4]->(x) where x.name <>'squirt, piss too much' return distinct x.name"}, {"query": "How many versions of the software can you tell me about? What is the size of the software? How many people have downloaded it?", "cypher": "match (:ENTITY{name:'Relationship{name:'software version'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'software size'}) ->(m) return m.name as name union all match (:ENTITY{name:'Relationship{name:'downloads'}) ->r) return r.name as name"}, {"query": "What is the name of the relationship involved in the 5th floor of the Guangzhou Samsung Decoration Company?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Guangzhou Samsung Decoration Co. '}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 5"}, {"query": "What college did you graduate from?", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'Graduate school'}]->(n) return distinct n.name"}, {"query": "The problem is that you mention two labels of the Psychological Association of the Hubei Vocational Institute of Technology, but not universities and education.", "cypher": "match (n:ENTITY{name:'Psychological Association of Hubei Vocational Institute of Technology'}) - [:Tag{name:'tag'}]->(h) with h order by h.name where h.name <> 'university' and h.name <> 'education' return h.name limit 2"}, {"query": "What books are there in the history class? Can you help me find two?", "cypher": "The following is a list of the most commonly used tags in the history of the world."}, {"query": "Do you know what regulations were approved on July 27, 2014?", "cypher": "match (:ENTITY{name:'July 27, 2014'}) <- [:Relationship{name:'approved date'}]- (p) return distinct p.name"}, {"query": "Who wrote the film Pearl of Great Price and what is its genre?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'writer'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'type'}]->(m) return m.name as name"}, {"query": "Do you know what chemical has CAS number 313223-00-6?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "The name of a work is called Seven O'Clock Faces, and what is the name of the other one?", "cypher": "match (:ENTITY{name:'seven o'clock face'}) <- [:Relationship{name:'work alias'}]- (x) return x.name"}, {"query": "Who was the first education minister of the National Government?", "cypher": "match (:ENTITY{name:'first Minister of Education'}) <- [:Relationship{name:'main achievements'}]- ((m), (m) - [:Relationship{name:'place of birth'}]->(n) return m.name, n.name"}, {"query": "Do you know how many exhibitions are in Guangzhou, China?", "cypher": "match (:ENTITY{name:'China Guangzhou'}) <- [:Relationship{name:'Exhibition city'}]- (n) return n.name limit 12"}, {"query": "Please help me find out the scope of the Media.", "cypher": "match (:ENTITY{name:'Media'}) - [:Relationship{name:'Scope of operations'}]->(m) return distinct m.name"}, {"query": "What is the full name of OPML?", "cypher": "match (:ENTITY{name:'OPML'}) - [:Relationship{name:'Chinese name'}]-> (m) return distinct m.name"}, {"query": "Can you tell me about the exhibition in Jinan?", "cypher": "match (:ENTITY{name:'Jinan'}) <- [:Relationship{name:'Showcase city'}]- (m) return m.name"}, {"query": "What was the NBA shutdown of 1964?", "cypher": "match ((:ENTITY{name:'1964 NBA suspension'}) - [:Relationship{name:'event'}]-> (n) return n.name"}, {"query": "What is the Chinese name for a man named Ye-Ye-Ye-Ye-Ye?", "cypher": "match (:ENTITY{name:'Yule'}) <- [:Relationship{name:'Chinese name'}]- ((p),(p) - [:Relationship{name:'profession'}]->(m) return distinct m.name"}, {"query": "Which film won the Special Contribution Award at the 24th Golden Globe Film Festival?", "cypher": "match (:ENTITY{name:'24th Golden Raspberry Film Festival Special Contribution Award'}) <- [:Relationship{name:'main award'}]- (m) return distinct m.name"}, {"query": "The following is a list of the top 10 most popular websites in the world, ranked by the number of people who have visited the site:", "cypher": "match (n:ENTITY{name:'Calull Marc'}) - [:Relationship*1..3]->(x) where x.name <>'1.73 m' return distinct x.name"}, {"query": "Is there any other information about the river besides the Yellow River Water Press?", "cypher": "match (:ENTITY{name:'Waterfall'}) --(m) with m order by m.name where m.name <> 'Waterfall' return distinct m.name limit 4"}, {"query": "What is the shortest distance between Nakin Village and Mantai Village on the second floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Najin village'}) - [*..2]-(b:ENTITY{name:'Man\u5c3e\u6751'})) return count ((p)"}, {"query": "Three pieces of information about 0-1 year old science feeding?", "cypher": "match (x:ENTITY{name:'0-1 years of scientific feeding'}) --(q) with q order by q.name return q.name limit 3"}, {"query": "What other names are there for people of Chinese ethnicity, list three?", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(m),(m) - [:Relationship{name:'othername'}]->(q) return distinct q.name limit 3"}, {"query": "The following literary works are in the context of the two-tier relationship between Snow Revival and the events of the 18th and 19th of this month.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <> 'literature' return distinct x.name"}, {"query": "The film directed by Lee Min Hoon, Lee Seung-Foo, won the KBS Acting Award for Best Actress and the other awards for which she won.", "cypher": "match (:ENTITY{name:'Lee Min Hoon, Lee Si Fu'}) <- [:Relationship{name:'director'}]-(x) - [:Relationship{name:'main award'}]->(m) where m.name <> 'KBS acting award for best actress award Zhang Nara' return distinct m.name limit 10"}, {"query": "Tell me about the two-tier relationship between the organization and Shanghai Shengyuan Intelligent Technology Co., Ltd.", "cypher": "match (n:ENTITY{name:'Shanghai Traveling Intelligent Technology Co. Ltd'}) - [*1..2]->(x) where x.name<>'organization' return distinct x.name"}, {"query": "Do you want to find a literary work, close your eyes, and embrace the message of your two-tiered relationship?", "cypher": "match (n:ENTITY{name:'close your eyes, hug you'}) - [*1..2]->(x) where x.name <>'literary work' return distinct x.name"}, {"query": "What is the price of the three books published by Jiangsu Sheng Art Publishing House?", "cypher": "match (:ENTITY{name:'Jiangsu Yang Art Publishing House'}) <- [*]-(m),(m) - [:Relationship{name:'Price'}]->(n) return m.name,n.name limit 10"}, {"query": "When is the date of publication of this new edition of the 2011 Shandong Provincial Civil Servants Recruitment Examination Special Materials Statement?", "cypher": "match ((x:ENTITY{name:'2011 new edition Shandong Province civil servant recruitment exam special material statement'}) - [:Relationship{name:'published date'}]-> (m) return m.name"}, {"query": "The book was published in the United States by the publisher of The King's Glory.", "cypher": "match (:ENTITY{name:'King Glory \u7f16'}) <- [:Relationship{name:'author'}]- ((n) - [:Relationship{name:'publisher'}]->(q) return distinct q.name limit 2"}, {"query": "Do you know when Three Stone was founded?", "cypher": "match (p:ENTITY{name:'Six Stone Company'}) return p.time The name of the match is"}, {"query": "What is the theme of the 2012 Chinese Higher Education Design Art Competition?", "cypher": "match ((:ENTITY{name:'2012 First Chinese Higher Education Institute Design Art Competition'}) - [:Relationship{name:'Contest theme'}]-> (q) return q.name"}, {"query": "The examples of Gardner's representative works are given here.", "cypher": "match (:ENTITY{name:'Gardner'}) - [:Relationship{name:'represents work'}]-> (p) return distinct p.name"}, {"query": "The following is a list of information about the relationship between the two sides of the Shining, who is a Chinese police officer.", "cypher": "match (n:ENTITY{name:'\u76db\u96ea'}) - [:Relationship*1..2]->(x) where x.name <>'Chinese police' return distinct x.name"}, {"query": "What are the labels of the current historical events 1.3 Fukushima high-speed auto accidents?", "cypher": "match (:ENTITY{name:'1.3 Kwin Tong High-Speed Accident'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'contemporary historical event' return q.name limit 10"}, {"query": "Do you know the name of the author whose work is the capture of the geometrical geometry of the geometrical features of the random number problem?", "cypher": "match (n:ENTITY{name:'capture the structure of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays of the arrays"}, {"query": "What is the profession of a cook?", "cypher": "match (h:ENTITY{name:'\u82b8'}) <--(m) -[:Relationship{name:'profession'}]->(x) return distinct x.name limit 1"}, {"query": "Can you tell me which authors weighing 66 kg have representative works?", "cypher": "match (:ENTITY{name:'66'}) <- [:Relationship{name:'weight'}]- ((q),(q) - [:Relationship{name:'represents work'}]->(p) return distinct p.name"}, {"query": "Tell us about the main achievements of Noi Bussakorn, the top 5 lines?", "cypher": "match (:ENTITY{name:'Noi Bussakorn'}) - [:Relationship{name:'main achievement'}]-> (p) return p.name order by p.name limit 5"}, {"query": "Did you find any relevant information about the eight other Desperate Baby titles besides the comic book?", "cypher": "match (:ENTITY{name:'desperate baby'}) --(m) with m order by m.name where m.name <> 'comic' return distinct m.name limit 8"}, {"query": "Please give me 10 facts about fantasy novels.", "cypher": "match (:ENTITY{name:' fantasy fiction'}) --(n) return n.name order by n.name limit 10"}, {"query": "I'm not sure there are any books that say that women should be better off with their clothes on.", "cypher": "match (n:ENTITY{name:'Women are better off with spit'}) where n is not null return 1"}, {"query": "Can you recommend 8 books for $30?", "cypher": "The value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value of the value"}, {"query": "Where are the main green pillar production sites?", "cypher": "match (:ENTITY{name:' green pillar'}) - [:Relationship{name:' major mineral'}]-> (m) return distinct m.name"}, {"query": "What is the genus of the Yunnan winged tree?", "cypher": "match (:ENTITY{name:' Yunnan wing tree'}) - [:Relationship{name:' branch'}]->(m) return distinct m.name"}, {"query": "Do you know what government reports the government has?", "cypher": "match (:ENTITY{name:'government report'}) <- [:Relationship{name:'file type'}]- (n) return distinct n.name"}, {"query": "What were the final results of the 1894 Hong Kong Plague reported in the newspapers?", "cypher": "match ((:ENTITY{name:'1894 Hong Kong plague'}) - [:Relationship{name:'results'}]-> (x) return x.name"}, {"query": "Can you find out the names of the three members of the Association of Artists of Liaoning Province?", "cypher": "match (:ENTITY{name:'Member of the Association of Artists of Liaoning Province'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'date of birth'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Can you tell me how long it has been since there were no casualties?", "cypher": "match (:ENTITY{name:' none'}) <- [:Relationship{name:' casualties'}]- (m) return m.name limit 5"}, {"query": "Tell me about the 2003 Autumn High School World's Modern History book?", "cypher": "match (:ENTITY{name:'03 autumn high school world modern history book'}) --(m) with m order by m.name return m.name"}, {"query": "Is there a work of art written by the stone root? Can you tell me three?", "cypher": "match (:ENTITY{name:'Pyramid'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'representative work'}]->(h) return distinct h.name limit 3"}, {"query": "Do you remember the name of one of the accidents that killed 1 and injured 14 people?", "cypher": "match (:ENTITY{name:'1 dead, 14 wounded'}) <- [:Relationship{name:'accidentally injured'}]- (h) return distinct h.name"}, {"query": "So let me do the equation for the line.", "cypher": "match (:ENTITY{name:'linear surface'}) - [:Relationship{name:'equation'}]-> (m) return distinct m.name"}, {"query": "Have you any information that I can give you?", "cypher": "match (q:ENTITY{name:'\u6881\u575a'}) --(x) return distinct x.name limit 1"}, {"query": "What is the postal code of Pingu, Zhejiang?", "cypher": "Match (:ENTITY{name:'036800'}) <- [:Relationship{name:'Pingru postcode'}]- (p) return p.name"}, {"query": "The price of a ticket to the Qianlong Wall [Beijing Palace Shadow Wall] is how much?", "cypher": "match ((:ENTITY{name:'Kyunlong wall [Beijing's former palace shadow wall]'}) - [:Relationship{name:'ticket price'}]-> (n) return n.name"}, {"query": "Please tell me 10 of the main achievements of this celebrity, whose most representative work is the rap and theater art overview.", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship's name: 'representative work'}]- ((q) - [Relationship's name: 'main achievement'}]->(p) return p.name order by p.name limit 10"}, {"query": "What are the publications of the Economic Science Press? When are they published? Could you give me a list of five?", "cypher": "match (:ENTITY{name:' Economic Science Publishing'}) <- [:Relationship{name:' Economic Science Publishing'}]- ((h),(h) - [:Relationship{name:' Publishing time'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "I would like to know what is the content of the old work on the relationship between the three layers of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the old house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of the new house of", "cypher": "match (n:ENTITY{name:'Visiting the old'}) - [*1..3]->(x) where x.name <>'return' return distinct x.name"}, {"query": "What albums have been released in Japan? Can you recommend 5?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'Region of release'}]- (p) return p.name limit 5"}, {"query": "Can you tell us who is the author of the book, and what era and genre it was written in?", "cypher": "Match (:ENTITY{name:'Cold War'}) - [:Relationship{name:'Author'}]->(n) return n.name as name union all match (:ENTITY{name:'Cold War'}) - [:Relationship{name:'Years'}->(m) return m.name as name union all match (:ENTITY{name:'Cold War'}) - [:Relationship{name:'Body Style'}->(r) return r.name as name"}, {"query": "The company is based in the Eastern District of Beijing and is headed by the Eastern District Justice Department. Please help me find out about three more of these law firms.", "cypher": "match (n:ENTITY{name:'Beijing City Nine\u4f17\u5f8b\u5e08\u4e8b\u52a1\u6240'}) -->(h) with h order by h.name where h.name <> 'East City' and h.name <> 'East City Justice Department' return h.name limit 3"}, {"query": "The known 2-methylmethacrylate is a scientific category, can you tell us more about it?", "cypher": "match (:ENTITY{name:'2-methyl methacrylate methane'}) --(q) with q order by q.name where q.name <> 'science' return q.name"}, {"query": "Can you tell me about the first five descriptions of the Blue Lotus from the other side?", "cypher": "match (:ENTITY{name:'Beyond the Blue Lotus'}) --(h) with h order by h.name return h.name limit 5"}, {"query": "The Chinese Academy of Astronautics' 2009 Academic Annual Report is available in various formats.", "cypher": "match (:ENTITY{name:'2009 Chinese Academy of Astronautics Academic Annual Paper Collection'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "Can you find me all the labels for the 0-3 year old baby's Intelligent Enlightenment training?", "cypher": "match (:ENTITY{name:'0-3 years old baby intelligent enlightenment training'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "What other names are there for this place that costs 10 yuan? Can you name five?", "cypher": "match (:ENTITY{name:'10.00'}) <- [:Relationship{name:'ticket price'}]-(p),(p) - [:Relationship{name:'alias'}]->(h) return h.name order by h.name limit 5"}, {"query": "Can you recommend 10 books published in 2013-11?", "cypher": "match (:ENTITY{name:'2013-11'}) <- [:Relationship{name:' time of publication'}]- (q) return q.name limit 10"}, {"query": "Find out what kind of books are in the six books.", "cypher": "match (:ENTITY{name:'exam book'}) <--(m), (m) - [:Relationship{name:'type'}]->(n) return m.name, n.name limit 6"}, {"query": "Can you find me three public universities?", "cypher": "match (:ENTITY{name:'public office university'}) <- [:Relationship{name:' category'}]-(p) - [:Relationship{name:' Chinese name'}]->(n) return distinct n.name limit 3"}, {"query": "I recommend 5 episodes of 20 episodes or so on YouTube.", "cypher": "match (:ENTITY{name:'Unicode'}) <- [:Relationship{name:'online play platform'}]-(n),(n) - [:Relationship{name:'set'}]->(x) where x.name <> '20 episodes' return distinct x.name limit 5"}, {"query": "The article is about the two-tiered relationship between the captain of the Red Guard and the captain of the Malaya Red Guard.", "cypher": "match (n:ENTITY{name:'paragraph has meaning'}) - [:Relationship*1..2]->(x) where x.name <>'Captain of the Red Guard' return distinct x.name"}, {"query": "Do you know what Chen Meiyu's profession is?", "cypher": "match (:ENTITY{name:'Chen Mei'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 1"}, {"query": "Can you tell me the message of the beauty queen of the sunshine state?", "cypher": "match (:ENTITY{name:'Miss Sunshine'}) --(p) return p.name order by p.name limit 5"}, {"query": "The first thing I want to know is what is the name of the restaurant that sells the apple egg sandwich?", "cypher": "match (n:ENTITY{name:'Apple egg sandwich'}) - [:Relationship*]->(x) where x.name<>'food' return distinct x.name"}]