[{"query": "Who is this person? What are some of his representative works? Can you tell me a good one?", "cypher": "match (:ENTITY{name:'1981 graduated from China Drama Academy, majoring in acting and directing\u3002'}) <- [:Describe{name:'description'}]-(x),(x) - [:Relationship{name:'main work'}]->(m) return x.name,m.name skip 1 limit 1"}, {"query": "I would like to attend the 2012 China Shanghai Fiberglass Printing Expo, can you tell me where?", "cypher": "match ((:ENTITY{name:'2012 China Shanghai Sewing Printing Exhibition'}) - [:Relationship{name:' Location of the Exhibition'}]-> (p) return p.name"}, {"query": "The first is to find out all the aliases of the blood-roots.", "cypher": "match (:ENTITY{name:' blood root'}) <- [:Relationship{name:' alias'}]- (x) return x.name order by x.name"}, {"query": "Give me five Taekwondo athletes to name their representative works.", "cypher": "match (:ENTITY{name:'Arctic athlete'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'represents work'}]->(n) return m.name,n.name limit 5"}, {"query": "Can you tell me how many people have been in the movie \"The Big Bang Theory\" by Choi Ma Bollie?", "cypher": "match (:ENTITY{name:'Mary Poppins's Big Movie'}) --(n) return n.name order by n.name"}, {"query": "Where is the site of the 1/15 Riverside Bridge Bombing reported in the news?", "cypher": "match ((:ENTITY{name:'1\u00b715 Jadu Jadu Bridge Town explosion incident'}) - [:Relationship{name:'location'}]-> (p) return p.name"}, {"query": "Do you know what the name of this person, whose real name is Gao Minhan, is?", "cypher": "match (:ENTITY{name:'Kang'}) <- [:Relationship{name:'original name'}]-(n),(n) - [:Relationship{name:'word number'}]->(q) return q.name order by q.name limit 10"}, {"query": "The exhibition is being held in the city of Gdansk, which is located in the city of Gdansk.", "cypher": "match (:ENTITY{name:'180,000 square meters'}) <- [:Relationship{name:'area of the venue'}]- (x) return x.name"}, {"query": "What is the profession and representative work of Chopra?", "cypher": "match (:ENTITY{name:'Relationship{name:'profession'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'representative work'}) ->(m) return m.name as name"}, {"query": "Can you find two other Indian ice cream related to the simulation game?", "cypher": "match (:ENTITY{name:' Indian ice cream'}) --(m) with m order by m.name where m.name <> ' simulation game' return distinct m.name limit 2"}, {"query": "Can you tell us about the date of his birth, where he graduated from college and what he does now?", "cypher": "Match (:ENTITY{name:'Types'}) - [:Relationship{name:'Birthdate'}]->(n) return n.name as name union all match (:ENTITY{name:'Types'}) - [:Relationship{name:'Graduate School'}]->(m) return m.name as name union all match (:ENTITY{name:'Types'}) - [:Relationship{name:'Profession'}->(r) return r.name as name"}, {"query": "How much do you know about the 1943 version of the web game Invincible?", "cypher": "match (:ENTITY{name:'1943 Unrivaled'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'web game' return h.name"}, {"query": "Can you find the three books published by the Yue-Yue Book Company?", "cypher": "match (:ENTITY{name:'\u5cb3\u66f8\u793e'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'Price'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Name three schools that have established the School of Economic Management.", "cypher": "match (:ENTITY{name:' School of Business and Management'}) --(x) return distinct x.name limit 3"}, {"query": "What is the name of the phrase that describes the very indignant flag of the state of Zhongshan?", "cypher": "match (:ENTITY{name:'described as very angry'}) <- [:Relationship{name:'definition'}]-(m), (m) - [:Relationship{name:'outcome'}]->(n) where n.name='Relationship' return distinct m.name"}, {"query": "Please name the top 5 schools that have been selected as the best schools in the Karaganda language.", "cypher": "match (:ENTITY{name:'Karangal language text sample curriculum vitae'}) --(h) return h.name order by h.name limit 5"}, {"query": "What chemical has a molecular weight of 574.9215?", "cypher": "The name of the function is the name of the function itself."}, {"query": "What are the labeling characteristics of D-Glycerol?", "cypher": "match (:ENTITY{name:'D-butadiene glycoside'}) - [:Tag{name:'label'}]-> (p) with p order by p.name where p.name <> 'discipline' return p.name"}, {"query": "The accident in Hubei caused traffic jams, what's your name?", "cypher": "match (:ENTITY{name:' traffic incident'}) <- [:Relationship{name:' cause'}]- (h) return h.name"}, {"query": "Help me find five plants that are under the sub-plant protection.", "cypher": "match (:ENTITY{name:' by sub-plant gate'}) --(x) return x.name limit 5"}, {"query": "The latest news on 007 Defenders 2?", "cypher": "match (:ENTITY{name:'007 Protector 2'}) --(p) with p order by p.name return p.name limit 10"}, {"query": "Give me five athletes, what are their sports programs?", "cypher": "match (:ENTITY{name:' athlete'}) <- [*]-(m), (m) - [:Relationship{name:' athlete'}]->(n) return m.name, n.name limit 5"}, {"query": "0991 Part-time bar has any related tags?", "cypher": "match (:ENTITY{name:'0991 part-time'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "What is the shortest relationship path between the level B fire door and the level 2 fire door?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'B-level firewall'}) -[:Relationship*..2]-(b:ENTITY{name:'B-level firewall'})) return count ((p)"}, {"query": "Do you know the Chinese name of the China Brand Innovation and Development Project?", "cypher": "match (:ENTITY{name:'China Brand Innovation And Development Project'}) <- [:Relationship{name:'foreign language name'}]- ((n) - [:Relationship{name:'Chinese language name'}]->(m) return distinct m.name"}, {"query": "Do you know where all the Chinese granite is located in our country?", "cypher": "match (:ENTITY{name:'China-origin granite'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Relationship{name:'origin'}]->(h) return distinct h.name"}, {"query": "What is the adoption unit of the statute of the Henan Chamber of Commerce in Xuzhou City? When was it adopted? When was it implemented?", "cypher": "match (:ENTITY{name:'Relationship{name:' by unit'}) ->(n) return n.name as name union all match (:ENTITY{name:' by time'}) -[:Relationship{name:' by time'}->(m) return m.name as name union all match (:ENTITY{name:' by unit'}) -[:Relationship{name:' by time'}]-(r) return r.name as name"}, {"query": "Please tell me the details of the 12-14 Jinjiang high-speed chase.", "cypher": "match (:ENTITY{name:'12\u00b714 Jidenan high-speed chase accident'}) --(p) with p order by p.name return p.name"}, {"query": "I'm wondering now what kind of relationships are involved on the two-level campus of the University of Inner China?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'\u534e\u5de5\u6821\u56ed\u901a'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "I wonder if you know which ones are related to the second level of labels and transportation facilities?", "cypher": "match (n) - [:Tag*2{name:'tag'}]->(p:ENTITY{name:'traffic facility'}) return distinct n.name limit 2"}, {"query": "Please tell me the name of the case that happened at 10am on July 1, 2015.", "cypher": "match (:ENTITY{name:'July 1, 2015 at 10 am'}) <- [:Relationship{name:'time'}]- (x) return distinct x.name"}, {"query": "Do you know which district belongs to Songjiang Town?", "cypher": "match (:ENTITY{name:'Mong-Chiang Town'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'Affiliated political district'}]->(n) return distinct n.name"}, {"query": "I don't know the taste of this food and where it comes from, you know?", "cypher": "match (:ENTITY{name:'salt carbon tofu'}) - [:Relationship{name:'taste'}]->(n) return n.name as name union all match (:ENTITY{name:'salt carbon tofu'}) - [:Relationship{name:'source'}]->(m) return m.name as name"}, {"query": "Do you know what are the symptoms of sleepiness and behavioral abnormalities and which groups are more common?", "cypher": "match (:ENTITY{name:'sleepiness, greed and behavioral abnormalities'}) <- [*]-(m), (m) - [:Relationship{name:'multiple hair groups'}]->(n) return m.name, n.name"}, {"query": "The most common type of sheet is the MPa \u2265 280", "cypher": "match (:ENTITY{name:'\u2265280'}) <- [:Relationship{name:' yield strength Mpa'}]- (x) return distinct x.name"}, {"query": "What is the name of the play by Chan Paes?", "cypher": "match (:ENTITY{name:' Chen Pei, Flum, Wang Jing, Liu Qian, Liu Jun, Zhu Jun'}) <- [:Relationship{name:' starring'}]-(m), (m) - [:Relationship{name:' type'}]->(n) where n.name='speech drama' return distinct m.name"}, {"query": "I want to know about this game of 15 puzzles.", "cypher": "match (:ENTITY{name:'15 puzzle'}) --(n) with n order by n.name where n.name <> 'game' return n.name"}, {"query": "The first phase of a campaign was a personal information campaign from May 13 to June 12, called \"Anonymous\".", "cypher": "match (:ENTITY{name:'May 13 to June 12, personal information promotion'}) <- [:Relationship{name:' first stage'}]- (q) return q.name"}, {"query": "Do you know what is the third layer of the label relationship with Concordola?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Concordora'}) return distinct n.name limit 1 The name of the game is the same as the name of the game itself."}, {"query": "What profession does a person born on June 18 have besides singing?", "cypher": "match (:ENTITY{name:'(calendar) June 18th'}) <- [:Relationship{name:'date of birth'}]-(p) - [:Relationship{name:'profession'}]->(q) where q.name <> 'singer' return distinct q.name limit 1"}, {"query": "You know that citizenship is outside China, and that's 8 information in the 4th tier of the military.", "cypher": "match (:ENTITY{name:'\u82b1\u4e8c\u519b'}) -[*1..4]-(p) where p.name <> 'China' return distinct p.name limit 8"}, {"query": "Can you tell me more about him, knowing that 119 is an organization?", "cypher": "match (:ENTITY{name:'119 band'}) --(p) with p order by p.name where p.name <> 'organization' return p.name"}, {"query": "Can you name three people born in October 1979?", "cypher": "match (:ENTITY{name:'October 1979'}) <- [:Relationship{name:'date of birth'}]- (m) return m.name limit 3"}, {"query": "And tell me about the three 10,000 things you know about?", "cypher": "match (:ENTITY{name:'10000 know'}) --(h) with h order by h.name return h.name limit 3"}, {"query": "What does it mean to be poor? Where did it come from?", "cypher": "match (:ENTITY{name:'square'}) - [:Relationship{name:'square'}] ->(n) return n.name as name union all match (:ENTITY{name:'square'}) - [:Relationship{name:'square'}] ->(m) return m.name as name"}, {"query": "I'm not sure what the name of the land is that has a family-owned farm.", "cypher": "Match (:ENTITY{name:'Relationship{name:'Tribalism'}}) <- [:Relationship{name:'Tribalism'}]- (p) return p.name"}, {"query": "Please tell me where is the address of the Shenzhen Mountain Apartment Hotel?", "cypher": "match (x:ENTITY{name:'Shenzhen Yantai Water Apartment Hotel'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'address'}]->(h) return distinct h.name"}, {"query": "I'm going to ask you about the personal situation of this person Mouny Loic in his two-tier relationship.", "cypher": "match (n:ENTITY{name:'Mouny Loic'}) - [:Relationship*1..2]->(x) where x.name<>'person' return distinct x.name"}, {"query": "Do you know what kind of art is there?", "cypher": "match (:ENTITY{name:'Relationship{name:'author'}]- (m) return m.name"}, {"query": "Can you tell me what the 5th level tag has to do with football?", "cypher": "Match (n) - [:Tag*5{name:'tag'}]->(p:ENTITY{name:'football'}) RETURN distinct n.name"}, {"query": "I'm not sure if you can tell me the details of the four levels of relationship between Kim Jong-un and the five Korean nationals.", "cypher": "match (n:ENTITY{name:'\u00b7'}) - [*1..4]->(x) where x.name<>'Korea' return distinct x.name limit 5"}, {"query": "What does this man, nicknamed Angko, have to represent in his work?", "cypher": "match (:ENTITY{name:'sister'}) <- [:Relationship{name:'sister'}]-(m),(m) - [:Relationship{name:'sister'}]->(h) return h.name order by h.name limit 10"}, {"query": "I'm not sure if you can tell me how to get the information to the net for the sum of 0750 returns.", "cypher": "match (:ENTITY{name:'0750 return net'}) --(p) with p order by p.name return p.name"}, {"query": "What is the name of the suspect in the Hunan case who was beaten to death?", "cypher": "match (:ENTITY{name:' current hit'}) <- [:Relationship{name:' result'}]- (m) return m.name"}, {"query": "I would like to know what are the main achievements of Xu Dejie?", "cypher": "match (:ENTITY{name:' Xu De Ge'}) <- [:Relationship{name:' Chinese name'}]- ((q) - [:Relationship{name:' major achievements'}]->(x) return x.name skip 1 limit 10"}, {"query": "The teacher asked us about the molecular weight of the sodium dihydrate dihydrate, can you tell me?", "cypher": "match ((:ENTITY{name:' for the nitric oxide monosodium'}) - [:Relationship{name:' molecular weight'}]-> (m) return m.name"}, {"query": "In addition to 42 bucks for one book, find out 6 more about me in this book by Bumblebee Jun.", "cypher": "match (n:ENTITY{name:'I am the day of the future'}) -->(h) with h order by h.name where h.name <> '42\u5143' and h.name <> '\u718a\u57f9\u4e91' return h.name limit 6"}, {"query": "Do you know Laurent Ban? Please tell me about him.", "cypher": "match (:ENTITY{name:'Laurent Ban'}) --(m) return m.name skip 1 The name of the game is the same as the name of the game"}, {"query": "How about a summary of his work in no more than five sentences?", "cypher": "match (:ENTITY{name:'Tasoran'}) --(q) with q order by q.name return q.name limit 5"}, {"query": "What is the shortest path of one of the five layers of the American science fiction film heterogeneity versus heterogeneity 2?", "cypher": "The title of the film is a reference to the fact that the film is based on the novel of the same name by the same name."}, {"query": "The meeting of the 28th session of the 6th People's Congress of Meizhou, chaired by five Huang Qian, is good?", "cypher": "match (n:ENTITY{name:'Twenty-eighth meeting of the Sixth People's Congress of Meiju City'}) - [*]->(x) where x.name <>'Huangqiang' return distinct x.name limit 5"}, {"query": "I need a literary work that is a metaphor for the two-tiered relationship between the Eastern military and the work of the presentation.", "cypher": "match (n:ENTITY{name:'for example Eastern Army'}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "The main characters of the 2015 Japanese film \"Coffee by the Sea\" [Sozumi-Sohmi, starring Yuna B\u014dmei] are:", "cypher": "match (n:ENTITY{name:'Coffee House by the Sea' [Japanese 2015 film starring Yoko Ono, Satsuki]'}) - [:Relationship{name:'Satsuki'}]->(h) where h.name <> 'Satsuki' and h.name <> 'Satsuki' return distinct h.name limit 2"}, {"query": "What is the shortest path between the two levels of the museum and archaeology majors?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' museum science'}) - [:Relationship*..2]-(b:ENTITY{name:' archaeology science'})) return count ((p)"}, {"query": "Can you list some of the most representative works of the jurists?", "cypher": "match (:ENTITY{name:'jurist'}) <- [:Relationship{name:'profession'}]- ((q) - [:Relationship{name:'representative work'}]->(x) return distinct x.name"}, {"query": "Do you know which schools are green?", "cypher": "match (:ENTITY{name:' green school'}) --(h) return h.name skip 5"}, {"query": "What clinic should I go to for postpartum depression?", "cypher": "match (:ENTITY{name:'postpartum depression'}) - [:Relationship{name:'inpatient ward'}]->(m) return distinct m.name"}, {"query": "The following three characters in the two-tier relationship of Amorim?", "cypher": "The following is a list of all the different ways Unwind is credited in the database:"}, {"query": "Can you show me the show time of the 13th Shanghai International Machine Tool Expo 2011?", "cypher": "match ((:ENTITY{name:'2011 13th Shanghai International Machine Tool Exhibition'}) - [:Relationship{name:'exhibition time'}]-> (n) return n.name"}, {"query": "What is the shortest path between the Orange and German tides in the 3rd layer?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'orange tide'}) - [*..3]-(b:ENTITY{name:'German tide'})) return count ((p)"}, {"query": "The organization is a four-tiered organization, with a four-tiered relationship to the Chennai South Railway Volunteer Service Station.", "cypher": "match (n:ENTITY{name:'Chengdu South Station Volunteer Service Station'}) - [*1..4]->(x) where x.name <> 'organizing agency' return distinct x.name"}, {"query": "I would like to know the other 4 information on this sports project on the second level of the snowstorm.", "cypher": "match (:ENTITY{name:' snowstorm'}) - [:Relationship*1..2]-(p) where p.name <> 'sports project' return p.name limit 4"}, {"query": "The first Chinese name of the out-of-towner in Guangzhou is?", "cypher": "match (:ENTITY{name:'Relationship{name:'Chinese name'}]-> (m) with m order by m.name return m.name limit 1"}, {"query": "Please help me find a scenic area 300 meters above sea level in the Yalu Tibet Grand Canyon.", "cypher": "match (:ENTITY{name:'2140 m'}) <- [:Relationship{name:'altitude'}]-(m), (m) - [:Relationship{name:'address'}]->(n) where n.name='Yoruba Tibet Gorge West Shingla Mountains' return m.name limit 2"}, {"query": "Tell me about the content of my literary works, from the beginning of the water melody to the Kimlin, the drinking of congregations, and the details of the four layers of relationships related to the North State collection.", "cypher": "match (n:ENTITY{name:' water tune song head to the top of the Kimlin, the congregations drink, because of the use of North State collection'}) - [*1..4]->(x) where x.name <> 'literary work' return distinct x.name limit 5"}, {"query": "What is 110 voice jump?", "cypher": "match (:ENTITY{name:'110 voice jumps'}) --(q) with q order by q.name return q.name"}, {"query": "Please provide me with 222 pages of Play Science: All the information related to science and knowledge in games.", "cypher": "match (n:ENTITY{name:'play science: science and knowledge in games'}) - [:Relationship*]->(x) where x.name<>'222 pages' return distinct x.name"}, {"query": "Please tell me what kind of relationship information is involved in the two layers of the five-spec concept car?", "cypher": "The following is a list of the most commonly used and used UNWIND relationships:"}, {"query": "Can you find the five comedy films that have been released in the US?", "cypher": "Match (:ENTITY{name:' United States'}) <- [:Relationship{name:' filming area'}]- (mn) - [:Relationship{name:' category'}]->(n:ENTITY{name:' comedy'}) return mn.name limit 5"}, {"query": "Do you have a Chinese name for a doctor?", "cypher": "match (:ENTITY{name:'medical lady'}) - [:Relationship{name:'Chinese name'}]-> (p) with p order by p.name return distinct p.name"}, {"query": "Chen Zheng, a Han man, was born in July 1967 in Anhui, Hunan, and is the current chairman of Hunan Coconut and Tea Group Co., Ltd., Hunan Zhengda Commodity Exchange Market Co., Ltd., Hunan Zhejiang Agricultural Development Co., Ltd., China Black Tea Cultural Expo, Hunan Zheyada Food Co., Ltd.; can you name 5 of his major achievements?", "cypher": "match (x:ENTITY{name:'Chen Ssang-gang, male, Han, born July 1967 in Hunan, Hunan, currently Hunan Aluminum and Tea Group, Ltd., Hunan Chendai Commodity Exchange Market, Ltd., Hunan Chendai Agricultural Development, Ltd., China Black Tea Cultural Expo Park, Hunan Chendai Food Co., Ltd. Chairman of the Board of Directors of the company)"}, {"query": "Where is the exhibition hall for the 2012 Shanghai International Beverage Machinery and Equipment Exhibition?", "cypher": "match ((:ENTITY{name:'2012 Shanghai International Beverage Machinery and Equipment Exhibition'}) - [:Relationship{name:'Holding the exhibition hall'}]-> (h) return h.name"}, {"query": "Where is the institutional department that has abolished the obligation to evaluate the performance of healthcare institutions?", "cypher": "match (:ENTITY{name:'Remove the performance review of the healthcare institution'}) <- [:Relationship{name:'Remove the role'}]- (q) return distinct q.name"}, {"query": "Do you know what events are organized by the Beijing Economic and Technological Development Zone (BEDZ) Board, Asin Group, and Cloud Base?", "cypher": "match (:ENTITY{name:'Beijing Economic and Technological Development Zone Committee, Ashanti Group, Cloud Base'}) <- [:Relationship{name:'host'}]- (q) return q.name"}, {"query": "Do you not understand all the relationship information involved in the law of diffusion in the two layers?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' the rules of propagation'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "The following is a list of three different types of Hala football clubs that are not related to sports:", "cypher": "match (:ENTITY{name:'Hara Football Club'}) --(m) with m order by m.name where m.name <> 'sport' return distinct m.name limit 3"}, {"query": "Which companies have the same date of establishment as the company of Langsa Siyuan Shot Cultural Media Ltd. and what are their respective labels? Please show these companies in order of their label number.", "cypher": "match (n:ENTITY{name:'Changsha Yicheng Cultural Media Limited Liability Company'}) - [:Relationship{name:'time of establishment'}]->(:ENTITY) <- [:Relationship{name:'time of establishment'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you find me three publications published by the People's Literature Publishing House?", "cypher": "match (:ENTITY{name:'People's Literature Publishing House'}) <- [:Relationship{name:'People's Literature Publishing House'}]- ((x),(x) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 3"}, {"query": "The company is a subsidiary of Tianjin Century Leader Cultural Communication Limited, which is the third largest company in the world, besides having a website and a company?", "cypher": "match (n:ENTITY{name:' Tianjin Century Leoshow Cultural Communication Limited'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'website' and h.name <> 'company' return distinct h.name limit 3"}, {"query": "What do you know about the moniker 02LF\u00d703F?", "cypher": "match (:ENTITY{name:'02LF\u00d703F'}) --(x) with x order by x.name where x.name <> 'specific name' return x.name"}, {"query": "The following is a description of the benefits of publishing in Chinese commercial publishing: Do employees feel like they are in a three-tier relationship with the book material?", "cypher": "match (n:ENTITY{name:'Winning profit: employees feel the same way'}) - [:Relationship*1..3]->(x) where x.name <> 'China commercial publisher' return distinct x.name"}, {"query": "What word has the American phonetic spelling [s?ri?s]?", "cypher": "match (:ENTITY{name:'[?s?ri?s]}) <- [:Relationship{name:'American style'}]- (x) return distinct x.name"}, {"query": "Can you provide information about Yanming's relationship with the footballer Yangming Yanming, which is no more than three levels?", "cypher": "match (n:ENTITY{name:'Yunming Yanming'}) - [*1..3]->(x) where x.name<> 'footballer' return distinct x.name"}, {"query": "Can you tell me about Ochieng Jackton's relationship with the two?", "cypher": "match (n:ENTITY{name:'Ochieng Jackton'}) - [*1..2]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "Can you tell me about three famous places in China?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'country'}]-(p) - [:Relationship{name:'famous places'}]->(n) return distinct n.name limit 3"}, {"query": "What are the most representative works of a writer born in Jiangsu Province (now Suzhou)? Can you name five?", "cypher": "match (:ENTITY{name:' Jiangsu Province (now Suzhou) ') <-[:Relationship{name:' Place of birth'}]-(q) -[:Relationship{name:' Representative works'}]->(h) return distinct h.name limit 5"}, {"query": "You've seen the 2014 Eastern Guard Spring Night, remember what the theme was?", "cypher": "match ((n:ENTITY{name:'2014 Eastern Guard Spring'}) - [:Relationship{name:'subject'}]-> (x) return x.name"}, {"query": "I'm not a doctor, so help me find out 6 things about Joe Fuquan in the 3rd layer.", "cypher": "match (:ENTITY{name:'Joe Fujun'}) - [*1..3]-(p) where p.name <> 'doctor' return p.name limit 6"}, {"query": "Help me find 10 plants that are classified as sub-plants.", "cypher": "match (:ENTITY{name:' by sub-plant gate'}) <- [:Relationship{name:' gate'}]-(m) return distinct m.name limit 10"}, {"query": "Please help me figure out what the theme of the 4th Xinjiang International Auto Show 2011 is?", "cypher": "match ((n:ENTITY{name:'2011 Fourth edition of the Shinjuku International Auto Show'}) - [:Relationship{name:' belongs to topic'}]-> (p) return p.name"}, {"query": "Can you tell me about the 5 different types of diary entry/series that your teacher taught you to write?", "cypher": "match (:ENTITY{name:'Kindergarten Diary Start/Name teacher teaches you to write essay series'}) --(m) with m order by m.name where m.name <> 'Jin Minhwa' return distinct m.name limit 5"}, {"query": "Can you tell me what this person looks like?", "cypher": "match (:ENTITY{name:'similar to '}) --(h) return distinct h.name"}, {"query": "What is the RC service?", "cypher": "match (n:ENTITY{name:'RC service'}) --(x) return x.name"}, {"query": "What is the name of the company that owns Ju-Jin?", "cypher": "match (:ENTITY{name:'Julian's[contemporary host]'}) - [:Relationship{name:'of the company'}]->(n) return n.name as name union all match (:ENTITY{name:'Julian's[contemporary host]'}) - [:Relationship{name:'of the work'}]->(m) return m.name as name"}, {"query": "The price is 10.00 yuan/issue; who has the shortest name of the 120.00 yuan/year product?", "cypher": "The following is a list of all the games that are currently available on the App Store:"}, {"query": "I heard that 3003 is a very versatile tool, can you list some specific applications?", "cypher": "The following is a list of all the different ways The Fellowship of the Ring is credited in the database:"}, {"query": "The following is a brief description of the three-tiered relationship between sports personality Ito Ichinose and his personal life:", "cypher": "match (n:ENTITY{name:'Ito's real name'}) - [*1..3]->(x) where x.name <> 'sportsman' return distinct x.name"}, {"query": "The food therapy reference for bronchitis is?", "cypher": "match (:ENTITY{name:'gastroparesis'}) <- [:Relationship{name:'for the disease'}]- ((x) - [:Relationship{name:'for the dietary reference'}]->(n) return distinct n.name"}, {"query": "Please describe 10 professions that Al McPherson has.", "cypher": "match (h:ENTITY{name:'Al McPherson'}) <- [:Relationship{name:'Chinese name'}]-(m) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 10"}, {"query": "Play five rock songs?", "cypher": "match (:ENTITY{name:' rock music'}) <--(n) return n.name limit 5"}, {"query": "The film is based on the novel of the same name by the writer, who is also a writer.", "cypher": "match (:ENTITY{name:'Relationship{name:'Creation date'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'Literary genre'}]->(m) return m.name as name"}, {"query": "Help me find a Korean dish made with beef.", "cypher": "match (:ENTITY{name:' beef, fresh cucumber'}) <- [:Relationship{name:' main ingredient'}]-(m), (m) - [:Relationship{name:' classification'}]->(n) where n.name='Korean dish' return distinct m.name limit 1"}, {"query": "What are the publications published by Yunnan People and what is the price of the books?", "cypher": "match (:ENTITY{name:'Yunnan people'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'pricing'}]->(q) return distinct h.name,q.name"}, {"query": "Can you tell me about the school of environmental engineering?", "cypher": "match (:ENTITY{name:' environmental engineering science'}) --(x) return distinct x.name"}, {"query": "Where is the headquarters of Sichuan Bridge Kitchen Limited? When was it founded?", "cypher": "match (:ENTITY{name:' Sichuan Bridge Kitchen Limited'}) - [:Relationship{name:' Headquarters location'}]->(n) return n.name as name union all match (:ENTITY{name:' Sichuan Bridge Kitchen Limited'}) - [:Relationship{name:' Established time'}]->(m) return m.name as name"}, {"query": "What is the EINECS# for chemicals 204-924-7?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "What are the main achievements of Aung San Suu Kyi?", "cypher": "match (:ENTITY{name:'\u7fc1\u536b'}) <- [:Relationship{name:'Chinese name'}]- ((p),(p) - [:Relationship{name:'main achievement'}]->(q) return distinct q.name"}, {"query": "The main achievements of a Tang Temple are described here.", "cypher": "match (x:ENTITY{name:'Tang Xiuyu'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Relationship{name:'main achievement'}]->(p) return p.name order by p.name limit 1"}, {"query": "What kinds of relationships are there in the three layers of the relationship that the Doenig Zen master contains?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Dawning Zen Master'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What are the major departments of Texas State University? Name 3 categories?", "cypher": "match (:ENTITY{name:'Texas, USA'}) <- [:Relationship{name:'area'}]- ((p),(p) - [:Relationship{name:'main faculty'}]->(m) return distinct m.name limit 3"}, {"query": "Who among entrepreneurs has a party membership?", "cypher": "match (p:ENTITY{name:'entrepreneur'}) <--(x) -->(q:ENTITY{name:'Communist Party of China'}) return x.name"}, {"query": "What is the shortest path in the 2 layers of the IMS and electronic device thermal design speed check manual based on cellular systems?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'IMS based on cellular system'}) - [*..2]-(b:ENTITY{name:' Electronic device thermal design quick check manual'})) return count ((p)"}, {"query": "What can you make with 50 grams of butter?", "cypher": "match (:ENTITY{name:' 50 g of butter'}) --(p) return p.name skip 2"}, {"query": "I wonder what Mike Nichols does for a living?", "cypher": "match (:ENTITY{name:'Mike Nichols'}) <- [:Relationship{name:'foreign language name'}]-(h),(h) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 1"}, {"query": "I'm not sure what the job of men is.", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]- ((m) - [:Relationship{name:'occupation'}]->(q) return distinct q.name limit 1"}, {"query": "How much do you know about 101+1 sports aggregates?", "cypher": "match (:ENTITY{name:'101+1 game collection'}) --(h) with h order by h.name where h.name <> 'game work' return h.name"}, {"query": "Three messages about the sexy model of summer 09?", "cypher": "match (:ENTITY{name:'09 summer sexy model'}) --(x) with x order by x.name return x.name limit 3"}, {"query": "I want to drink the wine of the gift of the Lord, and I want to write five poems in gratitude.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name <>'Don' return distinct x.name limit 5"}]