[{"query": "The first thing I did was to find out about the five 32 dollar reverse dream, fearless information resources.", "cypher": "match (n:ENTITY{name:'reverse dream, fearless'}) - [:Relationship*]->(x) where x.name <>'32' return distinct x.name limit 5"}, {"query": "Can you find me 5 books priced at $16 and when they will be published?", "cypher": "match (:ENTITY{name:'16\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "And tell me about the 12.23 Jun Jun State crash?", "cypher": "match (:ENTITY{name:'12.23 Yangzhou special accident'}) --(q) with q order by q.name return q.name"}, {"query": "You don't know what the three levels of relationships are that are covered by the primary and secondary schools in Chiricahua?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Chongqing City Primary School'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "Can you list the personal information of the Frenchman Hugues R\u00e9my's third level of relationship?", "cypher": "match (n:ENTITY{name:'Hugues R\u00e9my'}) - [*1..3]->(x) where x.name <>'France' return distinct x.name"}, {"query": "This C programming experimental guide and homework book that the teacher made us buy, when is the release date?", "cypher": "match ((:ENTITY{name:'C programming experiment guidance and homework set'}) - [:Relationship{name:'publish date'}]-> (p) return p.name"}, {"query": "What other tags are there for 0554 Returns Net with technical tag attributes?", "cypher": "match (:ENTITY{name:'0554 return net'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'technology' return x.name"}, {"query": "Do you know where the meeting that closed on August 20, 2017 was?", "cypher": "match (h:ENTITY{name:'August 20, 2017'}) <- [:Relationship{name:' closing time'}]- (x) return distinct x.name"}, {"query": "What is the CAS number of 1-acetylmethacrylate, please help me see?", "cypher": "match ((:ENTITY{name:'1-ethyl chloride'}) - [:Relationship{name:'CAS number'}]-> (p) return p.name"}, {"query": "What is the difference between the old and the new ink paintings?", "cypher": "match (:ENTITY{name:'\u5143\u4ee3'}) <- [:Relationship{name:' date of creation'}]-(m), (m) - [:Relationship{name:' painting type'}]->(n) where n.name='ink painting' return distinct m.name"}, {"query": "What is the shortest path between the cone and the cone 2?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortestpaths'}) -[:Relationship*..2]-(b:ENTITY{name:'shortestpaths'})) return count ((p)"}, {"query": "Do you know the specific situation of Ben-Gurion, B?", "cypher": "match (m:ENTITY{name:'B\u00b7'}) --(q) return distinct q.name"}, {"query": "Tell me the Chinese names of the three river umbrellas.", "cypher": "match (:ENTITY{name:'\u4e00\u5ddd\u70df\u96e8'}) - [:Relationship{name:'Chinese name'}]-> (h) with h order by h.name return h.name limit 3"}, {"query": "The following is a list of the top 10 political figures in the country:", "cypher": "match (n:ENTITY{name:'\u8bb8\u5143'}) - [*1..4]->(x) where x.name <> 'political figure' return distinct x.name"}, {"query": "What is the name of the philosophical genre that belongs to empiricism and idealism?", "cypher": "match (:ENTITY{name:' empiricism and idealism'}) <- [:Relationship{name:' philosophical genre'}]- (p) return distinct p.name"}, {"query": "Can you recommend some RPGs?", "cypher": "match (:ENTITY{name:'RPG role-playing game'}) <- [:Relationship{name:'game type'}]- (q) return distinct q.name"}, {"query": "Can you list three main achievements of this Chinese person?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]- ((n) - [:Relationship{name:'main achievements'}]->(p) return p.name skip 1 limit 5"}, {"query": "Can you recommend seven books for history class?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Please list me the top three schools with the International Education Academy as their main department.", "cypher": "match (:ENTITY{name:' International School of Education'}) <- [:Relationship{name:' Major School of Education'}]- (x) return x.name order by x.name limit 3"}, {"query": "Tell me, apart from being nominated for Best Actor at the 2nd Korea Nights Film Awards and Best Newcomer at the 35th Korea Film Awards, what are the two main achievements of Anja?", "cypher": "match (n:ENTITY{name:'Anzai-chan'}) - [:Relationship{name:'Main achievement'}]->(h) where h.name <> 'Best Actor at the 2nd Korea Nights Film Awards' and h.name <> 'Nominated for Best Newcomer at the 35th Korea Aquarius Film Awards' return distinct h.name limit 2"}, {"query": "Can you tell me the main achievements of Nurblit?", "cypher": "match (:ENTITY{name:'Nurbuly'}) - [:Relationship{name:'Main achievements'}]-> (h) return h.name order by h.name"}, {"query": "Did any of the competitions in 2014 succeed? Can you tell me 15?", "cypher": "match (:ENTITY{name:'2014'}) <- [:Relationship{name:' time of holding'}]- (h) return h.name limit 15"}, {"query": "Can you list the 5 honorary awards that all the schools affiliated with Guangzhou University have received?", "cypher": "match (:ENTITY{name:'Changzhou University affiliated secondary school'}) <- [:Relationship{name:'Chinese name'}]-(x) - [:Relationship{name:'main award'}]->(q) return distinct q.name limit 5"}, {"query": "So, what are the top 5 facts about the new 022 missile speedboat?", "cypher": "match (:ENTITY{name:'022 new type missile speedboat'}) --(m) with m order by m.name return m.name limit 5"}, {"query": "The company is a small business, but it is a very small business.", "cypher": "match (p:ENTITY{name:'Simple Happy Company'}) return p.time"}, {"query": "Which exhibition is on 17 May 2012 or 19 May 2012?", "cypher": "match (:ENTITY{name:'May 17, 2012 19th'}) <- [:Relationship{name:' Exhibition time'}]- (p) return p.name"}, {"query": "What are some words associated with mining?", "cypher": "match (:ENTITY{name:'mining'}) <- [:Relationship{name:'field'}]- (x) return distinct x.name"}, {"query": "The report also highlights the need for a global strategy to combat corruption and corruption.", "cypher": "match (:ENTITY{name:'people'}) <- [:Relationship{name:'object'}]- (q) return distinct q.name"}, {"query": "What is the name of the Hindu and Jain architectural complexes in India in the Middle Ages?", "cypher": "match (:ENTITY{name:' Medieval Hindu and Jain architectural complexes in India\u3002'}) --(x) return distinct x.name"}, {"query": "The film is called 100 meters of sky and is there any other label?", "cypher": "match (:ENTITY{name:'100 meters of sky'}) - [:Tag{name:'tags'}]-> (n) with n order by n.name where n.name <> 'film' return n.name"}, {"query": "Can you tell me about the three layers of relationships involved in the welfare of birds?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'beneficial bird'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "I want to know about 007 One Key Root?", "cypher": "match (:ENTITY{name:'007 one key Root'}) --(h) with h order by h.name return h.name"}, {"query": "Find out about the personal information in the four-tier relationship of Karlsson Kim, who has five footballs?", "cypher": "match (n:ENTITY{name:'Karlsson Kim'}) - [*1..4]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "I'm not sure if you can tell me about the profile of the three-tiered relationship called \"Scented\" in Chinese.", "cypher": "match (n:ENTITY{name:'sweet'}) - [:Relationship*1..3]->(x) where x.name <>'sweet' return distinct x.name"}, {"query": "Do you know which clubs the player who joined in January 2000 played for? Can you name three?", "cypher": "match (:ENTITY{name:'January 2000'}) <- [:Relationship{name:'time in team'}]- ((x) - [:Relationship{name:'has played'}]->(m) return distinct m.name limit 3"}, {"query": "What is the shortest path between the International Politics major and the Diplomacy major in the two levels?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'international politics major'}) - [:Relationship*..2]-(b:ENTITY{name:'diplomacy major'})) return count ((p)"}, {"query": "What tourist attractions are there in Yangon?", "cypher": "match (:ENTITY{name:'Lenin Province Liaoning City'}) - [:Relationship{name:'the area'}] - ((m), (m) - [:Relationship{name:'famous places'}] - ((n)? return distinct m.name,n.name"}, {"query": "I wonder what the scope of application of history is?", "cypher": "match (n:ENTITY{name:' history'}) <- [:Relationship{name:' applied discipline'}]- ((m),(m) - [:Relationship{name:' scope of application'}]->(q) return distinct q.name limit 3"}, {"query": "Please help me find the names of the first five representatives of Christopher Simeonescu.", "cypher": "match (:ENTITY{name:'Christopher Simeonescu'}) - [:Relationship{name:'representing work'}]-> (n) return n.name order by n.name limit 5"}, {"query": "A label says 100W/200WLED industrial mine light?", "cypher": "match (:ENTITY{name:'100W/200WLED industrial mine lamp'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 1"}, {"query": "What are the main features of the newly developed 19talk software?", "cypher": "match ((:ENTITY{name:'19talk'}) - [:Relationship{name:'main function'}]-> (p) return p.name"}, {"query": "What is the name of the school in the town center of White Tower in the Bo mountains?", "cypher": "match (:ENTITY{name:'Bohasan area White Tower Town Center School'}) - [:Relationship{name:' abbreviated'}]-> (p) return distinct p.name"}, {"query": "What basketball events have the NBA hosted? Name 14?", "cypher": "match (:ENTITY{name:'NBA'}) <- [:Relationship{name:'hosting organization'}]- (x) return x.name limit 14"}, {"query": "Can you recommend eight Eastern fantasy novels?", "cypher": "The title of the game is \"Relationship\" (Relationship)"}, {"query": "When was Searchlight founded?", "cypher": "match (p:ENTITY{name:'Brighton Company'}) return p.time The name of the match is"}, {"query": "What do you know about the poem \"Bird's Song\"? Help me find the other four pieces of information in the 2nd layer.", "cypher": "match (:ENTITY{name:'bird song'}) - [:Relationship*1..2]-(p) where p.name <> 'poem' return p.name limit 4"}, {"query": "Please do you know who sang \"Leave It to the Moon\"?", "cypher": "match (:ENTITY{name:'release in the month of January'}) --(m) return m.name order by m.name limit 1"}, {"query": "What else is there to know about the 1957 release of the Mountain Top Black Dog Brothers?", "cypher": "match (:ENTITY{name:'Hilltop black dog brother'}) - [:Relationship*1..3]-(p) where p.name <> '1957' return p.name limit 6"}, {"query": "Please help me find three books for $200 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'100.00\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "Help me find out who are the stars of three sci-fi dramas.", "cypher": "match (:ENTITY{name:'science fiction'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'starring'}]->(n) return m.name,n.name limit 3"}, {"query": "I want to translate the work of Hu Jintao: The Love: Five profiles of me and Dulas?", "cypher": "match (n:ENTITY{name:'the love: me and Duras'}) - [:Relationship*]->(x) where x.name <>'Manjigaru.Tropical courtyard' return distinct x.name limit 5"}, {"query": "Can you tell me about the three companies that were founded in 2013?", "cypher": "match (:ENTITY{name:'2013'}) <- [:Relationship{name:'time of establishment'}]-(n) - [:Relationship{name:'company name'}]->(q) return distinct q.name limit 3"}, {"query": "Is it true that the song is called the most beautiful bride?", "cypher": "match (n:ENTITY{name:'most beautiful bride'}) where n is not null return 1"}, {"query": "Do you have any great works by writers who died in 1966?", "cypher": "match (:ENTITY{name:'1966'}) <- [:Relationship{name:'date of death'}]-(m),(m) - [:Relationship{name:'representative work'}]->(h) return distinct h.name limit 1"}, {"query": "Do you have any people or things or skills that are related to basketball?", "cypher": "match (x:ENTITY{name:'basketball'}) <- [:Relationship{name:'sports program'}]- (p) return p.name limit 10"}, {"query": "Can you name five music albums released by Universal Records?", "cypher": "match (:ENTITY{name:'Universal Records'}) <- [:Relationship{name:'Record company'}]- (n) return distinct n.name limit 5"}, {"query": "Can you list the times of the 20 hour drive?", "cypher": "match (:ENTITY{name:'20 hours'}) <- [:Relationship{name:'run time'}]- (q) return q.name"}, {"query": "What are the names of the characters who are in the same rank as Cao Yanbo? What are their respective labels? Please list them in order of their number of labels from small to large.", "cypher": "match (n:ENTITY{name:'\u66f9\u826f\u6ce2'}) - [:Relationship{name:'\u519b'}]->(:ENTITY) <- [:Relationship{name:'\u519b'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Can you recommend some games for me to play in the costume category?", "cypher": "match (:ENTITY{name:'dressed'}) <- [:Relationship{name:'game category'}]- (q) return distinct q.name"}, {"query": "I would like to know the name of the novel in Chinese that is being published on the Chinese website.", "cypher": "match (:ENTITY{name:' starting point Chinese web'}) <- [:Relationship{name:' linking site'}]-(h),(h) - [:Relationship{name:' Chinese name'}]->(x) return distinct x.name limit 1"}, {"query": "In which publishing houses did Diderot's books appear?", "cypher": "match (:ENTITY{name:'Didro'}) <- [:Relationship{name:'author'}]-(x),(x) - [:Relationship{name:'publisher'}]->(q) return distinct q.name"}, {"query": "What chemical has the linear molecular formula C6H4ClNO2?", "cypher": "The name of the match is \"Relationship\" (Relationship)"}, {"query": "The book was published by the China Young Children's Press, and helped me find 10 books.", "cypher": "match (:ENTITY{name:'China Youth Children's Publishing House'}) <- [:Relationship{name:'China Youth Children's Publishing House'}]- (mn) return mn.name limit 10"}, {"query": "JB/Julia Bardera/Harudera Yuria have a voice for what character?", "cypher": "match (:ENTITY{name:'JB/Julia Bardera/Harudera Yuria'}) <- [:Relationship{name:'other names'}]- ((q),(q) - [:Relationship{name:'sounding'}]->(n) return distinct n.name limit 2"}, {"query": "You don't know what this lady does for a living? Can you name three things?", "cypher": "match (:ENTITY{name:' female'}) <- [:Relationship{name:' gender'}]-(p) - [:Relationship{name:' profession'}]->(q) return q.name order by q.name limit 3"}, {"query": "Can you find me three plants in the family of the ginger beetles and describe them?", "cypher": "match (:ENTITY{name:'Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "What is the name of the TV series directed by Wang Min, starring Liu Wenhui, Liu Li, and others?", "cypher": "match (:ENTITY{name:'\u9ec4\u514b\u654f'}) <- [:Relationship{name:'director'}]-(m), (m) - [:Relationship{name:'lead actress'}]->(n) where n.name='Jin, Jin, Jin, Jin, Jin, Jin, Jin, Jin' return m.name"}, {"query": "Can you name the three different names of this place with the postal code 213000?", "cypher": "match (:ENTITY{name:'213000'}) <- [:Relationship{name:'postal area code'}]-(p),(p) - [:Relationship{name:'alias'}]->(h) return h.name order by h.name limit 3"}, {"query": "I want to know about the other 6 levels of this software.", "cypher": "match (:ENTITY{name:'Best children's park'}) - [*1..3]-(p) where p.name <> 'software' return distinct p.name limit 6"}, {"query": "I want to know about the label attributes of 1/4 theater?", "cypher": "match (:ENTITY{name:'1/4 play'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "How much do you know about Sebastian LeRoy's major achievements?", "cypher": "match (p:ENTITY{name:'Sebastian Lelio'}) - [:Relationship{name:'major achievement'}]-> (h) return h.name order by h.name"}, {"query": "Can you tell me what other features this thing has, including the tourist shoes?", "cypher": "match (:ENTITY{name:'shoes'}) <-[:Relationship{name:'includes'}]-(x),(x) -[:Relationship{name:'attributes'}]->(n) return n.name order by n.name limit 10"}, {"query": "Can you tell me what his English name is Shandong Airlines Limited?", "cypher": "match (:ENTITY{name:'Santon Airlines Limited'}) <- [:Relationship{name:'company name'}]- ((x),(x) - [:Relationship{name:'foreign language name'}]->(q) return distinct q.name"}, {"query": "Can you list four movies that are going to be released in theaters?", "cypher": "match (:ENTITY{name:'drama film'}) <- [*]-(m), (m) - [:Relationship{name:'release time'}]->(n) return m.name, n.name limit 4"}, {"query": "I would like to know if any of the meetings are being attended by state-owned China.", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'Chamber of Commerce'}]- (p) return distinct p.name"}, {"query": "Where is Forty Pages located?", "cypher": "match (p:ENTITY{name:'forty-page company'}) return p.location"}, {"query": "Can you find an oil painter in Shanghai?", "cypher": "match (:ENTITY{name:' Shanghai'}) <- [:Relationship{name:'\u7c4d\u8d2f'}]- (mn) - [:Relationship{name:'profession'}]->(n:ENTITY{name:'painter'}) return mn.name"}, {"query": "Can you help me find a tag about the 2011 Shanghai International Agricultural Storage Equipment and Preservation Technology Expo?", "cypher": "match (:ENTITY{name:'2011 Shanghai International Agricultural Storage Equipment and Freshness Technology Exhibition'}) - [:Tag{name:'label'}]-> (p) with p order by p.name return p.name limit 1"}, {"query": "What journals were published in 2003? Can you recommend two?", "cypher": "match (:ENTITY{name:'2003'}) <- [:Relationship{name:'publication time'}]-(m), (m) - [:Tag{name:'tag'}]->(n) where n.name='journal' return m.name limit 2"}, {"query": "What is the main career of the artist who has achieved the pioneering role of the Latter-day Saint?", "cypher": "match (h:ENTITY{name:'Relationship{name:' major achievement'}) - ((x),(x) - [:Relationship{name:' profession'}]->(m) return distinct m.name"}, {"query": "I'm not sure if it's good to have five pieces of information from the 83kg Frankie Sempero.", "cypher": "match (n:ENTITY{name:'Semporo Frankie'}) - [*]->(x) where x.name <>'83 kg' return distinct x.name limit 5"}, {"query": "eGoBuy software is his platform you know?", "cypher": "match (:ENTITY{name:'eGoBuy'}) <- [:Relationship{name:'software name'}]- ((x),(x) - [:Relationship{name:'software platform'}]->(q) return distinct q.name"}, {"query": "How about three graduates from Imperial University of Tokyo?", "cypher": "match (:ENTITY{name:'Tokyo Imperial University'}) <- [:Relationship{name:' Graduate School'}]- ((x) return distinct x.name limit 3]"}, {"query": "How many companies have been in business for 20 years?", "cypher": "match (p:ENTITY{time:'2020'}) return count ((p)"}, {"query": "Do you know which places and parks are on the 5th level of the label relationship?", "cypher": "The following is a list of the most commonly used tags in the game."}, {"query": "Can you name a match in the WNBA Super Series?", "cypher": "match (q:ENTITY{name:'World Futsal Super Series'}) <- [:Relationship{name:' belongs to series'}]- (p) return p.name"}, {"query": "Please tell me what is the relationship between the third tier label and the stock dividend?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'in share rate'}) RETURN distinct n.name"}, {"query": "Which books are in the same literary genre as Ms. Yang, and what are the labels on each?", "cypher": "The following is a list of characters that appear in the game The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of Zelda: Breath of Zelda: Breath of the Wild: The Legend of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Z"}, {"query": "Can you tell me something else about 1237.", "cypher": "match (:ENTITY{name:'1237 year'}) --(q) with q order by q.name return q.name limit 1"}, {"query": "The first representative work of a person born in 1961 was?", "cypher": "match (:ENTITY{name:'1961'}) <- [:Relationship{name:'date of birth'}]-(x),(x) - [:Relationship{name:'representative work'}]->(n) return n.name order by n.name limit 1"}, {"query": "You have the top 5 messages from Paulo Trancoso?", "cypher": "match (m:ENTITY{name:'Paulo Trancoso'}) --(n) return distinct n.name limit 5 The name of the game is the same as the name of the game itself."}, {"query": "Please list the games in which Gretzky scored a goal.", "cypher": "match (:ENTITY{name:'Relationship{name:'goalkeeper'}]- (p) return distinct p.name"}, {"query": "Please answer one of the thirteen swords buried in heaven, who is the one who sounds a thousand palaces of smoke?", "cypher": "match (:ENTITY{name:'One of the thirteen knives of the heavenly tombs, the thousand-square-foot palace'}) <- [:Relationship{name:'identity'}]-(m),(m) - [:Relationship{name:'sounding'}]->(p) return distinct p.name"}, {"query": "Can you recommend five urban romance novels?", "cypher": "match (:ENTITY{name:'city idiom'}) <- [:Relationship{name:'novel type'}]- (x) return distinct x.name limit 5"}, {"query": "I'm not a street person, so you don't know?", "cypher": "match (:ENTITY{name:' I'm a passerby'}) --(q) return q.name order by q.name"}, {"query": "Do you know what kind of jobs are there for you to be a positive person in?", "cypher": "match (:ENTITY{name:'Shyun-woo was born in Taiwan, studied in Taiwan, served in the Taiwanese army, and then went to the United States, France for further studies\u3002'}) <- [:Describe{name:'description'}]-(x) - [:Relationship{name:'profession'}]->(m) return distinct m.name limit 5"}, {"query": "What is the blood type of six Japanese actors?", "cypher": "match (:ENTITY{name:'Japanese actor'}) <- [*]-(m), (m) - [:Relationship{name:'blood type'}]->(n) return m.name, n.name limit 6"}, {"query": "Cat's Paw is located in which city?", "cypher": "match (p:ENTITY{name:' Cat's Paw Company'}) return p.location The name of the company is not known"}, {"query": "What is the software information within the C++ language's Ruby-ROM Assistant 3 layer relationship?", "cypher": "match (n:ENTITY{name:'ROM assistant'}) -[:Relationship*1..3]->(x) where x.name<>'C++' return distinct x.name"}, {"query": "Can you recommend 5 real estate blocks for sale?", "cypher": "match (:ENTITY{name:' for sale'}) <- [:Relationship{name:' for sale'}]- (x) return distinct x.name limit 5"}, {"query": "The three professions that graduates of Hunan University are employed in", "cypher": "match (:ENTITY{name:'Hunan University'}) <- [:Relationship{name:'Graduate School'}]-(n) - [:Relationship{name:'Profession'}]->(q) return distinct q.name limit 3"}, {"query": "The book on the daily education of the 0-3 year old baby in your bookshelf, which publisher published it?", "cypher": "match ((:ENTITY{name:'0-3 year old baby's daily upbringing'}) - [:Relationship{name:'publisher'}]-> (n) return n.name"}, {"query": "What ingredients are used to make healthy, low-calorie food that everyone can eat?", "cypher": "match (:ENTITY{name:'weight loss MM, breakfast energy source for diabetics--Wood sugar alcohol whole wheat turmeric After making some turmeric, I personally prefer wood sugar alcohol whole wheat turmeric, because it is healthy and low in calories! and can be eaten by the whole family."}, {"query": "Do you have any information about the relationships within the three layers that this person is involved in?", "cypher": "The following pages link to The Unknown:"}, {"query": "It's too complicated for this compound, can you write the chemical formula?", "cypher": "match ((:ENTITY{name:' for the binary methyl double [for the aminoacetyl acetate]'}) - [:Relationship{name:' chemical formula'}]-> (x) return x.name"}, {"query": "What is the purpose of enhancing epithelial cell regeneration and preventing skin aging?", "cypher": "match (n:ENTITY{name:' Enhance epidermal cell regeneration and prevent skin aging'}) <- [:Relationship{name:' uses'}]- (mn) return mn.name"}, {"query": "What chemical has a molecular weight of 69.07?", "cypher": "The name of the function is the name of the function."}, {"query": "Can you tell me three facts about football?", "cypher": "match (:ENTITY{name:' football'}) --(n) return distinct n.name limit 3"}, {"query": "Can you tell me which philosophers were born in 1861?", "cypher": "match (:ENTITY{name:'1861'}) <- [:Relationship{name:'date of birth'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='philosopher' return m.name"}, {"query": "Is it good to talk about a male profession?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(m),(m) - [:Relationship{name:'occupation'}]->(x) return distinct x.name limit 1"}, {"query": "What label did Christopher Columbus have in 1492 besides the action film?", "cypher": "match (:ENTITY{name:'1492, Christopher Columbus'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'action film' return m.name"}, {"query": "Please help me find two books for $25.00 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'25.00\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "What are the differences between the number of people born in a country with a rose label and the number of people born in a country with a rose label?", "cypher": "match (n:ENTITY{name:'Third River'}) - [:Relationship{name:'Native place'}]->(:ENTITY) <- [:Relationship{name:'Native place'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you find me a 1315 creative park outside of geography?", "cypher": "match (:ENTITY{name:'1315 creative park'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'geography' return h.name"}, {"query": "What is the name of the data engine developed by Inprise?", "cypher": "match (:ENTITY{name:'Inprise company'}) <- [:Relationship{name:' belongs to '}]-(m), (m) - [:Relationship{name:' category'}]->(n) where n.name=' database engine' return distinct m.name"}, {"query": "Can you name six Chinese government employees?", "cypher": "match (q:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]- (h) return h.name limit 6 This is a list of all the different ways China is credited in the database."}, {"query": "I only know that Chongqing Choc Chamber Symphony Orchestra is a classical music group that was founded on October 8, 2013.", "cypher": "match (n:ENTITY{name:'Chongqing Chakula Chamber Orchestra'}) -->(h) with h order by h.name where h.name <> 'classical music' and h.name <> '2013/10/8' return h.name limit 6"}, {"query": "How many PhDs and Masters do the ROC have?", "cypher": "match (:ENTITY{name:'Relationship{name:'Doctorate'}}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'Master'}}) ->(m) return m.name as name"}, {"query": "What are the best representative works of a writer born in 1909? Can you list 10?", "cypher": "match (:ENTITY{name:'1909'}) <- [:Relationship{name:'date of birth'}]- ((m) - [:Relationship{name:'representative work'}]->(q) return distinct m.name limit 10"}, {"query": "I wonder what the main prize is for Batman: The Animated Series?", "cypher": "match (:ENTITY{name:'Batman: The Dark Knight Rises'}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'main prize'}]->(x) return distinct x.name limit 1"}, {"query": "Can you recommend two books with simple Chinese characters?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What is the name of the actress who is the representative of the work of the Queen of the Underworld, the Queen of the Underworld, the Queen of the Underworld?", "cypher": "match (:ENTITY{name:'Relationship'}- ((n), ((n) - ((Relationship{name:' alias'}) -> ((q) return distinct q.name)"}, {"query": "Can you tell me where Chamb\u00e9ry graduated from?", "cypher": "match (:ENTITY{name:'Changberli'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'Graduate college'}]->(n) return distinct n.name"}, {"query": "Can you name five Chinese occupations?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(n),(n) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 5"}, {"query": "I'm not sure if you're going to send me a list of all the labels for 2001's pathological?", "cypher": "match (:ENTITY{name:'2001 pathologist'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "I'm not sure if you're interested in finding a Mongolian and listing one of his major achievements.", "cypher": "match (x:ENTITY{name:'Mongolian'}) <- [:Relationship{name:'ethnicity'}]- ((q) - [:Relationship{name:'main achievements'}]->(m) return q.name order by q.name,m.name limit 1"}, {"query": "What are the main works of this person of the zodiac that you know about? Can you name five?", "cypher": "match (:ENTITY{name:'Big Dipper'}) <- [:Relationship{name:'Big Dipper'}]-(h),(h) - [:Relationship{name:'Major work'}]->(p) return p.name order by p.name limit 5"}, {"query": "Did you know the single I Was Gonna Cancel?", "cypher": "match (:ENTITY{name:'I Was Gonna Cancel'}) --(m) with m order by m.name where m.name <> 'single' return m.name"}, {"query": "And where is their publisher, for six publications?", "cypher": "match (:ENTITY{name:'published'}) <- [*]-(m), (m) - [:Relationship{name:'published'}]->(n) return m.name, n.name limit 6"}, {"query": "What do medical graduates from Nanjing Central University do?", "cypher": "match (:ENTITY{name:'Nanjing Central University Medical School'}) <- [:Relationship{name:'Graduate School'}]-(x),(x) - [:Relationship{name:'Profession'}]->(n) return distinct n.name"}, {"query": "Do you know who was identified as a suspect in the 9/11 Chechen parliament bombing?", "cypher": "match ((:ENTITY{name:'10\u00b719 Russian Chechen Parliament building explosion'}) - [:Relationship{name:'suspect'}]-> (m) return m.name"}, {"query": "What chemical is CAS number 21902-38-5?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "The total number of businesses in the city of Ibiza?", "cypher": "match (p:ENTITY{location:'Kashmir'}) return count ((p)"}, {"query": "Can you help me find two songs with lyrics by Chen Wei and lyrics by Liu Xiaobo?", "cypher": "match (:ENTITY{name:'\u8c26'}) <- [:Relationship{name:'fillup'}]-(m), (m) - [:Relationship{name:'script'}]->(n) where n.name='Chen Wei' return m.name limit 2"}]