[{"query": "Do you want to know about the personal information of the subject, Mr. Choi Yayoi, in his three-tier relationship?", "cypher": "match (n:ENTITY{name:'Koichi Yokota'}) - [*1..2]->(x) where x.name <> 'subject person' return distinct x.name"}, {"query": "Please let me know what the relationship is between choosing the toxicity content in the three layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'select toxicity'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "I want to find six films, how long will they run?", "cypher": "match (:ENTITY{name:' film work'}) <- [*]-(m), (m) - [:Relationship{name:' time of release'}]->(n) return m.name, n.name limit 6"}, {"query": "How many books of 16 pages have been published by Henan Science and Technology Publishing?", "cypher": "match (l:ENTITY{name:' Henan Science and Technology Publishing House'}) <- [:Relationship{name:' Publishing House'}]- (mn) - [:Relationship{name:' Opening House'}]->(n:ENTITY{name:'16 Opening House'}) return mn.name limit 30"}, {"query": "I would like to know which of the programs addresses the current hot topics in education?", "cypher": "match (:ENTITY{name:' current educational hot topic'}) <- [:Relationship{name:' targeted content'}]- (p) return p.name"}, {"query": "I suddenly forgot the chemical formula for 1-hydroxy-2-alkyl, can you write it for me?", "cypher": "match ((:ENTITY{name:'1-hydroxy-2-ethyl alcohol'}) - [:Relationship{name:'chemical formula'}]-> (q) return q.name"}, {"query": "Please tell me what the name of the accident is that killed two people and injured four.", "cypher": "match (x:ENTITY{name:'2 dead 4 wounded'}) <- [:Relationship{name:'consequences'}]- (q) return q.name"}, {"query": "Can you remove the label of the 1982 concert at the Elizabeth Stadium in Hong Kong?", "cypher": "match (:ENTITY{name:'1982 Hong Kong Elizabeth Stadium Concert'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'show' return p.name"}, {"query": "Fan Ko Xin, born on September 19, 1993 in Seven Rivers City, Heilongjiang Province, is a Chinese female short track speed skater.", "cypher": "match (:ENTITY{name:'Fan Ko-sin, born 19 September 1993 in Seven River City, Heilongjiang, is a female Chinese short track speed skater\u3002'})"}, {"query": "Can you give me the chemical formula for methyl methacrylate?", "cypher": "match ((:ENTITY{name:'diethyl methacrylate'}) - [:Relationship{name:'chemical formula'}]-> (m) return m.name"}, {"query": "Can you find me 15 free sites that are open all day?", "cypher": "match (:ENTITY{name:'all day'}) <- [:Relationship{name:'open hours'}]-(m), (m) -->(n) where n.name='free' return distinct m.name limit 15"}, {"query": "What events have happened in history?", "cypher": "match (:ENTITY{name:' history'}) <- [:Tag{name:' tag'}]-(p),(p) - [:Relationship{name:' event'}]->(n) return distinct n.name limit 1"}, {"query": "And what is the story of Qubba' al-Jawwal?", "cypher": "match (:ENTITY{name:'Kyuboya One'}) --(p) return p.name skip 2"}, {"query": "The first is that the government has not been able to provide any information about the personal relationship between the three levels of the Shining Dynasty.", "cypher": "match (n:ENTITY{name:'Shengxian'}) - [*1..3]->(x) where x.name<>'Ming\u671d' return distinct x.name"}, {"query": "Can you find the tags for 1221 Bearings for me?", "cypher": "match (p:ENTITY{name:'1221 bearing'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "The village of Draghi is known for its fishing.", "cypher": "match (n:ENTITY{name:'dragging village'}) where n is not null return 1"}, {"query": "The following is a list of the best-selling books by Sub-Saharan Africa, published by Sub-Saharan Africa.", "cypher": "match (:ENTITY{name:'sub-banana'}) - [:Relationship{name:'brokerage company'}]->(n) return n.name as name union all match (:ENTITY{name:'sub-banana'}) - [:Relationship{name:'representative work'}]->(m) return m.name as name"}, {"query": "I wonder if you have a nickname?", "cypher": "match (:ENTITY{name:''}) - [:Relationship{name:'alias'}]-> (m) return m.name order by m.name"}, {"query": "I would like to know three specific messages from Carlos Roberto Flores Fukuze.", "cypher": "match (:ENTITY{name:' Carlos Roberto Flores Faucet'}) --(n) return distinct n.name limit 3 The name of the game is the same as the name of the game itself."}, {"query": "The following are the three categories of people who are born in April 1972 and who are engaged in cooking.", "cypher": "match (q:ENTITY{name:'April 1972'}) <- [:Relationship{name:'date of birth'}]-(p),(p) - [:Relationship{name:'occupation'}]->(h) return distinct h.name limit 3"}, {"query": "I'm looking for a list of the top 5 tags for 06 years old smart baby full-time nurturing.", "cypher": "match (:ENTITY{name:'06 years old smart baby full-time nurturing encyclopedia'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 5"}, {"query": "What is the main work of the 167-centimeter man?", "cypher": "match (:ENTITY{name:'167 cm'}) <- [:Relationship{name:'height'}]- ((q),(q) - [:Relationship{name:'main works'}]->(h) return distinct h.name limit 1"}, {"query": "I'm not sure if you can tell me about the conferences that are being held in Beijing.", "cypher": "match (:ENTITY{name:'Beijing'}) <- [:Relationship{name:'Place of the meeting'}]- (p) return distinct p.name"}, {"query": "I need an introduction to the five layers of social theory, like the five Sullivan anxiety theories?", "cypher": "match (n:ENTITY{name:'Sullivan's anxiety theory'}) - [*1..5]->(x) where x.name <> 'society' return distinct x.name limit 5"}, {"query": "What are the famous alumni of Jiangsu Secondary School in Guizhou Province? Name three?", "cypher": "match (:ENTITY{name:'Guyzhou Jiangsu Middle School was founded in 1942, located in Jiangsu County, Jiangsu City, Guizhou Province, on the banks of the Jinjiang River, through the efforts of several generations of Jiangsu people, it has developed to become a modern garden-style school with an area of 41 800 square meters, 2518 students, harmonious layout, elegant environment."}, {"query": "The book 1913: What labels were placed on the vagrants of the summer of the century?", "cypher": "match (:ENTITY{name:'1913: The Vagabonds of the Summer of the Century'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'books' return h.name"}, {"query": "Which parks have the same area as the North Room City Agricultural Park? What are the labels for each park? Please list them in order of number of labels from small to large.", "cypher": "match (n:ENTITY{name:'North Room Urban Agricultural Park'}) - [:Relationship{name:'accounting for area'}]->(:ENTITY) <- [:Relationship{name:'accounting for area'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Can you list two accidents where six people were injured?", "cypher": "match (:ENTITY{name:'6 people injured'}) <- [:Relationship{name:'injured'}]- (m) return m.name limit 2"}, {"query": "What kind of plant is 25cm-35cm tall?", "cypher": "Match (:ENTITY{name:'25CM-35CM'}) <- [:Relationship{name:'chief'}]- (n) return n.name The name of the match is not shown."}, {"query": "Can you name the first three paintings that are the first three paintings?", "cypher": "match (:ENTITY{name:'3'}) <- [:Relationship{name:'the first painting'}]-(m) - [:Relationship{name:'the first painting'}]->(h) return h.name skip 2 limit 3"}, {"query": "The system is currently in the process of being downloaded from the Chinese website, and you can find 2 more information about it here.", "cypher": "match (n:ENTITY{name:'the system'}) -->(h) with h order by h.name where h.name <> 'start Chinese web' and h.name <> 'connected' return h.name limit 2"}, {"query": "What books are published by Ocean Publishing?", "cypher": "match (:ENTITY{name:' ocean publishing'}) <- [:Relationship{name:' publishing'}]- ((x),(x) - [:Relationship{name:' book name'}]->(q) return distinct q.name limit 3"}, {"query": "Take me to the site of the Cottage of the Rose.", "cypher": "match (:ENTITY{name:'Cottage of the Sun'}) --(p) return distinct p.name"}, {"query": "What chemical substance has a molecular weight of 226?", "cypher": "The name of the function is the name of the function itself."}, {"query": "Can you name 6 of them?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What are the common symptoms of bipolar disorder and which clinic should I go to?", "cypher": "match (:ENTITY{name:'biphasic disorder'}) - [:Relationship{name:'common symptoms'}]->(n) return n.name as name union all match (:ENTITY{name:'biphasic disorder'}) - [:Relationship{name:'visiting department'}]->(m) return m.name as name"}, {"query": "Can you tell me about the five species of plants in the family Tiananmen?", "cypher": "Match (n:ENTITY{name:'Relationship{name:'Relationship'}) - (mn) return mn.name limit 5"}, {"query": "What are the horror novels? 3 types can I recommend?", "cypher": "match (m:ENTITY{name:'terror'}) <- [:Relationship{name:'type'}]- ((h) - [:Relationship{name:'Chinese name'}]->(x) return distinct x.name limit 3"}, {"query": "I would like to know which unit is hosting the 2012 Industrial Computer and Embedded Systems Expo?", "cypher": "match ((:ENTITY{name:'2012 Industrial Computers and Embedded Systems Exhibition'}) - [:Relationship{name:'host entity'}]-> (h) return h.name"}, {"query": "I'm wondering if there are any online stores that have exclusive limited editions of their products?", "cypher": "match (:ENTITY{name:' exclusive limited edition'}) <- [:Relationship{name:' product'}]- (p) return distinct p.name"}, {"query": "What else do you know about sinusitis other than what happens in the nose?", "cypher": "match (:ENTITY{name:'nasal arthritis'}) - [:Relationship*1..2]-(p) where p.name <> 'nose' return distinct p.name limit 10"}, {"query": "Help me find the five species of plants in the mulberry category", "cypher": "match (:ENTITY{name:'Relationship{name:'program'}]-(m) return distinct m.name limit 5"}, {"query": "The following is a list of five types of blood type A in the four levels of personal information of Chen Jinhua:", "cypher": "match (n:ENTITY{name:'Chen Jinping'}) - [*1..4]->(x) where x.name<>'A' return distinct x.name limit 5"}, {"query": "The following is a list of five 20th century Tiger Panda double-faced exotic cultures.", "cypher": "match (n:ENTITY{name:'20th century tiger panda double-sided weird'}) - [*]->(x) where x.name <> 'culture' return distinct x.name limit 5"}, {"query": "I look at the two-layered relationship between literary works and the double-flat tone of the material.", "cypher": "match (n:ENTITY{name:' double-flying consonant'}) - [:Relationship*1..2]->(x) where x.name<>'literary work' return distinct x.name"}, {"query": "I need all the information related to Shenzhen's gift of Wang Zhuo Guarantee?", "cypher": "match (n:ENTITY{name:'submitted by the king'}) - [*]->(x) where x.name<>'Shenzhen' return distinct x.name limit 5"}, {"query": "Tell me about the achievements of three graduates of Moscow Eastern University.", "cypher": "match (:ENTITY{name:'Moscow Eastern University'}) <- [*]-(m), (m) - [:Relationship{name:'main achievements'}]->(n) return m.name, n.name limit 3"}, {"query": "Can you name the first three Chinese names of the young cows that eat old grass?", "cypher": "match (:ENTITY{name:'Tender cow eating old grass'}) - [:Relationship{name:'Chinese name'}]-> (n) with n order by n.name return n.name limit 3"}, {"query": "I'm not sure what the big blue root is, but I'm wondering if you can name the top 10?", "cypher": "match (:ENTITY{name:'Big Blue Root'}) --(n) return n.name order by n.name limit 10"}, {"query": "The first is that the people who are representing the country are the ones who are smiling and are very willing to count them.", "cypher": "match (:ENTITY{name:'smiling very much'}) <- [:Relationship{name:'representing work'}]- (h) return h.name skip 3"}, {"query": "What is the name of the accident in Beijing that is being investigated for suspected involvement in the accident?", "cypher": "match (:ENTITY{name:'related by someone'}) <- [:Relationship{name:'suspicious'}]- (h) return h.name"}, {"query": "Can you find me three books published by Henan People's Press?", "cypher": "match (:ENTITY{name:'People's Press of Henan'}) <- [:Relationship{name:'Publications'}]- ((n) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 3"}, {"query": "Can you tell me which schools in Zhejiang City, Guangdong have famous alumni?", "cypher": "match (:ENTITY{name:'Zhejiang City, Guangdong Province'}) <- [:Relationship{name:'the area'}]-(h),(h) - [:Relationship{name:'known alumni'}]->(x) return distinct x.name"}, {"query": "What does MCP mean?", "cypher": "match (:ENTITY{name:'MCP[content integrator]'}) - [:Tag{name:'tag'}]-> (m) return distinct m.name"}, {"query": "Do you know the Chinese name of the main achievement of this man, Galileo Galilei?", "cypher": "match (:ENTITY{name:'Galileo Cheryrae'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'main achievement'}]->(h) return h.name order by h.name limit 3"}, {"query": "Do you know the name of the law published in 1983?", "cypher": "match (:ENTITY{name:'1983'}) <- [:Relationship{name:' published date'}]- (n) return distinct n.name"}, {"query": "Can you tell me about the 3 07 new T-shirt shows?", "cypher": "match (:ENTITY{name:'07 new T-shirt show'}) --(h) with h order by h.name return distinct h.name skip 1 limit 3"}, {"query": "Do you know about the three-year guerrilla war in the Yangtze? What other information is there besides the war in the Yangtze Central Region of Fujian, please find the other 6 information in the 2nd layer", "cypher": "match (:ENTITY{name:'Three years of guerrilla war in the Yangtze'}) - [*1..2]->(p) where p.name <> 'Fujian Yangtze area' return p.name limit 6"}, {"query": "Do you know what is taboo in the case of hot, wet and temper tantrums?", "cypher": "match (:ENTITY{name:'true heat proof, wet heat proof and good temperament'}) <-[:Relationship{name:'taboo'}]-(p) return distinct p.name limit 1"}, {"query": "I'm wondering about this animal that belongs to the vertebrate family, can you tell me one of its English names?", "cypher": "match (:ENTITY{name:'backbone'}) <- [:Relationship{name:'backbone'}]- ((x) - [:Relationship{name:'English name'}]->(p) return p.name skip 2 limit 1"}, {"query": "What are the words to describe a city-loving man?", "cypher": "match (:ENTITY{name:'city-looking man or flower-looking man'}) --(x) return distinct x.name"}, {"query": "This person graduated from the Northeast Army Officer Training Corps, what are his main achievements that you know about?", "cypher": "match (:ENTITY{name:'Northeast Army Officer Training Class'}) <- [:Relationship{name:' Graduate School'}]-(q),(q) - [:Relationship{name:' Major Achievements'}]->(x) return x.name order by x.name limit 3"}, {"query": "Please, what keywords are relevant to 2013?", "cypher": "match (:ENTITY{name:'2013'}) <- [:Relationship{name:'time'}]- (x) return distinct x.name"}, {"query": "The book was published by Langley University Press and introduced me to two books.", "cypher": "match (:ENTITY{name:'Lancaster University Press'}) <- [:Relationship{name:'Publisher'}]-(p) - [:Relationship{name:'Book name'}]->(n) return distinct n.name limit 2"}, {"query": "The following is a list of the top 10 best online dating sites in the world.", "cypher": "match (:ENTITY{name:'18 years old going to heaven'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name limit 3"}, {"query": "The Chinese name of the top five immortal holy places?", "cypher": "match (:ENTITY{name:'non-destructive sacred'}) - [:Relationship{name:'Chinese name'}]-> (n) with n order by n.name return distinct n.name limit 5"}, {"query": "I want a profile of Zhang Yiqiang, born in 1985, in three levels of relationships?", "cypher": "match (n:ENTITY{name:'Zhang Qianlong'}) - [*1..3]->(x) where x.name <>'1985' return distinct x.name"}, {"query": "108 will find me five of the attributes of the hyper-fighting link tag?", "cypher": "match (:ENTITY{name:'108 will super fight'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "What is Shen Guangjian's profession?", "cypher": "match (:ENTITY{name:' Chen Kwon Jian'}) <--(q) - [:Relationship{name:' profession'}]->(m) return distinct m.name limit 1"}, {"query": "Please tell me which show is sold at 557 Liberation Avenue, 2206 Shandong Square?", "cypher": "Match (:ENTITY{name:'Relationship{name:'Tickets sold at address'}) - (n) return n.name"}, {"query": "Do you know what the main element of phosphate is?", "cypher": "match (:ENTITY{name:'nitrate'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'main elements'}]->(n) return distinct n.name"}, {"query": "Can you provide the following three articles on Oswaldo outside Brazil?", "cypher": "match (:ENTITY{name:'Oswaldo'}) --(m) with m order by m.name where m.name <> 'Brazil' return distinct m.name limit 3"}, {"query": "The 5/12 earthquake memorial wall, do you know when it will happen?", "cypher": "match ((:ENTITY{name:'5\u00b712 earthquake poem wall'}) - [:Relationship{name:'falling into time'}]-> (h) return h.name"}, {"query": "What other information is there about the Zuo Dong Collection of Books published by the Commercial Printing Library? Help me find the other 6 in the 3 layers.", "cypher": "match (:ENTITY{name:'Relationship*1..3]-(p) where p.name <> 'business printing library' return p.name limit 6"}, {"query": "Tell us about who Louis Cousteau is.", "cypher": "match (:ENTITY{name:'Lewis Coussey'}) --(p) return p.name order by p.name"}, {"query": "183 Shoe Industry Do you know? Introduce yourself to me in a word", "cypher": "match (:ENTITY{name:'183 show shoe industry'}) --(p) with p order by p.name return p.name limit 1"}, {"query": "Do you know which machines can be used for mechanical performance testing?", "cypher": "match (:ENTITY{name:'Mechanical performance test'}) <- [:Relationship{name:' application'}]- (p) return p.name"}, {"query": "I want to find six midfielders, tell me where they were born?", "cypher": "match (:ENTITY{name:'central defender'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'place of birth'}]->(n) return m.name, n.name limit 6"}, {"query": "What is the relationship if I get the four layers of relationships that are associated with swine flu?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:' if I get swine flu'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you tell me the first three?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "Do you know what tournaments are held in Winnipeg, Canada?", "cypher": "match (:ENTITY{name:'Winnipeg, Canada'}) <- [:Relationship{name:'location'}]- (q) return distinct q.name"}, {"query": "Do you know which earthquake reached a depth of 143 kilometers?", "cypher": "match (:ENTITY{name:'143 km'}) <- [:Relationship{name:'depth'}]- (q) return distinct q.name"}, {"query": "I'm not sure what kind of label is this, but I'm not sure what kind of label is this.", "cypher": "match (:ENTITY{name:'\u8bb8\u6b63\u5b81'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Tag{name:'tag'}]->(x) return distinct x.name limit 1"}, {"query": "Is there a chemical that is slightly soluble in water and can be mixed with ethanol or ethylene?", "cypher": "match (:ENTITY{name:'microsoluble in water, miscible with ethanol, ethanol'}) <- [:Relationship{name:'water soluble'}]- (h) return distinct h.name"}, {"query": "Can you find me two books published by Hai Publishing?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)."}, {"query": "The following is a list of literary works by Liu Yi-nan.", "cypher": "match (n:ENTITY{name:'submitted by Yuen Yan's'}) -[:Relationship*1..2]->(x) where x.name<>'literary work' return distinct x.name"}, {"query": "Can you recommend a car with a two-year warranty?", "cypher": "match (:ENTITY{name:'2 year unlimited km'}) <- [:Relationship{name:'warranty policy'}]- (m) return distinct m.name"}, {"query": "What are the names of the participants in the summit on March 28, 2011 at 10:00 am?", "cypher": "match (n:ENTITY{name:'28 March 2011 at 10 am'}) <- [:Relationship{name:'summary meeting'}]- (m) return m.name"}, {"query": "I'm curious about the three-layer relationship of hip neuroplasticity to neural pain caused by several diseases.", "cypher": "match (n:ENTITY{name:'Pulmonary nerve block'}) - [:Relationship*1..3]->(x) where x.name <> 'nerve pain caused by several diseases' return distinct x.name"}, {"query": "Can you help me find the poem written by Don Dey on the web?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database."}, {"query": "What else is on the Happy Bride label besides the drama and the film? Name three.", "cypher": "match (n:ENTITY{name:'happy bride'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'drama film' and h.name <> 'film work' return distinct h.name limit 3"}, {"query": "What are the different labels of each person? List them in order of their number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'Sun Hwang'}) - [:Relationship{name:'political appearance'}]->(:ENTITY) <- [:Relationship{name:'political appearance'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, ((r.name) OR collect BY cDER"}, {"query": "Can you help me find the next big name in the industry, Xu Zhongxun, and get a three-tiered relationship?", "cypher": "match (n:ENTITY{name:'Xue Zhong'}) - [*1..3]->(x) where x.name<>'industry person' return distinct x.name"}, {"query": "Can you name the eight cases that occurred on April 18, 2015?", "cypher": "match (:ENTITY{name:'18 April 2015'}) <- [:Relationship{name:'time'}]- (m) return m.name limit 8 The name of the match is not available."}, {"query": "I'm not sure if you can tell me about the five symbolism of the peak, but I can tell you about the other five symbolism of the peak, which are not just online novels and literature.", "cypher": "match (n:ENTITY{name:'Word'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'network novel' and h.name <> 'literature' return distinct h.name limit 5"}, {"query": "2009 Shanghai Political Science Study, in addition to the social science books, are there any other characteristic labels?", "cypher": "match (:ENTITY{name:'2009 Shanghai Political Law Research'}) --(x) with x order by x.name where x.name <> 'Sociology books' return x.name limit 5"}, {"query": "I'm not sure if you can tell me about the social event of the 9/11 robbery and murder.", "cypher": "match (:ENTITY{name:'11\u00b716 underground robbery murder case'}) --(n) with n order by n.name where n.name <> 'social event' return n.name"}, {"query": "I wonder how many companies were founded in 1998?", "cypher": "match (p:ENTITY{time:'1998'}) return count ((p)"}, {"query": "The following person Simek Karlo has three levels of relationships:", "cypher": "match (n:ENTITY{name:'Simek Karlo'}) - [*1..3]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "Do you know which song was released on 2015-8-28?", "cypher": "match (:ENTITY{name:'2015-8-28'}) <- [:Relationship{name:'release time'}]- (m) return distinct m.name"}, {"query": "Can you tell me about another feature of the 169 Forum besides the medical one?", "cypher": "match (h:ENTITY{name:'169 forum'}) --(q) with q order by q.name where q.name <> 'medicine' return q.name limit 1"}, {"query": "The company is also known for its online magazine, The Mystery Ocean, which is published by Jilin Publishing Group Ltd.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <> 'Jilin Publishing Group Limited' return distinct x.name"}, {"query": "Please tell me which village has an area of 0.92 square kilometers.", "cypher": "match (:ENTITY{name:'0.92 square kilometres'}) <- [:Relationship{name:'the village occupies the area'}]- (x) return x.name"}, {"query": "Do you know of any publications published in 2006/1/1? Can you tell me two?", "cypher": "match (:ENTITY{name:'2006/1/1'}) <- [:Relationship{name:' time of publication'}]- ((x),(x) - [:Relationship{name:' book name'}]->(q) return distinct q.name limit 2"}, {"query": "Do you know the main edible benefits of the foam mixture?", "cypher": "match (:ENTITY{name:'Pumpkin mist'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'mainly consumed power'}]->(n) return distinct n.name"}, {"query": "Which three major awards have been awarded to Shanghai Aluminum University of Technology?", "cypher": "match (:ENTITY{name:'Shanghai Aluminum Higher Specialist School'), a high-tech engineering school with a tradition and special characteristics, is located in Shanghai's Southwest Shenzhen River Estuary Emerging Technology Development Zone."}, {"query": "Do you know what the name of the relationship within the five layers that this person is involved in is?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'\u4f55\u5174\u821f'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "When was the first time in history that humans studied the properties of hydrogen in detail?", "cypher": "match (:ENTITY{name:' the first detailed study of the properties of hydrogen'}) <- [:Relationship{name:' event'}]- (q) return q.name"}, {"query": "I'm curious about the details of the four-tier relationship called the Four Seasons Shed in Chinese.", "cypher": "match (n:ENTITY{name:' four-season shed'}) - [*1..4]->(x) where x.name <> ' four-season shed' return distinct x.name limit 5"}, {"query": "Can you tell us which are the main departments of the Faculty of Economics of the Tibetan National University?", "cypher": "match (:ENTITY{name:'School of Finance at the Tibetan National University'}) - [:Relationship{name:'Main Faculty'}]-> (p) return p.name order by p.name"}, {"query": "There is a case called 7/1 Burma Mandalay fiber EDA good township riots case", "cypher": "match (:ENTITY{name:'7 / 1 Burma Mandalay fiber EDA good township riots'}) <- [:Relationship{name:'foreign name'}]- (h) return distinct h.name"}, {"query": "What is the shortest relationship path between the 3rd and 3rd levels of Escape the Fate?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortest paths'}) - [*..3]-(b:ENTITY{name:'shortest paths'})) return count ((p)"}, {"query": "Do you know the Chinese name for rainbow love?", "cypher": "match (:ENTITY{name:'Relationship{name:'Chinese name'}]-> (q) with q order by q.name return distinct q.name"}, {"query": "13131 is a weird name for a music album, do you know that?", "cypher": "match (:ENTITY{name:'13131 [Chen Ling's seventh album]'}) --(q) with q order by q.name where q.name <> 'music' return q.name"}, {"query": "I need information about the relationship between the three layers of the Basic Training and Teaching of Ballet published by Shanghai Music Publishing.", "cypher": "match (n:ENTITY{name:'Basic training and teaching of ballet'}) - [:Relationship*1..3]->(x) where x.name<>'Shanghai Music Publishing' return distinct x.name"}, {"query": "Can you tell me where the scope of the first aid for cardiac asthma is?", "cypher": "match (:ENTITY{name:'Cardiac Asthma Emergency'}) <- [:Relationship{name:'Chinese name'}]- ((n),(n) - [:Relationship{name:'Scope of application'}]->(x) return distinct x.name limit 1"}, {"query": "Can you give me a list of the top ten T-series products from TCL?", "cypher": "match (h) <- [:Relationship{name:' Chinese name'}]-(m) where substring ((h.name, 0,5)='TCL T' return distinct m.name limit 10"}, {"query": "Do you remember what kind of insurance is valid for 10 days?", "cypher": "match (:ENTITY{name:'10 days'}) <- [:Relationship{name:' valid for a period of time'}]- (x) return distinct x.name"}, {"query": "What conferences or competitions have been held in the cities of Kho and Phat in Inner Mongolia?", "cypher": "match (:ENTITY{name:'Inner Mongolia Autonomous Region Khost and Khent City'}) <- [:Relationship{name:'Holding place'}]- (x) return x.name"}, {"query": "What are the features of the apartment?", "cypher": "match (:ENTITY{name:'levels'}) - [:Relationship{name:'attributes'}]->(n) return n.name as name union all match (:ENTITY{name:'levels'}) - [:Relationship{name:'levels'}]->(m) return m.name as name"}, {"query": "Find out what type of product they are, what kind of laptop they are, what kind of product they are.", "cypher": "match (:ENTITY{name:' notebook'}) <- [*]-(m), (m) - [:Relationship{name:' product type'}]->(n) return m.name, n.name limit 6"}, {"query": "Who can write five tags for the 0746 recruitment network?", "cypher": "match (:ENTITY{name:'0746 recruitment network'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "I'm not sure what Fan Qiao Hua does for a living.", "cypher": "match (:ENTITY{name:'fan\u5251\u534e'}) <--(x) -[:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 5"}, {"query": "Please give us 10 articles about Cloud Wang.", "cypher": "match (:ENTITY{name:'CLOUD WANG'}) --(h) return distinct h.name limit 10 is the name of the game"}, {"query": "The name of the pilot, who is also known as \"Ch\u014dsh\u016b-no-Hokuto\", is not mentioned in the book.", "cypher": "match (n:ENTITY{name:'flying officer's name'}) - [:Relationship{name:' alias'}]->(h) where h.name <> 'sea turtle king' and h.name <> 'northern nose' return distinct h.name limit 3"}, {"query": "What lists have been released by the China 500 Summit Forum in 2015?", "cypher": "match (:ENTITY{name:'2015 China 500 Summit Forum'}) <- [:Relationship{name:'release forum'}]- (m) return distinct m.name"}, {"query": "Do you know how many labels are on aquatic life?", "cypher": "match ((:ENTITY{name:' aquatic organism'}) - [:Tag{name:' tag'}]-> (n) return n.name order by n.name"}, {"query": "Tell me about the school that won the main award for the National Peace and Conflict Campus Advanced Collective?", "cypher": "match (:ENTITY{name:'National Peace and Conflict Campus Advanced Collective'}) <- [:Relationship{name:'main award'}]- (n) return distinct n.name"}, {"query": "Can I get two copies of the book published by Qingdao Publishing?", "cypher": "match (:ENTITY{name:'Qing Island Publishing House'}) <- [:Relationship{name:'Publishing House'}]-(x),(x) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 2"}, {"query": "Please introduce me to the people of the village.", "cypher": "match (:ENTITY{name:' village'}) --(m) return m.name skip 1"}, {"query": "Can you tell me one thing about this 182-cm man, his nickname?", "cypher": "match (:ENTITY{name:'182cm'}) <- [:Relationship{name:'height'}]-(n),(n) - [:Relationship{name:'alias'}]->(q) return q.name order by q.name limit 1"}, {"query": "Do rural villagers have Chinese names?", "cypher": "match (:ENTITY{name:'Kinohara'}) - [:Relationship{name:'Chinese name'}]-> (h) with h order by h.name return distinct h.name"}, {"query": "What are the possible labels for 1050-2009?", "cypher": "match (x:ENTITY{name:'1050-2009'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'single' return h.name"}, {"query": "How much do you know about the 12/12 textile factory collapse in Alexandria, Egypt?", "cypher": "match (:ENTITY{name:'12\u00b712 Egypt Alexandria textile plant collapse'}) --(x) with x order by x.name return x.name"}]