[{"query": "What do you mean, -40\u00b0C cold storage?", "cypher": "match (x:ENTITY{name:'-40\u00b0C cold storage box'}) --(m) with m order by m.name return m.name"}, {"query": "What is the name of the long novel by Swiss author Johanna Spyri?", "cypher": "match (:ENTITY{name:'swiss-born Johanna Spyri'}) <- [:Relationship{name:'author'}]-(m), (m) - [:Relationship{name:'literary genre'}]->(n) where n.name='long novel' return distinct m.name"}, {"query": "Social Activities 111. What are the labels for the Yukon Song Festival?", "cypher": "match (:ENTITY{name:'111\u00b7Oceanese Song Festival'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'social activity' return q.name"}, {"query": "I'm now curious about Kawai Namori's whole story.", "cypher": "match (:ENTITY{name:'Kuwaina's name'}) --(x) return x.name skip 3"}, {"query": "MarineKing is a professional eSports player in StarCraft 2, do you know what his main achievements are?", "cypher": "match (:ENTITY{name:'MarineKing is a professional eSports player, formerly known as Lee Jong-hoon, and a top Korean player. \u25b2'})"}, {"query": "What kind of aircraft is the B-17 bomber?", "cypher": "match (:ENTITY{name:'B-17 bomber'}) <- [:Relationship{name:'former type'}]- (p) return distinct p.name"}, {"query": "Do you know what the mint brain is also called?", "cypher": "match (:ENTITY{name:'mint brain'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'other name'}]->(q) return distinct q.name"}, {"query": "Can you recommend a service-based software for me?", "cypher": "match (h:ENTITY{name:' service'}) <- [:Relationship{name:' software property'}]- (q) return q.name"}, {"query": "Can you tell me which film and TV series have Kenji Kobayashi and Hiroyuki Hiroyuki as main voices?", "cypher": "match (:ENTITY{name:'Relationship{name:'main voice'}}) - (h) return distinct h.name"}, {"query": "Have you been to the 0.8 Live Live site?", "cypher": "match (:ENTITY{name:'0.8 live'}) --(p) with p order by p.name where p.name <> 'website' return p.name"}, {"query": "Help me find a condensed antonym.", "cypher": "match (:ENTITY{name:'consolidate'}) <- [:Relationship{name:'anti-word'}]-(m) return distinct m.name"}, {"query": "Can you list the top 10 achievements of Jia Yuliu?", "cypher": "match (:ENTITY{name:'Jia Yuliu'}) <- [:Relationship{name:'Chinese name'}]- ((h) - [:Relationship{name:'main achievements'}]->(p) return distinct p.name limit 10"}, {"query": "I want to know when the Big Star Company opened.", "cypher": "match (p:ENTITY{name:'Pai Da Star Company'}) return p.time The name of the match is"}, {"query": "Can anyone explain the main achievements of Wang Xiaolu?", "cypher": "match (:ENTITY{name:'Wang Xiaoyu'}) <- [:Relationship{name:'Chinese name'}]- ((h) - [:Relationship{name:'main achievements'}]->(n) return distinct h.name"}, {"query": "Can you recommend a tablet with 1GB of DDR3 cache in 2 systems?", "cypher": "match (:ENTITY{name:'1GB DDR3 cache'}) <- [:Relationship{name:'system memory'}]- (x) return x.name limit 2 The name of the file is not available"}, {"query": "Find out 310 pages of high school political basics and breakthroughs/how to get started in the three-tiered relationship.", "cypher": "match (n:ENTITY{name:'high school political basics and breakthroughs'}) - [:Relationship*1..3]->(x) where x.name <>'310 pages' return distinct x.name"}, {"query": "Is there any business called Beijing Xiangda Fire Engineering Co., Ltd?", "cypher": "match (n:ENTITY{name:'Beijing Xianganda Fire Engineering Co. Ltd'}) where n is not null return 1"}, {"query": "Did you know that Liu Jian is a cook by profession?", "cypher": "match (x:ENTITY{name:'Relationship{name:'profession'}]-> (p) return p.name order by p.name"}, {"query": "Can you recommend 7 games for $1.29?", "cypher": "match (:ENTITY{name:'$1.29'}) <- [:Relationship{name:' game current price'}]- (x) return x.name limit 7"}, {"query": "Do you want to know the 5 elements of the 4 layer relationship that are related to the Chinese work titled \"Shanghai Shifu\"?", "cypher": "match (n:ENTITY{name:'Schools are not used to teaching'}) - [*1..4]->(x) where x.name<> 'Schools are not used to teaching' return distinct x.name limit 5"}, {"query": "Do you know where the 10 Tibetan-speaking regions are?", "cypher": "match (:ENTITY{name:' in Tibetan'}) <- [*]-(m), (m) - [:Relationship{name:' geographical location'}]->(n) return m.name, n.name limit 10"}, {"query": "Can you name one person other than Anna Chapman and Sergey Sobyanin?", "cypher": "match (n:ENTITY{name:'Costorrom National University'}) - [:Relationship{name:'known alumni'}]->(h) where h.name <> 'Anna Chapman' and h.name <> 'Sergei Sobyanin' return distinct h.name limit 1"}, {"query": "A list of 1+1 easy wins; Optimized training: 7th grade math book labels?", "cypher": "match (:ENTITY{name:'1+1 easily crowned; optimized training: 7th grade math'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'books' return n.name"}, {"query": "How long is the entire journey on Shenzhen Expressway?", "cypher": "match (:ENTITY{name:'Shenzhen Highway'}) - [:Relationship{name:'full length'}]->(n) return n.name as name union all match (:ENTITY{name:'Shenzhen Highway'}) - [:Relationship{name:'passage date'}]->(m) return m.name as name"}, {"query": "What is the common name of the sea water cliff? Can you name three?", "cypher": "match (:ENTITY{name:'Heavy River Cliff'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Relationship{name:'Local name'}]->(h) return h.name order by h.name limit 3"}, {"query": "One incident occurred in a student dormitory building in the Xuehui campus of Shanghai Business School, and the accident was called \"What's up?\"", "cypher": "match (:ENTITY{name:' Student dormitory building at Xu Hui Campus of Shanghai Business School'}) <- [:Relationship{name:' event address'}]- (p) return p.name"}, {"query": "What job is responsible for the daily updates and content editing of the app?", "cypher": "match (x:ENTITY{name:'APP daily updates, content editing etc. '}) <- [:Relationship{name:' content'}]- (q) return distinct q.name"}, {"query": "What is Diana Tomlinder's profession?", "cypher": "match (:ENTITY{name:'Diana Tomlind'}) <- [:Relationship{name:'Chinese name'}]- ((q) - [:Relationship{name:'profession'}]->(n) return distinct n.name"}, {"query": "What is the name of the county civil affairs office at 2 Longqing Street in Lower Temple Town, Khejiang County?", "cypher": "match (:ENTITY{name:'Kembang County Lower Temple Town Lungqing Street 2'}) <- [:Relationship{name:'residence'}]-(p),(p) - [:Relationship{name:'abbreviated'}]->(m) where m.name <> 'County Civil Affairs' return distinct m.name limit 1"}, {"query": "Who are the players?", "cypher": "match (:ENTITY{name:' current player'}) <--(n) return n.name"}, {"query": "I was asked to provide 20 relevant information about the Liaoning Institute of Technology in three layers, and the results were sorted in descending order.", "cypher": "match (:ENTITY{name:'Leningrad Polytechnic University'}) - [*1..3]-(p) return p.name order by p.name DESC limit 20"}, {"query": "Do you know what other major accomplishments Xu Ma Ting has besides being a deputy fire department investigator and the commander of the Shandong Provincial Fire Brigade?", "cypher": "match (n:ENTITY{name:'\u8bb8\u5146\u4ead'}) - [:Relationship{name:'main achievements'}]->(h) with h order by h.name where h.name <> 'Deputy-level investigator of the Department of Fire Protection' and h.name <> 'Captain of the Shandong Provincial Fire Protection' return h.name limit 2"}, {"query": "Please give me 5 tips for romance novels.", "cypher": "match (:ENTITY{name:'speech novel'}) --(n) return n.name order by n.name limit 5"}, {"query": "What is the name of the game made by Sierra Attraction?", "cypher": "match (:ENTITY{name:'Sierra Attraction'}) <- [:Relationship{name:'game making'}]- (p) return distinct p.name"}, {"query": "The school at 186 South Tai-Shan Street in Rincun, Sichuan province, belongs to which school?", "cypher": "match (:ENTITY{name:'186 South Street, Taizhan, Sichuan, Sichuan Province) <- [:Relationship{name:'school address'}]- ((x),(x) - [:Relationship{name:'attributes'}]->(p) return distinct p.name limit 1"}, {"query": "Can anyone tell me who wrote the long-winded wind chimes?", "cypher": "match (q:ENTITY{name:'the rainbow'}) --(n) return n.name order by n.name"}, {"query": "Is there anyone who calls upon the name of the Most Merciful?", "cypher": "match (n:ENTITY{name:'Wang Fu Min'}) where n is not null return 1"}, {"query": "Help me find a floor that absorbs less water, is wear resistant, has a good material and color balance on both sides", "cypher": "match (:ENTITY{name:'lower water absorption, better wear resistance'}) <- [:Relationship{name:'advantages'}]-(m), (m) - [:Relationship{name:'named'}]->(n) where n.name='matching material and shade of the positive and negative sides' return distinct m.name"}, {"query": "I'm not sure if you're familiar with the topic.", "cypher": "match (n:ENTITY{name:'read the sky'}) --(x) return x.name"}, {"query": "What does the ancestral culture symbolize?", "cypher": "match (:ENTITY{name:'ancestral culture'}) - [:Relationship{name:'symbol'}]->(m) return distinct m.name"}, {"query": "Can you help me find two books by Liu Xiaobo?", "cypher": "match (:ENTITY{name:'\u798f\u7965'}) <- [:Relationship{name:'author'}]-(x),(x) - [:Relationship{name:'book name'}]->(q) return distinct q.name limit 2"}, {"query": "I bet you that this song was written for the military department of the new district of Zhejiang, sung by Zhao Yan, and I want 4 more information about this song.", "cypher": "match (n:ENTITY{name:'\u4e1c\u6253'}) -->(h) with h order by h.name where h.name <> '\u5e06' and h.name <> 'The song was written for the Military Department of the New Territory of the Pacific Ocean."}, {"query": "This question is about the English name for tubular bowel cancer, would you?", "cypher": "match ((:ENTITY{name:'tubal gland tumor [colon]'}) - [:Relationship{name:' English name'}]-> (h) return h.name"}, {"query": "Can you name some of Peng Jiabi's most representative works?", "cypher": "match (p:ENTITY{name:'Peng Jiabi'}) <- [:Relationship{name:'English name'}]- ((q) - [:Relationship{name:'represents work'}]->(h) return distinct h.name"}, {"query": "What is the shortest relationship path between the two layers of the sea turtle and the tide turtle?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'seahorse family'}) -[:Relationship*..2]-(b:ENTITY{name:'seahorse family'})) return count ((p)"}, {"query": "Did you have trouble recommending a few free-to-play games?", "cypher": "match (:ENTITY{name:'free to operate'}) <- [:Relationship{name:'free to operate'}]- (m) return distinct m.name"}, {"query": "Do you know who is the head of urology?", "cypher": "match (p:ENTITY{name:'urology'}) <--(x) -->(q:ENTITY{name:'physician in charge'}) return x.name"}, {"query": "Can you recommend a software that has photo storage, diary keeping, music uploading?", "cypher": "match (:ENTITY{name:' photo storage, diary writing, music upload'}) <- [:Relationship{name:' service'}]- (q) return distinct q.name"}, {"query": "What exhibition is on view from 06/09/2011 to 06/11/2011?", "cypher": "match (:ENTITY{name:'2011/6/9 to 2011/6/11'}) <- [:Relationship{name:'exhibition time'}]- (x) return distinct x.name"}, {"query": "Do you know which accident killed two people and injured three?", "cypher": "match (:ENTITY{name:'2 killed, 3 wounded'}) <- [:Relationship{name:'death'}]- (q) return distinct q.name"}, {"query": "Can you find out the names of 10 alumni of Guangxi Master's University? Please help me introduce them.", "cypher": "match (:ENTITY{name:'Cantonese Teachers' University'}) <- [*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name, n.name limit 10"}, {"query": "What is a watercolor dam? You told me about the first eight articles.", "cypher": "match (:ENTITY{name:' ink tank'}) --(h) return h.name order by h.name limit 10"}, {"query": "What are the four main ingredients of the cook besides the cooked chicken and the bean soup?", "cypher": "match (n:ENTITY{name:'Lon's Three and His Seven's Party'}) - [:Relationship{name:'starred'}]->(h) where h.name <> 'Fujir\u014d Y\u014d' and h.name <> 'Yajiro Saken' return distinct h.name limit 4"}, {"query": "What kind of work does Jinliang do? Can you tell me no?", "cypher": "match (:ENTITY{name:'Jinliang'}) <- [:Relationship{name:'foreign language name'}]- ((x) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 1"}, {"query": "What earthquakes have a magnitude of 39.5?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Give me three principles for the design and application of interest rate derivatives: case analysis, and other relevant information besides the mechanical industry publisher.", "cypher": "match (:ENTITY{name:'Design and application of interest rate derivatives: case analysis'}) --(m) with m order by m.name where m.name <> 'Machinery industry publisher' return distinct m.name limit 3"}, {"query": "What is the basic information about the three levels of relationship of Nitzan Nitamar?", "cypher": "match (n:ENTITY{name:'Nitzan Nitamar'}) - [*1..3]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "I'm going to give you a brief introduction to two of the most powerful contemporary oil painters.", "cypher": "match (:ENTITY{name:'painter'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return m.name,n.name limit 2"}, {"query": "Who are the representative works of the puppetry of Bobby Pope?", "cypher": "match (:ENTITY{name:'Bobby Pope High School's mother's name'}) <- [:Relationship{name:'represents work'}]- (x) return x.name order by x.name limit 5"}, {"query": "Do you know which list Gautam Ganguly won?", "cypher": "match (:ENTITY{name:'Kachin'}) <- [:Relationship{name:'champion'}]- (q) return distinct q.name"}, {"query": "Do you know of any places that have a two-link link to the organization?", "cypher": "match (n) - [:Tag*2{name:'tag'}]->(p:ENTITY{name:'organization'}) RETURN distinct n.name limit 3"}, {"query": "Do you know what kind of relationships are in the three layers?", "cypher": "The following is a list of all the different ways The Winner is credited in the database:"}, {"query": "I'm going to tell you about one of the famous places in Danyang eight.", "cypher": "match (:ENTITY{name:'Danyang eight'}) <- [:Relationship{name:'foreign language name'}]-(p) - [:Relationship{name:'famous attractions'}]->(q) return q.name order by q.name limit 1"}, {"query": "What are the 70 minute movies you can recommend?", "cypher": "match (:ENTITY{name:'70 minutes'}) <- [:Relationship{name:'long'}]- (h) return h.name limit 3 The game is played in a single round-robin format."}, {"query": "The Chinese name is Li, and what is his profession?", "cypher": "match (:ENTITY{name:'\u674e\u6743'}) <- [:Relationship{name:' Chinese name'}]- ((h) - [:Relationship{name:' profession'}]->(m) return distinct m.name"}, {"query": "Can you help me find out about the 29th secondary school in Jiko City?", "cypher": "match (:ENTITY{name:'Jokogawa City Secondary School'}) - [*1..2]-(p) return p.name limit 5"}, {"query": "What are the publications published by Yunnan People's Press? What is the price? Please list 5 for me.", "cypher": "match (:ENTITY{name:'Yunnan People's Press'}) <- [:Relationship{name:'Publish'}]-(h),(h) - [:Relationship{name:'Pricing'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Help me find 10 species of seagulls", "cypher": "match (:ENTITY{name:'seahorse family'}) <- [:Relationship{name:'seahorse family'}]-(m) return distinct m.name limit 5"}, {"query": "I'm going to be a little bit more specific about the subject of the post, but I'm going to be more specific about the subject of the post, which is the subject of the post.", "cypher": "match (n:ENTITY{name:' and the next after the spring'}) - [*1..2]->(x) where x.name <>'seven-line' return distinct x.name"}, {"query": "What other people are there in the labels of Deng Xiaoping besides martyrs and figures?", "cypher": "match (n:ENTITY{name:'Tag'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'martyr' and h.name <> 'person' return distinct h.name limit 2"}, {"query": "I'm interested in the 100 ton forest puzzle, can you tell me about it?", "cypher": "match (:ENTITY{name:'100 tonnes of forest puzzle'}) --(m) with m order by m.name return m.name"}, {"query": "Please help me find all the information about the KF-9-AMP assault rifle.", "cypher": "match (n:ENTITY{name:'KF-9-AMP assault rifle'}) --(x) return distinct x.name"}, {"query": "Who is the director, writer and lead actor of the film Perfect Guy for me?", "cypher": "Match (:ENTITY{name:'perfect guy'}) - [:Relationship{name:'director'}]->(n) return n.name as name union all match (:ENTITY{name:'perfect guy'}) - [:Relationship{name:'writer'}]->(m) return m.name as name union all match (:ENTITY{name:'perfect guy'}) - [:Relationship{name:'actor'}]-(r>) return r.name as name"}, {"query": "What is the name of this drug called horseweed?", "cypher": "The name of the drug is \"Relationship\" (Relationship) and the name of the drug is \"Relationship\" (Relationship)."}, {"query": "The company's profile is listed in the three-tier organization of Hangzhou Hangzhou Liu Yun Technology Co., Ltd.", "cypher": "match (n:ENTITY{name:'Hangzhou Hangzhou Cloud Technologies Co., Ltd'}) - [*1..3]->(x) where x.name <> 'organization' return distinct x.name"}, {"query": "I am going to the 2010 Guangzhou International Home Decorations and Furniture Exhibition in China, can you tell me where it is?", "cypher": "match ((:ENTITY{name:'2010 China Guangzhou International Home Decorations, Home Decorating Exhibition'}) - [:Relationship{name:' Exhibition Location'}]-> (q) return q.name"}, {"query": "Can you find 10 plants with sub-plant lines, twin-leafed plants?", "cypher": "match (:ENTITY{name:' by sub-plant gate'}) <- [:Relationship{name:' gate'}]- (mn) - [:Relationship{name:' programme'}->(n:ENTITY{name:' by twin leaf plant gate'}) return mn.name order by mn.name limit 10"}, {"query": "Please tell me 10 things you know about the Ujian-Zhongshan Strait.", "cypher": "match (:ENTITY{name:'Ujiangjiang Dragon Gorge'}) --(p) return p.name limit 10 The name of the game is \"Ujiang Dragon Gorge\""}, {"query": "Can you name three types of chemicals with the EINECS registration number 000-000-0?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "I'm not sure what kind of job I can sell, but I'm not sure what kind of job I can sell.", "cypher": "match (n:ENTITY{name:'\u590f\u4e0d\u51e1'}) <- [:Relationship{name:'Chinese name'}]- ((x) - [:Relationship{name:'profession'}]->(h) return distinct x.name"}, {"query": "Help me find three southern lions.", "cypher": "match (:ENTITY{name:'Southpaw'}) <- [:Relationship{name:'at the time'}]-(m), (m) - [:Tag{name:'tag'}]->(n) where n.name='artist' return distinct m.name limit 3"}, {"query": "Who won the award for the best TV show in 2003?", "cypher": "match (:ENTITY{name:'2003 Best Television Show Creative Award'}) --(x) return distinct x.name"}, {"query": "Can you name 10 exhibitions in Quanzhou, China?", "cypher": "match (:ENTITY{name:'China's Spring Valley'}) <- [:Relationship{name:'Exhibition city'}]- (n) return n.name limit 10"}, {"query": "Tell me about the top 10 labels for the Encyclopedia of babies aged 0-6 years old?", "cypher": "match (:ENTITY{name:'0-6 years old baby encyclopedia'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 10"}, {"query": "Please find the vocabulary shortcuts at level 1-4 and the annotation labels in addition to the publications.", "cypher": "match (:ENTITY{name:'1-4 level vocabulary library'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'publication' return m.name"}, {"query": "Please help me find the other 6 pieces of information in the 2 layers of this cliffhanger musical piece.", "cypher": "match (:ENTITY{name:' cliff face'}) - [:Relationship*1..2]-(p) where p.name <> 'musical work' return p.name limit 6"}, {"query": "Tell me one of the iconic works of Miyamoto Gao that doesn't include Survivors and Lifesaving, please.", "cypher": "match (n:ENTITY{name:'Michelle Gauss'}) - [:Relationship{name:'representative work'}]->(h) where h.name <> 'survivor' and h.name <> 'life-saving solution' return distinct h.name limit 1"}, {"query": "Can you tell me which relationships are covered in the second issue of the Heat Diary in the two layers?", "cypher": "The following pages link to The Unknown:"}, {"query": "I'm wondering what kind of chemical is CAS No. 1076-38-6?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "The main protagonists of the game are Senkawa-chan and Qin Yusaku, but who are the other two?", "cypher": "match (n:ENTITY{name:'Wolf Game 2: Beast Camp'}) - [:Relationship{name:'starred'}]->(h) where h.name <> 'Senshagawa-chan' and h.name <> 'Ainami-chan' return distinct h.name limit 2"}, {"query": "The following is a list of all the different ways Fernandes Bruno, a Lisbon-born, is credited in the database:", "cypher": "match (n:ENTITY{name:'Fernandes Bruno'}) - [:Relationship*1..3]->(x) where x.name<>'Lisbon' return distinct x.name"}, {"query": "Do you know what Sebastian James stands for?", "cypher": "match (:ENTITY{name:'Sebastian James'}) - [:Relationship{name:'represents work'}]-> (p) return p.name skip 2"}, {"query": "Can you name a year in which Tsing Tzu is in office?", "cypher": "Match (:ENTITY{name:'Relationship{name:'Dynasty'}) - (h) return h.name"}, {"query": "Can you help me find out about the 5 levels of relationships and the novelist's novel about the cheap barbaric wife?", "cypher": "match (n:ENTITY{name:'spouse of a downtrodden man'}) - [*1..5]->(x) where x.name <>'please' return distinct x.name limit 5"}, {"query": "What are the main awards that this independent high school has won? Can you name 5?", "cypher": "match (:ENTITY{name:' independent high school'}) <- [:Relationship{name:' category'}]-(p) - [:Relationship{name:' major award'}]->(h) return h.name order by h.name limit 5"}, {"query": "I'm going to be a little bit more specific about this, but I'm going to be a little more specific about this, because I'm going to be a little bit more specific about this.", "cypher": "match (n:ENTITY{name:' and bamk-khyun\u00b7efet-yin a song'}) - [:Relationship*1..2]->(x) where x.name <> 'jack-john' return distinct x.name"}, {"query": "Do you know what projects are being paid for by WEBLCC?", "cypher": "match (:ENTITY{name:' undertaken by WEBLCC entity'}) <- [:Relationship{name:' fees and costs'}]- (x) return x.name"}, {"query": "What are the top five achievements of Chinese talents?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]- ((q),(q) - [:Relationship{name:'main achievements'}]->(n) return distinct n.name limit 5"}, {"query": "The question is, what are the three categories of dry bread besides bread and breakfast?", "cypher": "match (n:ENTITY{name:'peeled grape bread'}) -[:Relationship{name:'categorized'}]->(h) where h.name <> 'bread' and h.name <> 'breakfast' return distinct h.name limit 3"}, {"query": "Can you recommend 15 Japanese variety shows and dramas?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'country area'}]- (x) return x.name limit 15"}, {"query": "The Amber Year China Network Radio Association was founded by Deng Dong on December 12, 2014.", "cypher": "match (n:ENTITY{name:'Amber Year China Network Radio Association'}) -->(h) with h order by h.name where h.name <> '2014/12/12' and h.name <> 'Bei Dong' return h.name limit 5"}, {"query": "How can you change yourself when the world cannot change?", "cypher": "match (:ENTITY{name:'15 Change yourself when the world can't change'}) --(q) with q order by q.name return q.name"}, {"query": "The compound called sodium chloride. Do you know its chemical formula?", "cypher": "match ((:ENTITY{name:'regular phosphate salts'}) - [:Relationship{name:'chemical formula'}]-> (q) return q.name"}, {"query": "Can you give me the top five marks in chemistry at the Autumn Class of '05?", "cypher": "match (:ENTITY{name:'05 autumn subject person senior secondary high school chemistry'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "What chemical is C9H19NaO3S?", "cypher": "The name of the function is the name of the function itself."}, {"query": "How much do you know about this man's occupation? Can you name 10?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(p),(p) - [:Relationship{name:'profession'}]->(q) return q.name order by q.name limit 10"}, {"query": "Do you know anything about Xiaoao's nationality and where she was born?", "cypher": "match (:ENTITY{name:' in Xiaoyua'}) - [:Relationship{name:' nationality'}] ->(n) return n.name as name union all match (:ENTITY{name:' in Xiaoyua'}) - [:Relationship{name:' place of birth'}) ->(m) return m.name as name"}, {"query": "The book is published by which publisher?", "cypher": "match (:ENTITY{name:'Keyword'}) <- [:Relationship{name:'book'}]- ((p) - [:Relationship{name:'publisher'}]->(n) return distinct n.name"}, {"query": "Do you know which organizations are hosting the 2011 China International Entrepreneurship Expo in Guangzhou?", "cypher": "match ((:ENTITY{name:'2011 China [Guangzhou] International Entrepreneurship Fair'}) - [:Relationship{name:'host entity'}]-> (h) return h.name"}, {"query": "What are the three categories of fast food soap apart from fast food and soap?", "cypher": "match (n:ENTITY{name:'fast-food soap'}) -[:Relationship{name:' classified'}]->(h) where h.name <> 'fast-food' and h.name <> 'soap' return distinct h.name limit 3"}, {"query": "Do you know the meaning of the word \"sick and tired\"? What kind of literary genre is it?", "cypher": "match (:ENTITY{name:'spanish'}) <- [*]-(m), (m) - [:Relationship{name:'spanish'}]->(n) return m.name, n.name limit 5"}, {"query": "Who is the creator of the Guinness World Record for the largest canopy?", "cypher": "match (:ENTITY{name:'Relationship' name:'Originator'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship' name:'Release time'}) ->(m) return m.name as name"}, {"query": "Do you know the name of the military college where Admiral Shavranov is stationed?", "cypher": "match (m:ENTITY{name:'Admiral Shavranov'}) <- [:Relationship{name:'known alumni'}]- (x) return x.name"}, {"query": "I'm curious to know which novels are being re-released?", "cypher": "The title of the novel is \"The Story of a Girl\" by the author of the novel, which is also the title of the novel."}, {"query": "What is the name of the person born on Christmas Day?", "cypher": "match (:ENTITY{name:'Christmas'}) <- [:Relationship{name:'birthday'}]- ((m) - [:Relationship{name:'alias'}]->(q) return distinct m.name"}, {"query": "Can you give me a list of the top 10 artists in the video?", "cypher": "match (:ENTITY{name:' art direction'}) --(q) return q.name order by q.name limit 10"}, {"query": "Can you tell me about the three professions of this Chinese person?", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(q) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 3"}, {"query": "Can you give me three pieces of information about the small-act counterattack?", "cypher": "match (:ENTITY{name:' small character counterattack'}) --(m) with m order by m.name return m.name limit 3"}, {"query": "Do you know of any hotels that have facilities and services with extra beds?", "cypher": "match (n:ENTITY{name:'child bed'}) <- [:Relationship{name:' facilities and services'}]- (h) return h.name limit 10"}, {"query": "What are the main achievements and representative works of Kenneth David Kaunda?", "cypher": "match (:ENTITY{name:'Kenneth David Kaunda'}) - [:Relationship{name:' Major achievements'}]->(n) return n.name as name union all match (:ENTITY{name:'Kenneth David Kaunda'}) - [:Relationship{name:'representing work'}]->(m) return m.name as name"}, {"query": "Do you know what football has to do with the second tier sporting program?", "cypher": "match (n) - [:Relationship*2{name:' sporting project'}]->(p:ENTITY{name:' football'}) RETURN distinct n.name"}, {"query": "What companies are in Shenzhen?", "cypher": "match (p:ENTITY{location:' deep'}) return p.name"}, {"query": "Can you find the 5 colleges that offer medical courses?", "cypher": "match (:ENTITY{name:'pharmaceutical class'}) <- [*]-(m), (m) - [:Relationship{name:'region'}]->(n) return distinct m.name, n.name limit 5"}, {"query": "Can you name the relationships within the three layers that Jos\u00e9 Padilha covers?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)"}, {"query": "The monotypic brown-browed mulberry belongs to what family and is mainly distributed in which regions?", "cypher": "match (:ENTITY{name:'Relationship{name:'subclass'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'distribution area'}) ->(m) return m.name as name"}, {"query": "I wonder if there are people who were born in Taiwan? Can you give me five examples?", "cypher": "match (:ENTITY{name:' Taiwan'}) <- [:Relationship{name:' place of birth'}]-(p) - [:Relationship{name:' Chinese name'}]->(n) return distinct n.name limit 5"}, {"query": "I would like to know about five historical figures and their personal details related to Ma Zhenzhen.", "cypher": "match (n:ENTITY{name:'Mary'}) - [*]->(x) where x.name <> 'historical person' return distinct x.name limit 5"}, {"query": "Please provide information on the two-tier relationship related to the management of the Shenzhen Municipal Basic Agricultural Reserve (MAPR) issued by the Shenzhen Municipal Government.", "cypher": "match (n:ENTITY{name:'Shenzhen City Basic Farmland Reserve Management Measures'}) - [*1..2]->(x) where x.name<>'Shenzhen City Government' return distinct x.name"}, {"query": "Can you tell me about the five Chinese names of the most representative works of deaf musicians?", "cypher": "match (:ENTITY{name:'ears'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'representative work'}]->(h) return h.name order by h.name limit 5"}, {"query": "What is the name of the county?", "cypher": "match (:ENTITY{name:'Canton of the Philippines'}) <- [:Relationship{name:'alias'}]-(m) return distinct m.name"}, {"query": "Help me find 10 physicists.", "cypher": "match (:ENTITY{name:'physician'}) <- [:Tag{name:'tag'}]-(m) return distinct m.name limit 10"}, {"query": "What are the major achievements of people born in 1971?", "cypher": "match (:ENTITY{name:'1971'}) <- [:Relationship{name:'date of birth'}]- ((x),(x) - [:Relationship{name:'main achievement'}]->(q) return q.name order by q.name limit 1"}, {"query": "Can you tell me what reports the UNDP has published?", "cypher": "match (p:ENTITY{name:'UNDP'}) <- [:Relationship{name:' unit'}]- (q) return q.name"}, {"query": "Do college students have names in Chinese?", "cypher": "match (p:ENTITY{name:'Death of a college student'}) - [:Relationship{name:'Chinese name'}]-> (m) with m order by m.name return m.name"}, {"query": "Can you name the year of the 14 Horse signs?", "cypher": "Match (m:ENTITY{name:'Horse year'}) <- [:Relationship{name:'Zodiac'}]- (h) return h.name limit 14"}, {"query": "I would like to know the other 4 information about the singer Asher Book 2 layer.", "cypher": "match (:ENTITY{name:'Asher Book'}) -[:Relationship*1..2]-(p) where p.name <> 'singer' return p.name limit 4"}]