[{"query": "Can you help me find two people born in Taiwan?", "cypher": "match (:ENTITY{name:'Taiwan'}) <- [:Relationship{name:'place of birth'}]-(x),(x) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 2"}, {"query": "The three main departments of the school, which specialize in the three areas of the province of Guizhou, are not listed in the list of mechanical engineering and clothing.", "cypher": "match (n:ENTITY{name:'Relationship{name:'main faculty'}]->(h) where h.name <> 'mechanics' and h.name <> 'clothing' return distinct h.name limit 3"}, {"query": "Can you recommend a song that is 4 minutes and 8 seconds long?", "cypher": "match (:ENTITY{name:'4 min 8 sec'}) <- [:Relationship{name:' song length'}]- (n) return distinct n.name"}, {"query": "What are the words that describe a perfect match?", "cypher": "match (:ENTITY{name:'describe a very similar interest'}) --(x) return distinct x.name"}, {"query": "Please tell us about the organization and the details of the four-tier relationship between the environmental protection agency of Mangan Township.", "cypher": "match (n:ENTITY{name:'Shanghai Township Environmental Protection Agency'}) - [*1..3]->(x) where x.name <> 'organizing agency' return distinct x.name"}, {"query": "What are the public universities in Hong Kong, China?", "cypher": "match (:ENTITY{name:'public university'}) <- [:Relationship{name:' category'}]-(m), (m) - [:Relationship{name:' area'}]->(n) where n.name='China Hong Kong' return distinct m.name"}, {"query": "Do you know what the link is to H5N1 with tier 3 labeling?", "cypher": "The following is a list of the most commonly used H5N1 viruses."}, {"query": "The director of this exclusive documentary about the Hobbit, the Hobbit, has 10 things to say about the film:", "cypher": "match (:ENTITY{name:'Relationship{name:' Director'}}-> (n) with n order by n.name return n.name limit 10"}, {"query": "Can you tell me which famous attractions are open from 8:30 to 17:30?", "cypher": "match (x:ENTITY{name:'8:3017:30'}) <- [:Relationship{name:'open hours'}]-(m),(m) - [:Relationship{name:'famous attractions'}]->(p) return p.name order by p.name limit 1"}, {"query": "Where are the people who speak the Ainu dialect?", "cypher": "match (n:ENTITY{name:'Ainu language'}) <- [:Relationship{name:'dialect'}]- (mn) return mn.name"}, {"query": "What are the species of insects in the genus Don aquatic?", "cypher": "match (:ENTITY{name:'Dong water'}) <- [:Relationship{name:'Dong water'}]- (n) return n.name limit 9"}, {"query": "What is Amberpin's alias?", "cypher": "match (:ENTITY{name:'Amberping'}) <- [:Relationship{name:'Chinese name'}]- ((q) - [:Relationship{name:'alias'}]->(n) return distinct n.name limit 1"}, {"query": "What is the active power of the 200-2 type of non-combustible cooker in our factory?", "cypher": "match ((:ENTITY{name:'200-2 type free-burning cookers'}) - [:Relationship{name:'host power'}]-> (q) return q.name"}, {"query": "How do you spell the past tense of drink?", "cypher": "match (:ENTITY{name:'drink'}) - [:Relationship{name:'past form'}]->(m) return distinct m.name"}, {"query": "Can you tell me about 20 books and novels, magazines, published in 2014?", "cypher": "match (:ENTITY{name:'2014'}) <- [:Relationship{name:' time of publication'}]- (n) return n.name limit 20"}, {"query": "1+1 easily won the championship. Synchronized commentary: Politics in 7th grade has a rubber tag, tell me three, okay?", "cypher": "match (:ENTITY{name:'1+1 easily crowned; synchronized narration: 7th grade politics'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "Do you know which of the 3 labels are related to the Beijing Research Center for the Humanities at the People's University of China?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'People's University of China Beijing Research Center for the Humanities'}) return distinct n.name"}, {"query": "Can you get me two books published by Zhejiang Literature Publishing?", "cypher": "match (:ENTITY{name:'Zhejiang Literary Publishing House'}) <- [:Relationship{name:'Publishing House'}]-(x),(x) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 2"}, {"query": "I would like to know about this person Li Gaoyu, please tell me about it.", "cypher": "match (:ENTITY{name:' Lee Gyu'}) --(q) return q.name skip 1"}, {"query": "The Chinese government has said that the ten Han Chinese people represent", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(p) - [:Relationship{name:'representative work'}]->(n) return n.name order by n.name limit 10"}, {"query": "Tell me about the three levels of relationships that the Red Army Victory Memorial in Pichinchao is involved in. Can you name three?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Pink Kawahara Red Army Symbol Victory Memorial'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3 This is a list of all the different ways REL is credited in the database."}, {"query": "The following is a list of four-level relationships between different rooms for artwork.", "cypher": "match (n:ENTITY{name:' find different room'}) - [*1..4]->(x) where x.name <> 'artwork' return distinct x.name"}, {"query": "Did you have trouble asking about the five-level relationship of Alabi Rasheed, who weighs 80kg?", "cypher": "match (n:ENTITY{name:'Alabi Rasheed'}) - [*1..5]->(x) where x.name<>'80 kg' return distinct x.name limit 5"}, {"query": "What is the name of the memory used to store and store data at random?", "cypher": "match (:ENTITY{name:' used to store and store data'}) <- [:Relationship{name:' function'}]-(m), (m) - [:Relationship{name:' full name'}]->(n) where n.name=' random access memory' return distinct m.name"}, {"query": "I would like to know about five things about Caruana Jonathan, who plays football.", "cypher": "match (n:ENTITY{name:'Caruana Jonathan'}) - [*]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "What is the profession of people born in Shandong Province's Shandong City?", "cypher": "match (:ENTITY{name:'Shandong Province'}) <- [:Relationship{name:'place of birth'}]-(m),(m) - [:Relationship{name:'profession'}]->(p) return distinct m.name"}, {"query": "What do people born in Vancouver, Canada do?", "cypher": "match (:ENTITY{name:'Vancouver, Canada'}) <- [:Relationship{name:'place of birth'}]- ((n) - [:Relationship{name:'occupation'}]->(m) return distinct m.name"}, {"query": "What should be the label of the sound card/network card with integrated chips?", "cypher": "match (:ENTITY{name:' sound card/network card'}) <- [:Relationship{name:' integrated chip'}]- ((q),(q) - [:Tag{name:' tag'}]->(x) return distinct x.name limit 5"}, {"query": "Do you know what the main ingredient is for making a banana cake?", "cypher": "match (:ENTITY{name:'chickpea'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'main ingredient'}]->(n) return distinct n.name"}, {"query": "Can you list the three types of relationships involved in the 5th floor Neva Village?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Wawang Chong Village'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "Do you have the address of the company in the USA?", "cypher": "match (p:ENTITY{name:'Pacific and Pacific'}) return p.location"}, {"query": "What is the molecular formula of C22H22O8?", "cypher": "match (:ENTITY{name:'C22H22O8'}) --(x) return distinct x.name"}, {"query": "The actor, who was born in Kyoto, Japan, is best known for his work in the anime series Dragon Ball Z.", "cypher": "match (:ENTITY{name:'Japan Tokyo'}) <- [:Relationship{name:'place of birth'}]-(m) - [:Relationship{name:'main works'}]->(p) where p.name <> 'Wildcat' return distinct p.name limit 1"}, {"query": "Can you name five messages that are attributed to wine?", "cypher": "match (:ENTITY{name:' when attributed to wine[vii]'}) --(h) return h.name limit 5"}, {"query": "I need to know the profile of the Italian athlete Rainieri Nanni in the 4th tier?", "cypher": "match (n:ENTITY{name:'Raineri Nanni'}) - [*1..4]->(x) where x.name <>'Raineri Nanni, Italian athlete\u3002' return distinct x.name"}, {"query": "Do you know what the relationship is with the three-tiered Neptune nickname?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'town nickname'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "Who else but Li Wenping is the founder of the Chinese Village School?", "cypher": "match (:ENTITY{name:'China countryside'}) - [:Relationship{name:'founder'}]-> (h) with h order by h.name where h.name <> 'Lee Hsingping' return h.name"}, {"query": "Help me find the synonyms and antonyms for ice skating", "cypher": "match (:ENTITY{name:'like to wear thin ice'}) - [:Relationship{name:'like to wear thin ice'}]->(n) return n.name as name union all match (:ENTITY{name:'like to wear thin ice'}) - [:Relationship{name:'like to wear thin ice'}]->(m) return m.name as name"}, {"query": "I wonder what the five professions Chinese people do?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(p) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 5"}, {"query": "Please tell me about the two-tier relationship in Chongqing's Cedar Peach Data Valley, which is located in the northern part of Chongqing's Zhejiang District.", "cypher": "match (n:ENTITY{name:'Chongqing Cedar Peach Data Valley'}) - [:Relationship*1..2]->(x) where x.name <>'Chongqing City's Yanghe District' return distinct x.name"}, {"query": "Can you list the profile information of the 1st and 2nd level of the relationship of this person, Agius Edmond?", "cypher": "match (n:ENTITY{name:'Agius Edmond'}) - [*1..2]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "Tell me who is the first Chinese champion of the Chinese good whistle.", "cypher": "match (:ENTITY{name:'First Chinese champion in Chinese chess chess championship'}) --(q) return q.name order by q.name"}, {"query": "Can you list the most representative works of the Alpine Flying Eagle?", "cypher": "match (h:ENTITY{name:'Relationship{name:'representative work'}) - (n) return n.name order by n.name"}, {"query": "The year in which the Ottoman Empire was overthrown by the Ottoman Empire and replaced by the Ottoman Empire?", "cypher": "match (:ENTITY{name:' replaced by the ruler'}) <- [:Relationship{name:' except for the turkey'}]- (m) return m.name"}, {"query": "Can you tell me about the types of relationships within the three layers of the Tomb of Juliet Museum?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Julian Tomb Museum'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "Can you tell me one line of information about the types of relationships that are involved in the 5 tier ECO?", "cypher": "The following is a list of all the different ways Unwind is credited in the database:"}, {"query": "What is the name of the earwig? Where is it mainly distributed?", "cypher": "match (:ENTITY{name:'large ear'}) <- [:Relationship{name:'other name'}]-(m), (m) - [:Relationship{name:'distribution area'}]->(n) return distinct m.name,n.name"}, {"query": "Can you find me three Chinese video publications?", "cypher": "match (:ENTITY{name:'China recording video'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'book name'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "What is Zhong Zhongfu's profession? What is his graduation school? What are his main achievements?", "cypher": "match (:ENTITY{name:'Chorus'}) - [:Relationship{name:'Career'}]->(n) return n.name as name union all match (:ENTITY{name:'Chorus'}) - [:Relationship{name:'Graduate School'}]->(m) return m.name as name union all match (:ENTITY{name:'Chorus'}) - [:Relationship{name:'Main achievements'}]->(r) return r.name as name"}, {"query": "What exhibitions are held in Nanjing International Exhibition Center?", "cypher": "match (:ENTITY{name:'Nanchang International Exhibition Centre'}) <- [:Relationship{name:' hosting address'}]- (p) return p.name"}, {"query": "The book is called \"The New Age of Colorful Books\", and it is called \"The New Age of Colorful Books\".", "cypher": "match (:ENTITY{name:'0-3 years old; early learning: colour'}) - [:Tag{name:'label'}]-> (x) with x order by x.name where x.name <> 'books' return x.name"}, {"query": "I'm going to have to get two tags for the other person in the industry, please.", "cypher": "match (:ENTITY{name:'paying a visit'}) --(m) with m order by m.name where m.name <> 'industry figure' return distinct m.name limit 2"}, {"query": "The story is about the magic night and the other four messages in the second level of the drama.", "cypher": "match (:ENTITY{name:'Magic Night'}) - [:Relationship*1..2]-(p) where p.name <> 'dialogue' return p.name limit 4"}, {"query": "I know that the company, which is based in Quanzhou, is a company that sells toiletries, water heating equipment, and ceramic products.", "cypher": "match (n:ENTITY{name:'Kuzhou City Shenzhen Kitchenware Technology Co., Ltd'}) -->(h) with h order by h.name where h.name <> '1989' and h.name <> 'Water cleaning utensils, water heating devices, ceramic utensils' return h.name limit 4"}, {"query": "I'm doing this song for you, who is the original singer?", "cypher": "match ((:ENTITY{name:'I did your thing'}) - [:Relationship{name:'song originally sung'}]-> (p) return p.name"}, {"query": "Help me find 10 science fiction movies with stars.", "cypher": "match (:ENTITY{name:'science fiction film'}) <- [:Relationship*]-(m) ,(m) - [:Relationship{name:'starring'}]->(n) return m.name,n.name limit 10"}, {"query": "Find me a mentor for the nine personality schools and help me introduce them.", "cypher": "match (:ENTITY{name:'Nine-character school teacher'}) <- [*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 1"}, {"query": "Do you know how to make a nutritious breakfast in 15 minutes?", "cypher": "match (:ENTITY{name:'15 minutes to get a nutritious breakfast'}) --(m) with m order by m.name return m.name"}, {"query": "Can you find out the names of the five internet personalities and where are their shirt numbers?", "cypher": "match (:ENTITY{name:'Internet personality'}) <--(m), (m) - [:Relationship{name:'graduate college'}]->(n) return m.name, n.name limit 5"}, {"query": "The 10 professional departments of the Sichuan Wenchuan Vocational College were recommended, but the management engineering college was not included.", "cypher": "match (:ENTITY{name:'Sichuan Literature and Professional College' is a full-time private, general-purpose, higher education institution approved by the People's Government of Sichuan in 2013 and registered by the Ministry of Education of Sichuan Province in the city of Changzhou, Sichuan Province."}, {"query": "What books are published by the People's Military Medical Press?", "cypher": "match (:ENTITY{name:'People's Military Medical Publishing'}) <- [:Relationship{name:'publishing'}]-(x),(x) - [:Relationship{name:'book name'}]->(q) return distinct q.name limit 3"}, {"query": "Can you provide the knowledge points of 3 5-amino-2-acetoxyl ketones?", "cypher": "match (:ENTITY{name:'5-amino-2-ethyl peroxide'}) --(m) with m order by m.name return distinct m.name skip 1 limit 3"}, {"query": "Help me find three bamboo letters next to each other and the structure up and down.", "cypher": "match (:ENTITY{name:'bamboo'}) <- [:Relationship{name:'\u90e8\u9996'}]-(m), (m) - [:Relationship{name:'structure'}]->(n) where n.name='up and down structure' return distinct m.name limit 3"}, {"query": "Can you tell me about the 10 founders of the Global Federation of Chios?", "cypher": "match (:ENTITY{name:'Founder of the Global Quaker Federation'}) --(p) return distinct p.name limit 10"}, {"query": "Which of the following three regions has a subtropical monsoon and humid climate?", "cypher": "match (:ENTITY{name:'subtropical monsoon wet climate'}) <- [*]-(m), (m) - [:Relationship{name:' area'}]->(n) return m.name,n.name limit 3"}, {"query": "Please provide me with the official statement of the Standing Committee of the People's Congress of the city of Songguan on law enforcement inspections, which provides details of the relationship of no less than three levels.", "cypher": "match (n:ENTITY{name:'Regulations of the Standing Committee of the People's Representative Assembly of the City of Xinjiang on Law Enforcement Inspections'}) - [*1..3]->(x) where x.name <> 'publications' return distinct x.name"}, {"query": "Can anyone tell me what Sarah Thompson's main accomplishments are?", "cypher": "match (:ENTITY{name:'Sarah Thompson'}) <- [:Relationship{name:'Chinese name'}]- ((p),(p) - [:Relationship{name:'main achievement'}]->(h) return distinct h.name limit 5"}, {"query": "Did you know that the school that I started in 2002 has a yoga department?", "cypher": "match (:ENTITY{name:'2002'}) <- [:Relationship{name:'time of creation'}]-(p),(p) - [:Relationship{name:'main faculty'}]->(q) return q.name order by q.name limit 10"}, {"query": "What is the Bear-Bow-Doo rank and what are its major achievements?", "cypher": "match (:ENTITY{name:'\u718a\u5e94\u5802'}) - [:Relationship{name:'\u519b'}]->(n) return n.name as name union all match (:ENTITY{name:'\u718a\u5e94\u5802'}) - [:Relationship{name:'main achievement'}]->(m) return m.name as name"}, {"query": "What is the purpose of laser radar?", "cypher": "match (:ENTITY{name:' laser radar [a type of mechanical facility]'}) - [:Relationship{name:' use'}]->(m) return distinct m.name"}, {"query": "What is the name of the song?", "cypher": "match (p:ENTITY{name:'spoiler'}) --(n) with n order by n.name return n.name limit 1"}, {"query": "What is the function of blood-fibrotein solution?", "cypher": "match (:ENTITY{name:'blood fiber protein soluble'}) - [:Relationship{name:'function'}]->(n) return n.name as name union all match (:ENTITY{name:'blood fiber protein soluble'}) - [:Relationship{name:'other name'}]->(m) return m.name as name"}, {"query": "Help me find out all the information about Wang Iron.", "cypher": "match (n:ENTITY{name:' Wang Ti[Deputy Chairman of the Standing Committee of the Henan Provincial People's Congress]'}) --(x) return distinct x.name"}, {"query": "Can you say that these are the professions of Ivan Victor?", "cypher": "match (:ENTITY{name:'Ivan Victor'}) - [:Relationship{name:'profession'}]-> (m) return distinct m.name"}, {"query": "You know that thing about the year-old chicken?", "cypher": "match (:ENTITY{name:'0000 year old'}) --(x) return distinct x.name limit 10"}, {"query": "Can you tell me when Happy Planet 1 will be released?", "cypher": "match (:ENTITY{name:'Happy Planet1'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'output time'}]->(n) return distinct n.name"}, {"query": "Would you like to ask about the five personal details of Dutch citizen Wijnhard Clyde?", "cypher": "match (n:ENTITY{name:'Wijnhard Clyde'}) -[:Relationship*]->(x) where x.name<>'Netherlands' return distinct x.name limit 5"}, {"query": "Do you know which sports have a limit of 10 people?", "cypher": "match (:ENTITY{name:'10 people'}) <- [:Relationship{name:'the number of people the match specifies'}]- (p) return distinct p.name"}, {"query": "Can you tell me about An Jian-shek?", "cypher": "match (:ENTITY{name:'Anjian\u96c4'}) --(x) return x.name order by x.name"}, {"query": "Can you tell me the aliases of the five AV actresses?", "cypher": "match (:ENTITY{name:'AV actress'}) <- [:Relationship{name:'profession'}]-(x),(x) - [:Relationship{name:'alias'}]->(h) return distinct h.name limit 5"}, {"query": "He is Chinese, so do you know what other professions he has? Can you name the top 10?", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnicity'}]- ((x) - [:Relationship{name:'profession'}]->(m) return m.name skip 2 limit 10"}, {"query": "Can you please describe the five representative works of the gallery?", "cypher": "match (:ENTITY{name:'crowd'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'representative work'}]->(h) return h.name order by h.name limit 5"}, {"query": "The problem is, what are the jobs of the students who graduated from the Fung Lake School?", "cypher": "match (:ENTITY{name:'Fong Lake Library'}) <- [:Relationship{name:' Graduate School'}]-(n),(n) - [:Relationship{name:' Profession'}]->(p) return distinct p.name"}, {"query": "Can you name 10 of the novels that are available on Start Girl Network?", "cypher": "match (:ENTITY{name:'starting point girl network'}) <- [:Relationship{name:'contact platform'}]- (x) return x.name limit 10"}, {"query": "Can you tell me which three pieces represent the 2015 summit concert in Guangzhou besides Flying Higher and Furious Life?", "cypher": "match (n:ENTITY{name:'2015 Guangzhou Concert'}) - [:Relationship{name:'represents works'}]->(h) where h.name <> 'flying higher' and h.name <> 'angry life' return distinct h.name limit 3"}, {"query": "What plant subgenus is the subgenus Cercidothrix?", "cypher": "match (:ENTITY{name:'Cracks of the subgenus Cercidothrix'}) <- [:Relationship{name:'subgenus'}]- (h) return distinct h.name"}, {"query": "Can you tell me about six earthquakes of magnitude 7.3?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What are the names of people born in Chiang Kai-shek during the Qing Dynasty?", "cypher": "match (:ENTITY{name:'Ching Dynasty'}) <- [:Relationship{name:'at the time'}]- (mn) - [:Relationship{name:'at the place of birth'}]->(n:ENTITY{name:'Ching Dynasty'}) return mn.name"}, {"query": "Have you heard of the entertainment show called 111 Girls?", "cypher": "match (q:ENTITY{name:'111 girls'}) --(n) with n order by n.name where n.name <> 'entertainment work' return n.name"}, {"query": "Can you help me find out the climate type of Katliyan?", "cypher": "The following is a list of the most common types of climate change:"}, {"query": "What are the representative works of actor Lee Jianyang?", "cypher": "Match (:ENTITY{name:'Li Jianyang'}) - [:Relationship{name:'represented works'}]->(m) return distinct m.name"}, {"query": "Tell me about the school in the 2nd level relationship of the Dentsey Private Enterprise Accounting Service Center, where schooling is for integrity and quality first.", "cypher": "match (n:ENTITY{name:'Dancey Private Enterprise Accounting Services Center'}) - [:Relationship*1..2]->(x) where x.name <> 'Integrity is value, quality first' return distinct x.name"}, {"query": "I'm not sure if I can get a rep for 10 actors.", "cypher": "match (:ENTITY{name:' actor'}) <- [:Relationship{name:' profession'}]-(m) - [:Relationship{name:' representing work'}]->(n) return n.name order by n.name limit 10"}, {"query": "I would like to know about the school attributes of the 61st secondary school in Victory, Do you have them?", "cypher": "match (:ENTITY{name:'School of the Year'}) - [:Relationship{name:'School Attributes'}]-> (h) return h.name order by h.name"}, {"query": "What is the HDMI resolution of the 12 frame splitter used today?", "cypher": "The following is a list of the most commonly used image types:"}, {"query": "Please tell me who was appointed president in 1985 by military leader Manuel Antonio Noriega", "cypher": "match (:ENTITY{name:'In 1985 appointed president by military leader Manuel Antonio Noriega'}) --(m) return distinct m.name"}, {"query": "Can you recommend four free games for me?", "cypher": "match (:ENTITY{name:' free'}) <- [:Relationship{name:' fee method'}]- (h) return h.name limit 4"}, {"query": "What is the approximate meaning of \"go to the room\"?", "cypher": "match (:ENTITY{name:'go into the room'}) --(x) return distinct x.name"}, {"query": "The world is a mess for babies 0-3 years old: numbers?", "cypher": "match (:ENTITY{name:'0-3 year old baby recognizes the world: number'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "What is the chemical formula for C20H22O6? Can you provide two?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "I need information on the relationship between Zhejiang Yunkai Pharmaceutical Company Limited and the two-tiered pharmacy chain for chronic special diseases.", "cypher": "match (n:ENTITY{name:'Zhejiang Yunkai Asia-America Pharmacy Chain Limited'}) - [:Relationship*1..2]->(x) where x.name <> 'chronic special disease drug' return distinct x.name"}, {"query": "I'm not sure who the person who gave the cold voice to the moon is.", "cypher": "match (:ENTITY{name:'\u6708\u5bd2'}) <- [:Relationship{name:'identity'}]-(x),(x) - [:Relationship{name:'sounding'}]->(q) return distinct q.name"}, {"query": "Do you know who's song is Are You for Great Sex?", "cypher": "match (:ENTITY{name:'Are You for Great Sex?'}) <- [:Relationship{name:'main work'}]- (m) return distinct m.name"}, {"query": "What is 17Vee Disney MI Cool?", "cypher": "match (:ENTITY{name:'17Vee Disney MI Cool'}) --(m) with m order by m.name return m.name"}, {"query": "When was the date when the Sudanese rebels attacked Khartoum?", "cypher": "match (:ENTITY{name:'Sudanese insurgents have taken over Khartoum'}) <- [:Relationship{name:'event'}]- (h) return h.name"}, {"query": "There is a show that premiered on Friday at 22:55 and was repeated on Saturday at 15:30, called \"Yue?\"", "cypher": "match (:ENTITY{name:' Friday 22:55 minutes premiere  Saturday 15:30 replay'}) <- [:Relationship{name:' air time'}]-(h),(h) - [:Relationship{name:' Chinese name'}]->(m) return distinct m.name limit 1"}, {"query": "Please help me find books by Sun Yat-sen and tell me their publisher.", "cypher": "match (:ENTITY{name:'Sun Yang \u7f16'}) <- [:Relationship{name:'author'}]-(h),(h) - [:Relationship{name:'publisher'}]->(q) return distinct h.name,q.name"}, {"query": "Do you know what chemical has CAS number 7228-47-9?", "cypher": "Match (:ENTITY{name:'7228-47-9'}) <- [:Relationship{name:'CASNo'}]- (n) return distinct n.name"}, {"query": "I'm not sure if you're familiar with the three-tiered relationship between sports personalities like Gao Qiu and Yu Fan.", "cypher": "match (n:ENTITY{name:'sportsman'}) - [*1..3]->(x) where x.name <> 'sportsman' return distinct x.name"}, {"query": "Can you name a place that has a second-tier label relationship with the Sand River Village?", "cypher": "match (n) <- [:Tag*2{name:'tag'}]- ((p:ENTITY{name:'Sand River Village'}) RETURN distinct n.name"}, {"query": "Can you find the 3 tags for the 9/11 hostage crisis in Wisconsin, USA, which is a contemporary historical event?", "cypher": "match (:ENTITY{name:'11\u00b729 Wisconsin High School Hostage Crisis'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'contemporary historical event' return q.name limit 3"}, {"query": "I wonder what jobs graduates from the Royal Military Academy do?", "cypher": "match (:ENTITY{name:'Royal Military School'}) <- [:Relationship{name:' Graduate School'}]- ((q) - [:Relationship{name:' Profession'}]->(n) return distinct q.name limit 5"}, {"query": "Do you know where the Neapolitan football club is located?", "cypher": "match ((:ENTITY{name:'Napoli Football Club'}) - [:Relationship{name:'the area to which belongs'}]-> (n) return n.name"}, {"query": "The story of the two layers of the relationship between the chapters of ancient legends and the mythology of the ancient myths.", "cypher": "match (n:ENTITY{name:' chapter of ancient legend'}) - [:Relationship*1..2]->(x) where x.name <> 'ancient myth' return distinct x.name"}, {"query": "What is the name of the current secretary of the Yuen Long? Can you give me one?", "cypher": "match (:ENTITY{name:'sweet'}) <- [:Relationship{name:'current secretary'}]- ((q) - [:Relationship{name:'sweet'}]->(n) return n.name order by n.name limit 1"}, {"query": "What is the shortest distance between the Ming Dynasty site and the North Dynasty site on the second floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Mingkoang Palace site'}) - [*..2]-(b:ENTITY{name:'North Palace site'})) return count ((p)"}, {"query": "The book is called 09 Chinese Architecture Performance Integrated 1.", "cypher": "match (:ENTITY{name:'09 Chinese architectural performance integrated 1'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'books' return q.name"}, {"query": "I'm not sure if you can tell me what Anton Chekhov wrote.", "cypher": "match (:ENTITY{name:'Anton Chetkov'}) <- [:Relationship{name:'author'}]- (p) return distinct p.name"}, {"query": "The 10/11 Shenzhen fire reported in the news, do you know what type of incident?", "cypher": "match ((:ENTITY{name:'10\u00b711 Shenzhen fire incident'}) - [:Relationship{name:' event type'}]-> (h) return h.name"}, {"query": "Did you have trouble telling me the personal profiles of five people named Arroquis Guedrius in Chinese?", "cypher": "match (n:ENTITY{name:'Alroquis Giedrius'}) - [*1..4]->(x) where x.name <>' Chinese name' return distinct x.name limit 5"}, {"query": "What job did the person born in 1942 give me five", "cypher": "match (:ENTITY{name:'1942'}) <- [:Relationship{name:'date of birth'}]- ((h) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 5"}, {"query": "Who is the director of this film?", "cypher": "Match (n:ENTITY{name:'Yay sister'}) - [:Relationship{name:'director'}]-> (h) return h.name"}, {"query": "Apart from the Princess of the Two Worlds, which five films were directed by graduates of the Beijing Film Academy?", "cypher": "match (:ENTITY{name:'Beijing Film Academy'}) <- [:Relationship{name:'Graduate School'}]-(x),(x) - [:Relationship{name:'Representative work'}]->(h) where h.name <> 'Dublin's Queen' return distinct h.name limit 5"}, {"query": "Can you tell me what the chief accomplishment of the sun?", "cypher": "match (:ENTITY{name:'Zho Xiaojun, male, professor at Zhengzhou University, formerly head of the Department of Foreign Languages, and head of the Department of Foreign Language Teaching at the university\u3002'}) <- [:Describe{name:'description'}]-(p) - [:Relationship{name:'main achievements'}]->(x) return distinct p.name"}, {"query": "The Great Wall of China is a monument to the history of the city.", "cypher": "Match (:ENTITY{name:'drinking horse's long wall}) - [:Relationship{name:'creation year'}]-> (m) return distinct m.name"}, {"query": "What is the name of the family of sea cucumbers?", "cypher": "match (:ENTITY{name:'Relationship{name:'category'}]-> (m) return distinct m.name"}, {"query": "What is the shortest path between the three layers of the Western gills and the spiny gills?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Western spider'}) - [*..3]-(b:ENTITY{name:'Thorn-bearing spider'})) return count ((p)"}, {"query": "What do you know about the Empire State Building?", "cypher": "match (:ENTITY{name:' Empire State Building'}) --(h) return h.name order by h.name"}, {"query": "Please describe the product in the following language called Rokitamycin, which is a product with a 2-layer relationship to Rokatazin.", "cypher": "match (n:ENTITY{name:'Rokitamycin'}) - [:Relationship*1..2]->(x) where x.name<>'Rokitamycin' return distinct x.name"}, {"query": "Can you tell me about the types of relationships that are involved in the two layers of Kyla Collins?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Kyra Collins'}) UNWIND relationships(path) AS rel return distinct rel.name limit 3"}, {"query": "Do you know what the Chinese name of the novel by the author of the web series Seven Nights of the Devil is?", "cypher": "match (:ENTITY{name:'\u5996\u4e03\u591c'}) <- [:Relationship{name:' author'}]-(p) - [:Relationship{name:' Chinese name'}]->(h) return distinct h.name limit 4"}]