[{"query": "The site is located 5.5 km northwest of the village of Guole, in the village of Shagong.", "cypher": "match (:ENTITY{name:'Guole village 5.5 km northwest of the village of Sand Creek'}) <- [:Relationship{name:'geographical location'}]-(h),(h) - [:Relationship{name:'alias'}]->(q) return distinct h.name"}, {"query": "The book is a collection of poems written by the poet and poetess, who is also a writer.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'canal language' return distinct x.name"}, {"query": "The film's introduction mentions which people are starring in The Wonderful Night of the Museum 3?", "cypher": "match ((:ENTITY{name:'Fantastic Night at the Museum 3'}) - [:Relationship{name:'star'}]-> (q) return q.name"}, {"query": "Can you name five of the main achievements of this man?", "cypher": "match (:ENTITY{name:'1960'}) <- [:Relationship{name:'date of birth'}]- ((m) - [:Relationship{name:'main achievements'}]->(n) return n.name order by n.name limit 5"}, {"query": "Please help me find out the price and opening hours of the 798 Art District.", "cypher": "match (:ENTITY{name:'798 art area'}) - [:Relationship{name:'ticket price'}]->(n) return n.name as name union all match (:ENTITY{name:'798 art area'}) - [:Relationship{name:'open hours'}]->(m) return m.name as name"}, {"query": "Which company is 507 Jinhua Building, 109 Guangzhou Shenzhen Baoding District, Foshan Street, Shenzhen, New York", "cypher": "match (:ENTITY{name:' Shenzhen city Bao'an area Foshong Street Newda neighborhood Guang Foshong Yong Junction 109 Jinhua Building 507'}) <- [:Relationship{name:'registered address'}]- (m) return distinct m.name"}, {"query": "Do you know about the Battle of Ming Dynasty? What other information besides what happened in Shanxi Dynasty, please find the other 7 information in layer 2", "cypher": "match (:ENTITY{name:'Relationship*1..2]->(p) where p.name <> 'Sansi Daeng' return p.name limit 7"}, {"query": "And tell me about a series of works called A Changing Dragon in the Sky and Sky.", "cypher": "match (:ENTITY{name:'the change in the sky and sky'}) --(n) return distinct n.name limit 1"}, {"query": "Can you tell me what the relationship is between the two layers of productive consumption demand?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'productive consumption needs'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "The .NET model has a bunch of tags, tell me no more than 5?", "cypher": "match (:ENTITY{name: .NET mode'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "I'm not sure which weapon has a 56 kW output.", "cypher": "match (:ENTITY{name:'56 kW'}) <- [:Relationship{name:'output power'}]- (m) return m.name"}, {"query": "What is the English name of the Great Basin National Park?", "cypher": "match (:ENTITY{name:'Great Basin National Park'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'foreign name'}]->(n) return distinct n.name"}, {"query": "The following is a list of the top 10 best sword fighting games in the world.", "cypher": "match (:ENTITY{name:'extremely endless sword'}) --(q) with q order by q.name return q.name limit 3"}, {"query": "Can you find information on the 5 levels of relationships related to the Fog Lock Longshan Temple in Wu Hongqing?", "cypher": "match (n:ENTITY{name:'\u96fe\u9501\u9f99\u5c71\u5bfa'}) - [*1..5]->(x) where x.name <>'\u5b8f\u5e86' return distinct x.name"}, {"query": "I asked her what school she was head of.", "cypher": "match (:ENTITY{name:'was to you'}) <- [:Relationship{name:'current principal'}]- ((n)? return n.name"}, {"query": "Can you please tell me that the three main departments are continuing education colleges?", "cypher": "match (:ENTITY{name:' continuing education college'}) <- [:Relationship{name:' major faculty'}]- (x) return distinct x.name limit 3"}, {"query": "I asked if you had any personal information about Tadjer Mike from France in relation to the two levels of relationships?", "cypher": "match (n:ENTITY{name:'Tadjer Mike'}) - [*1..2]->(x) where x.name <>'France' return distinct x.name"}, {"query": "The following is a selection of the Chinese medical classics by Zhang Yuxiang: Information on the two-tier relationship between theories of typhoid fever.", "cypher": "match (n:ENTITY{name:'Chinese medicine classic name selection: cold-pressure theory'}) - [:Relationship*1..2]->(x) where x.name <> '\u5f20\u7389' return distinct x.name"}, {"query": "Can you tell me about the types of relationships within the three layers involved in the Chinese Emperor?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Chinese Emperor'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "Can you recommend me 5 life-friendly apps?", "cypher": "match (:ENTITY{name:' life utility type software'}) <- [:Relationship{name:' software type'}]- (x) return x.name limit 5"}, {"query": "What is the meaning of 1+1 in no more than 5 words?", "cypher": "match (:ENTITY{name:'1+1 city'}) --(q) with q order by q.name return distinct q.name skip 1 limit 5"}, {"query": "Can you tell me about the five types of relationships in the four layers of the hierarchy?", "cypher": "match path=(n) <- [:Relationship*4]- ((p:ENTITY{name:' by Iiichi Nin'}) UNWIND relationships(path) AS rel RETURN rel.name limit 5"}, {"query": "What are the main achievements of the graduates of Harbin University, Harbin Teachers' University? Can you list 10?", "cypher": "match (:ENTITY{name:'1964 born in Harbin, graduated from Harbin University, Harbin Teachers' College\u3002'}) <- [:Describe{name:'description'}]-(h) - [:Relationship{name:'main achievement'}]->(n) return distinct n.name limit 10"}, {"query": "What is the content of copper (Cu) in a material like 1370 tons of alloy?", "cypher": "match ((:ENTITY{name:'1370 aluminium alloy'}) - [:Relationship{name:'copper Cu'}]-> (q) return q.name"}, {"query": "How many species of plants are protected?", "cypher": "match (:ENTITY{name:' short for 'link'}) - [:Relationship{name:' protection level'}]->(m) return distinct m.name"}, {"query": "Please help me find tickets and opening hours for the Crystal Palace.", "cypher": "match (:ENTITY{name:'Bohlstein Palace'}) - [:Relationship{name:'Ticket price'}]->(n) return n.name as name union all match (:ENTITY{name:'Bohlstein Palace'}) - [:Relationship{name:'Opening hours'}]->(m) return m.name as name"}, {"query": "What is the characteristic of thermal and power engineering? Do you know its employment direction?", "cypher": "match (:ENTITY{name:' thermal energy and power engineering'}) - [:Relationship{name:' characteristics'}]->(n) return n.name as name union all match (:ENTITY{name:' thermal energy and power engineering'}) - [:Relationship{name:' employment direction'}]->(m) return m.name as name"}, {"query": "What are the works published by Spring Wind Literature Publishing? When were they published? Do you know 5?", "cypher": "match (:ENTITY{name:'\u6625\u98ce\u6587\u5b66\u51fa\u7248\u793e'}) <- [:Relationship{name:'\u51fa\u7248\u793e'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Can you name any novel that has a link to the 5th level tag of the person whose phone I picked up?", "cypher": "match (n) <- [:Tag*5{name:'tag'}]- ((p:ENTITY{name:'whose cell phone did I pick up'}) RETURN distinct n.name"}, {"query": "What else do you know about liquid crystal color display? Find 5 information in 2 layers.", "cypher": "match (:ENTITY{name:'LCD colour display is easy to fix'}) - [*1..2]-(p) where p.name <> 'Jingming' return distinct p.name limit 5"}, {"query": "Can you share the top 10 hashtags for Kiss with 1 million hits?", "cypher": "match (p:ENTITY{name:'Kiss of a million times'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 10"}, {"query": "Send me the tag you wrote on the .NET Windows app development tutorial?", "cypher": "match (:ENTITY{name: .NET Windows application development tutorial'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Can you see all the information about the publication's two-way stretch polyethylene?", "cypher": "match (n:ENTITY{name:'bi-directional stretch polyethylene'}) - [:Relationship*]->(x) where x.name <> 'publication' return distinct x.name"}, {"query": "Please help me find the rest of the tags for 11.26 Beijing highway accident social events?", "cypher": "match (:ENTITY{name:'11.26 Beijing Taipei high-speed traffic accident'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'social event' return x.name"}, {"query": "The 228-page English exam: The King: Information within the three-tier relationship of the yearly exam + the final exam?", "cypher": "match (n:ENTITY{name:'research English realm: year-end realm + subject test'}) - [:Relationship*1..3]->(x) where x.name <>'228 pages' return distinct x.name"}, {"query": "Can you list the four categories of fish that are conical in appearance?", "cypher": "match (:ENTITY{name:'shaped eye'}) <-[:Relationship{name:'shaped eye'}]- (h) return h.name limit 4"}, {"query": "Can you recommend four urban novels for me?", "cypher": "match (:ENTITY{name:'city'}) <- [:Relationship{name:'type'}]- (n) return n.name limit 4"}, {"query": "Do you know what chemical CAS is 51102-74-0?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Can you tell me what you know about the Chinese name for embedded egg?", "cypher": "match (:ENTITY{name:'Relationship{name:' Chinese alias'}]- (h) return distinct h.name"}, {"query": "The article was written by a journalist from the University of Lagos, who is also a student of the university.", "cypher": "match (:ENTITY{name:'16866 High School Exam Newsroom'}) --(x) with x order by x.name return x.name limit 5"}, {"query": "Tell me about the 160365 flying car race?", "cypher": "match (:ENTITY{name:'160365 airplane race'}) --(n) with n order by n.name return n.name"}, {"query": "Help me find a sign with 13 words on it.", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'simple head'}]-(m), (m) - [:Relationship{name:'total pencil'}]->(n) where n.name='13' return distinct m.name limit 1"}, {"query": "What chemical is C10H10N2O2S?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "The first Chinese name for my half-hour affair?", "cypher": "match (q:ENTITY{name:'half-time affair'}) - [:Relationship{name:'Chinese name'}]-> (x) with x order by x.name return x.name limit 1"}, {"query": "What are the works of the novelist called Death God Love?", "cypher": "match (q:ENTITY{name:'Death God'}) <-[:Relationship{name:'author'}]-(n),(n) -[:Relationship{name:'Chinese name'}]->(p) return distinct p.name"}, {"query": "Help me find 10 Chinese paintings.", "cypher": "match (:ENTITY{name:'Chinese painting'}) --(x) return distinct x.name limit 10"}, {"query": "I heard that the 12/23 Kai County Water Dam accident had a big impact, do you know how many people died?", "cypher": "match ((m:ENTITY{name:'12\u00b723 Kai County Special Well Accident'}) - [:Relationship{name:'Number of deaths'}]-> (n) return n.name"}, {"query": "I'm looking for someone who can find me a Capricorn and provide me with three of their major works.", "cypher": "match (:ENTITY{name:'Big Dipper'}) <- [:Relationship{name:'Big Dipper'}]- ((h) - [:Relationship{name:'Major work'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "Where did the chicken come from?", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'role'}]-(n),(n) - [:Relationship{name:'from where'}]->(q) return distinct q.name"}, {"query": "In addition to Liu Keqiang and Li Jun, who are the three other famous alumni of Shandong Swan Vocational Training School?", "cypher": "match (n:ENTITY{name:'Santondo Swan Vocational Training School'}) - [:Relationship{name:'known alumnus'}]->(h) where h.name <> 'Kei-Fan' and h.name <> 'Lee Joon' return distinct h.name limit 3"}, {"query": "The chemical 3-triethylamide methylphenidate is a mystery?", "cypher": "match (:ENTITY{name:'3-tetramethylformate'}) --(x) with x order by x.name where x.name <> 'chemical' return x.name"}, {"query": "The following is a list of the three-tiered relationships between the long-suffering nightingale and the evening flowering plant.", "cypher": "match (n:ENTITY{name:'U-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shaped-shap"}, {"query": "Can you explain what the foreign name of the Zhejiang Ocean University Computer Center is?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'Foreign language name'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship:'department'}]->(m) return m.name as name"}, {"query": "I am Lin Shuo, and what is the subtitle of this book?", "cypher": "match (:ENTITY{name:'I am a bookworm'}) <- [:Relationship{name:'bookname'}]- ((x),(x) - [:Relationship{name:'subtitle'}]->(q) return distinct q.name limit 2"}, {"query": "Tell me, what are the three other characters that describe this person besides the vice-professor and the CCP member?", "cypher": "match (n:ENTITY{name:'\u519b\u8861'}) - [:Describe{name:'description'}]->(h) where h.name <> 'adjunct professor' and h.name <> 'CPC member' return distinct h.name limit 3"}, {"query": "Can you tell me about five profiles of Irish footballer Clovis Glenn with no less than four levels of relationships?", "cypher": "match (n:ENTITY{name:'Clovie Glenn'}) - [*1..4]->(x) where x.name <> 'Clovie Glenn, Irish footballer\u3002' return distinct x.name limit 5"}, {"query": "The book is a priceless book, you know?", "cypher": "match (:ENTITY{name:'Grammatics and grammar studies'}) <- [:Relationship{name:' book name'}]- ((n) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "Can you list 20 Chinese industry figures?", "cypher": "The following is a list of all the characters that appear in the game:"}, {"query": "The last time the billionaire president's wife finished, can you advise me?", "cypher": "match ((:ENTITY{name:'billion president little wife'}) - [:Relationship{name:'completion time'}]-> (n) return n.name"}, {"query": "How do you feel about 07318 browsing information navigation?", "cypher": "match (:ENTITY{name:'07318 browsing information navigation'}) --(x) with x order by x.name return x.name"}, {"query": "Please help me find the software version of People's News, no more than five?", "cypher": "match (:ENTITY{name:'People's News'}) - [:Relationship{name:'Software version'}]-> (p) with p order by p.name return p.name limit 5"}, {"query": "Please help me find two scenic areas at 348 meters above sea level.", "cypher": "match (:ENTITY{name:'348 m'}) <- [:Relationship{name:'altitude'}]-(m), (m) - [:Relationship{name:'type'}]->(n) where n.name='scenery area' return m.name limit 2"}, {"query": "What are the three professions that have been awarded the National Commission for Advancement of Science and Technology's second-class achievement award?", "cypher": "match (:ENTITY{name:'National Committee for Science and Technology's second-class award'}) <- [:Relationship{name:'main achievements'}]- ((q),(q) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 3"}, {"query": "Do you know what the refractory temperature of 1.2344 molds steel needs to be?", "cypher": "match ((:ENTITY{name:'1.2344 molded steel'}) - [:Relationship{name:'return fire'}]-> (p) return p.name"}, {"query": "What is the model of the bullet designed by John Browning?", "cypher": "match (:ENTITY{name:' John Browning'}) <- [:Relationship{name:' designer'}]- (n) return distinct n.name"}, {"query": "Do you have five articles on cinnamon dates?", "cypher": "match (:ENTITY{name:'tinchnut'}) --(p) return distinct p.name limit 5"}, {"query": "What chemical is BRN 3609985?", "cypher": "match (:ENTITY{name:'3609985'}) <- [:Relationship{name:'BRN number'}]- (h) return distinct h.name"}, {"query": "The most recent chapter of which novel is the 249th chapter?", "cypher": "match (:ENTITY{name:' the 249th chapter The only one'}) <- [:Relationship{name:' the latest chapter'}]- (h) return h.name"}, {"query": "What about books first published in 1935?", "cypher": "match (:ENTITY{name:'1935'}) <- [:Relationship{name:'first published at the time'}]- (q) return q.name"}, {"query": "Did you know that three schools have started vocal music programs?", "cypher": "match (:ENTITY{name:' sound system'}) --(x) return distinct x.name limit 3"}, {"query": "Can you tell me 10 things you know about the movie Raindrops 2 besides the action genre?", "cypher": "match (:ENTITY{name:'Relationship[first film in the 1997 film series]'}) - [:Relationship*1..2]->(p) where p.name <> 'action' return p.name limit 10"}, {"query": "Can you fill in the CAS number for C12-14 mediocre chain polystyrene-8?", "cypher": "match ((:ENTITY{name:'C12-14 mediated chain allyl polystyrene-8'}) - [:Relationship{name:'CAS log number'}]-> (h) return h.name"}, {"query": "I'm going to find out 10 things about Wang Xuanhua in 2 layers, graduated from National Central University, this information I know.", "cypher": "match (:ENTITY{name:' Wang Chong'on'}) - [*1..2]->(p) where p.name <> 'National Central University' return p.name limit 10"}, {"query": "What lists of reports has Fortune Chinese published?", "cypher": "match (:ENTITY{name:' wealth Chinese language'}) <- [:Relationship{name:' publisher'}]- (p) return distinct p.name"}, {"query": "Please list one of the works representative of this person born in Dongming County, Shandong Province.", "cypher": "match (:ENTITY{name:'Dongming county'}) <- [:Relationship{name:'birthplace'}]-(m),(m) - [:Relationship{name:'representing work'}]->(q) return q.name order by q.name limit 1"}, {"query": "I need seven roasted chicken recipes in a two-tier relationship?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Broken Chicken'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 7 The name of the game is a combination of the names of the characters and the name of the game."}, {"query": "What is the shortest relationship path between the two layers of heterogeneity 2 and heterogeneity 3?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortest2'}) - [*..2]-(b:ENTITY{name:'shortest3'})) return count ((p)"}, {"query": "Where are the mosquitoes mainly distributed?", "cypher": "match (:ENTITY{name:'scatter'}) - [:Relationship{name:'scatter'}]->(m) return distinct m.name"}, {"query": "Can you see the 222 pages of the book on the relationship between the two layers of legal education and the reform of teaching?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'222 pages' return distinct x.name"}, {"query": "Can you recommend five novels in the genre of Eastern fantasy?", "cypher": "Match (:ENTITY{name:'Eastern mythology'}) <- [:Relationship{name:' category'}]- (n) return n.name limit 5"}, {"query": "Can you find out when the three legal books will be published?", "cypher": "match (:ENTITY{name:' legal books'}) <--(m), (m) - [:Relationship{name:' time of creation'}]->(n) return m.name, n.name limit 3"}, {"query": "The following is a list of all the information about the five-line three-ringed hat?", "cypher": "match (:ENTITY{name:'\u5f02\u6b66\u98a0'}) --(q) with q order by q.name where q.name <> 'five-line three rings' return q.name"}, {"query": "What is the name of the server platform decided by the American Electronics Association?", "cypher": "match (:ENTITY{name:'AEC'}) <- [:Relationship{name:'Determining Unit'}]- (x) return distinct x.name"}, {"query": "Please help me find three alumni of the University of Akron who are all working in what profession?", "cypher": "match (:ENTITY{name:' early chennai university'}) <- [:Relationship*]-(m) ,(m) - [:Relationship{name:' profession'}]->(n) return m.name,n.name limit 3"}, {"query": "I want to know about Oudah Fahed's personal situation in Syria, which is not more than two levels of relationship?", "cypher": "match (n:ENTITY{name:'Oudah Fahed'}) - [*1..2]->(x) where x.name<>'Syria' return distinct x.name"}, {"query": "List 1+1 easy wins; Optimized training: tags outside of 3rd grade language books?", "cypher": "match (:ENTITY{name:'1+1 easily crowned; optimized training: 3rd grade language'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'books' return p.name"}, {"query": "What is the gender of the Pedersen you mentioned in your post?", "cypher": "Match ((:ENTITY{name:'Pederson'}) - [:Relationship{name:' gender'}]-> (n) return n.name"}, {"query": "Do you know how many companies that offer investment advice are in the business?", "cypher": "match (:ENTITY{name:' investment advisory'}) <- [:Relationship{name:' business scope'}]- (q) return q.name limit 14"}, {"query": "What is the chemical formula of perovskite? In which regions is it mainly distributed?", "cypher": "match (:ENTITY{name:'metallic mineral'}) - [:Relationship{name:'chemical formula'}]->(n) return n.name as name union all match (:ENTITY{name:'metallic mineral'}) - [:Relationship{name:'distribution'}]->(m) return m.name as name"}, {"query": "Please tell me about three of Pierre Mignot's most representative works.", "cypher": "match (:ENTITY{name:'Pierre Mignot'}) - [:Relationship{name:'represents work'}]-> (h) return distinct h.name limit 5"}, {"query": "What is the shortest path between the two layers of wanting to be able to be and wanting to be able to be?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'want to move ahead'}) - [*..2]-(b:ENTITY{name:'want to move ahead'})) return count ((p))"}, {"query": "Can you describe the work of this man who has three US citizenships?", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(n),(n) - [:Relationship{name:'representative work'}]->(q) return q.name order by q.name limit 3"}, {"query": "Can you name the 12 Japanese stars born on October 1, 1979?", "cypher": "match (:ENTITY{name:'October 1, 1979'}) <- [:Relationship{name:'date of birth'}]- (p) return p.name limit 12"}, {"query": "What is the main prize for the third year of the Sixth Form Water Market?", "cypher": "match (:ENTITY{name:'Six Plate Water City Third Secondary School'}) <- [:Relationship{name:'Chinese name'}]-(x) - [:Relationship{name:'main award'}]->(h) return distinct h.name"}, {"query": "Can you find out the organizers of the 16th China International Auto Show 2018?", "cypher": "match (:ENTITY{name:'2018 16th China International Auto Show'}) - [:Relationship{name:'host unit'}]-> (n) return distinct n.name"}, {"query": "Can you help me find 10 books published by National Press in 2011?", "cypher": "match (:ENTITY{name:'2011'}) <- [:Relationship{name:'publication time'}]- (mn) - [:Relationship{name:'publishing company'}]->(n:ENTITY{name:'national publishing company'}) return mn.name limit 10"}, {"query": "What do you think about the chemical product 3-hydroxybenzyl?", "cypher": "match (:ENTITY{name:'3-methacrylate'}) --(q) with q order by q.name where q.name <> 'chemistry' return q.name"}, {"query": "I wonder what the Chinese names of the novels in Jinjiang Literature City are?", "cypher": "match (:ENTITY{name:'Jingjiang Literary City'}) <- [:Relationship{name:'connected website'}]-(q),(q) - [:Relationship{name:'Chinese name'}]->(h) return distinct h.name limit 2"}, {"query": "007 Software Encryption Does this Internet product have a tag?", "cypher": "match (:ENTITY{name:'007 software encoder'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'Internet product' return p.name"}, {"query": "Besides the lead role of Li Linjie, can you tell me 6 things you know about the movie Taecyeon Sang-Fong 2?", "cypher": "match (:ENTITY{name:'Taedang Sanfeng [1993 film directed by Liu Peace]'}) - [:Relationship*1..2]->(p) where p.name <> 'Li Linjie, Liu Xiaobo, Chan Chiao-Hao, Li Zhenjie' return p.name limit 6"}, {"query": "I wonder if the number of people on the ground who died in the crash was 237?", "cypher": "match (:ENTITY{name:'237'}) <- [:Relationship{name:'number of dead on the ground'}]- (q) return q.name"}, {"query": "Can you help me find three mainland actors from the 80s?", "cypher": "match (:ENTITY{name:'80s actor'}) <- [:Tag{name:'tag'}]-(m), (m) - [:Tag{name:'tag'}]->(n) where n.name='mainland actor' return m.name limit 3"}, {"query": "Do you want to know 5 personal details about Alfadhel Amer, a Kuwaiti footballer?", "cypher": "match (n:ENTITY{name:'Alfadhel Amer'}) - [*]->(x) where x.name <>'Alfadhel Amer, Kuwaiti football player\u3002' return distinct x.name limit 5"}, {"query": "For the 10/29 Beijing Tungzhou building collapse, do you know exactly when it happened?", "cypher": "match ((h:ENTITY{name:'10\u00b729 Beijing Tongzhou area during construction of factory collapse accident'}) - [:Relationship{name:' time of occurrence'}]-> (x) return x.name"}, {"query": "What is the name of the dish made from ylang ylang?", "cypher": "match (:ENTITY{name:'Cyanuric'}) <- [:Relationship{name:'main ingredient'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='Cyanuric dishes' return distinct m.name"}, {"query": "Which books by Li Min have been published by Fudan University Press?", "cypher": "match (p:ENTITY{name:'Lee Min'}) <--(x) --> ((q:ENTITY{name:'Pudong University Press'}) return x.name"}, {"query": "Can you tell me what the relationship is between the two layers of the presentation?", "cypher": "The following is a list of links to links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in this list."}, {"query": "Do you know which entertainment personalities are associated with Tier 3 labels?", "cypher": "Match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'entertainment character'}) RETURN distinct n.name"}, {"query": "What is the name of the character in the TV series \"Shanghai Beach\" who is accompanied by her new friend, Kim Ji-young?", "cypher": "match (h:ENTITY{name:'Fan Yue Yue, television series \u4e0a\u6d77 \u65b0\u4e0a\u6d77 character, accompanied by in the side of \u656c\u3002'}) <-[:Describe{name:'description'}]-(x) return distinct x.name"}, {"query": "Do you know what the three-step label has to do with regional development innovation?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Regional development innovation theory'}) RETURN distinct n.name"}, {"query": "Do you know what Ruth Winona T's signature work is?", "cypher": "match (:ENTITY{name:'Ruth Winona T'}) <- [:Relationship{name:' foreign language name'}]- ((q),(q) - [:Relationship{name:' representing work'}]->(x) return distinct x.name limit 1"}, {"query": "Can you list me seven events that happened on December 29th in the world?", "cypher": "match (:ENTITY{name:'October 29'}) <- [:Relationship{name:' time'}]- (p) return p.name limit 7"}, {"query": "And what will make you realize who owns the Jinn?", "cypher": "match (:ENTITY{name:' ghost eye'}) - [:Relationship{name:' affiliate'}]-> (h) return distinct h.name"}, {"query": "What is this person's profession?", "cypher": "match (:ENTITY{name:'spoonful'}) <--(n),(n) - [:Relationship{name:'spoonful'}]->(p) return distinct p.name"}, {"query": "I want to know about the personal relationship of Chinese national Liu Hao.", "cypher": "match (n:ENTITY{name:'Hao'}) - [*1..2]->(x) where x.name <> 'China' return distinct x.name"}, {"query": "What are the areas of application of this knowledge that can be classified as applied mathematics?", "cypher": "match (:ENTITY{name:'mathematics'}) <- [:Relationship{name:'applied discipline'}]- ((m) - [:Relationship{name:'scale of field'}]->(p) return p.name skip 1 limit 5"}, {"query": "I would like to know about the 11-16 cabinet 5?", "cypher": "match (:ENTITY{name:'11-oxygen-mixed sixteen cabinet'}) --(x) with x order by x.name return x.name limit 5"}, {"query": "Can you list the top 10 achievements of the mountain?", "cypher": "match (:ENTITY{name:'Chang Nanpin'}) <- [:Relationship{name:'Chinese name'}]- ((m) - [:Relationship{name:'main achievement'}]->(x) return x.name order by x.name limit 10"}, {"query": "What historical record contains the year 104 AD in Hungary?", "cypher": "match (:ENTITY{name:'104 AD in Hungary'}) <- [:Relationship{name:'important event'}]- (x) return x.name"}, {"query": "What is Sun Xiaoming's profession besides singing and music?", "cypher": "match (n:ENTITY{name:'Sun Family'}) - [:Relationship{name:'profession'}]->(h) where h.name <> 'singer' and h.name <> 'musician' return distinct h.name limit 1"}, {"query": "Do you know about the International Paralympic Committee? What information is there besides its creation in 1989?", "cypher": "match (:ENTITY{name:' International Paralympic Committee for Disabled People'}) - [:Relationship*1..2]->(p) where p.name <> '1989' return p.name limit 7"}, {"query": "I want to issue four pieces of information on the implementation of the labor management measures of the two levels of the Chinese and foreign joint venture enterprises in Guangzhou, other than the People's Government of Guangzhou.", "cypher": "match (:ENTITY{name:'Manual for the implementation of labour management in the Chinese and foreign joint venture enterprises in Guangzhou City'}) - [*1..2]-(p) where p.name <> 'Guangzhou City People's Government' return p.name limit 4"}, {"query": "Tell us about the five facts about Kislitsyn Aleksander, who weighs 76 kg.", "cypher": "match (n:ENTITY{name:'Kislitsyn Aleksander'}) - [*]->(x) where x.name <>'76 kg' return distinct x.name limit 5"}, {"query": "Can you list the people and events related to suicide?", "cypher": "match (:ENTITY{name:'suicide'}) <- [:Relationship{name:'way of death'}]- (p) return p.name"}, {"query": "What are the labels of each plant and can they be sorted from small to large by the number of labels?", "cypher": "match (n:ENTITY{name:' nightwing's dance'}) - [:Relationship{name:'\u754c'}]->(:ENTITY) <- [:Relationship{name:'\u754c'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}]