[{"query": "Which schools and what type of school is the Changdong College of the North China University of Technology?", "cypher": "match (n:ENTITY{name:'Northeast China University of Technology's Changdong College'}) - [:Relationship{name:'school type'}]->(:ENTITY) <- [:Relationship{name:'school type'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you help me find the three civil servants and her place of birth?", "cypher": "match (:ENTITY{name:'public servant'}) <- [:Relationship{name:'profession'}]-(h),(h) - [:Relationship{name:'place of birth'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "I'm going to be a writer for the Shanghai University Press.", "cypher": "match (:ENTITY{name:'100 Lee-san'}) --(h) with h order by h.name where h.name <> 'Shanghai University Press' return h.name"}, {"query": "Can you get me two pork loin dishes with any ingredients?", "cypher": "match (:ENTITY{name:' pig's waist'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' auxiliary'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "What are the public universities in Hubei?", "cypher": "match (:ENTITY{name:'China Hubei'}) <- [:Relationship{name:'the region'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='public university' return distinct m.name"}, {"query": "I want to know the personal details of the four-tier relationship of the industry figure Gurrunur Charbi Khan.", "cypher": "match (n:ENTITY{name:'Gurinur Charqan Khan'}) - [*1..4]->(x) where x.name<>'industry person' return distinct x.name"}, {"query": "I need to know 5 things about Bosnian and Herzegovinian footballer Vasil Velibor in the 4th level relationship?", "cypher": "match (n:ENTITY{name:'Vasilic Velibor'}) - [*1..4]->(x) where x.name<>'Vasilic Velibor, Bosnian and Montenegro footballer\u3002' return distinct x.name limit 5"}, {"query": "What are the five words that describe the emotional development and development of young children aged 0-3?", "cypher": "match (:ENTITY{name:'0-3 years of age emotional development and development'}) --(q) with q order by q.name return q.name limit 5"}, {"query": "I wonder what the legal name of the company that Liu Gongluong owns is?", "cypher": "match (:ENTITY{name:'spoonful'}) <- [:Relationship{name:'spoonful'}]- (x) return x.name"}, {"query": "I would like to know the five profiles of Rayssac Yohan, who weighs 125 kg.", "cypher": "match (n:ENTITY{name:'Rayssac Yohan'}) - [*]->(x) where x.name <>'125 kg' return distinct x.name limit 5"}, {"query": "What are the disadvantages of crystal glasses?", "cypher": "match (:ENTITY{name:' crystal lens'}) - [:Relationship{name:' shortcomings'}]-> (m) return distinct m.name"}, {"query": "Can you tell me about the five types of relationships in the three layers that Cheneyel is involved in?", "cypher": "The following is a list of the most commonly used links in the search results for the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms \"Relationship\" and \"Relationship\" in the search terms\" and \"Relationship\" in the search terms \"Relationship\" and \"Relations\" in the search terms\" are the search terms \"Relations\" and \"Relations\" are\" are\""}, {"query": "Check out the other 6 posts on this person in the 2nd tier.", "cypher": "match (:ENTITY{name:'Zhou Dao Zhong'}) -[:Relationship*1..2]-(p) where p.name <> 'person' return p.name limit 6"}, {"query": "You must know Aaron Clappham as a footballer and other than football, please tell me 2 things.", "cypher": "match (n:ENTITY{name:'Aaron Clapham'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'footballer' and h.name <> 'football' return distinct h.name limit 2"}, {"query": "I want a detailed description of the relationship between the 36-meter-high water tower of the Hebei People's Press and the two levels of the water tower.", "cypher": "match (n:ENTITY{name:' waterfall thirty-six'}) - [:Relationship*1..2]->(x) where x.name <> 'Hebei People's Press' return distinct x.name"}, {"query": "Can you help me with the 029 single apartment website?", "cypher": "match (:ENTITY{name:'029 single-family apartment'}) --(x) with x order by x.name where x.name <> 'website' return x.name"}, {"query": "I'm not a Chinese person, but I'm not a Chinese person.", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(x) - [:Relationship{name:'profession'}]->(m) return m.name order by m.name limit 5"}, {"query": "The Japanese are known for their Japanese-Japanese language, but they are also known for their Japanese-Japanese language.", "cypher": "match (:ENTITY{name:'Japan Kyoto'}) <- [:Relationship{name:'\u7c4d\u8d2f'}]-(m),(m) - [:Relationship{name:'sounding'}]->(h) where h.name <> '\u5cf6\u672c\u9808\u7f8e' return distinct h.name limit 10"}, {"query": "Please help me find the publication cycle of the Xi'an Evening News.", "cypher": "match (:ENTITY{name:'Shian Evening'}) - [:Relationship{name:'publication cycle'}]-> (m) return distinct m.name"}, {"query": "Do you know the Chinese names of the five night umbrellas?", "cypher": "match (:ENTITY{name:'\u541b\u4e0d\u77e5\u591c\u96e8'}) - [:Relationship{name:'Chinese name'}]-> (q) with q order by q.name return distinct q.name limit 5"}, {"query": "Do you know what the theme of the 2011 Happy Girls' Concert in Beijing is?", "cypher": "The title of the game is \"Relationship\" (Relationship) (X) return x.name"}, {"query": "Can you tell me what kind of music is available in the country?", "cypher": "Match (:ENTITY{name:'sweet'}) <- [:Relationship{name:'singer'}]- (h) return h.name"}, {"query": "What is the shortest path of relationship between the asphyxiant and the inactivating agents in the 2 layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' asphyxiant'}) - [:Relationship*..2]-(b:ENTITY{name:' dysfunctional'})) return count ((p)"}, {"query": "Where is the main distribution of perovskites and in which areas are they used more?", "cypher": "match (:ENTITY{name:'peridot'}) - [:Relationship{name:'distribution'}]->(n) return n.name as name union all match (:ENTITY{name:'peridot'}) - [:Relationship{name:'applicable'}]->(m) return m.name as name"}, {"query": "Do you know the 10 most representative works of this famous word writer?", "cypher": "match (:ENTITY{name:' famous word writer'}) <- [:Relationship{name:' profession'}]-(h) - [:Relationship{name:' representing work'}]->(n) return n.name order by n.name limit 10"}, {"query": "Do you know anything about the location of the 139 Inn?", "cypher": "match (:ENTITY{name:'139 reception'}) --(h) with h order by h.name where h.name <> 'location' return h.name"}, {"query": "The two-tiered relationship of Li Shuping's Chinese Space Law Yearbook shows a personal overview.", "cypher": "match (n:ENTITY{name:'China space law yearbook'}) - [:Relationship*1..2]->(x) where x.name<>'Lee Sushpin' return distinct x.name"}, {"query": "The trouble with saying that 5 rivers islands is the information within the 4 layers of this person's relationship?", "cypher": "match (n:ENTITY{name:'Kiwa Island will be'}) - [*1..4]->(x) where x.name <> 'person' return distinct x.name limit 5"}, {"query": "3D Power Company, their company slogan, you know?", "cypher": "match (:ENTITY{name:'3D Dynamics'}) <- [:Relationship{name:'company name'}]- ((x),(x) - [:Relationship{name:'company slogan'}]->(q) return distinct q.name"}, {"query": "Ask the following 122-page book of knowledge of humanities and social sciences for vocational school students: Music appreciation in the context of two-tier relationships?", "cypher": "match (n:ENTITY{name:'student of vocational school humanities and social sciences textbook: music evaluation'}) - [:Relationship*1..2]->(x) where x.name<>'122 pages' return distinct x.name"}, {"query": "I wonder who else is the main actor besides Ma Yun-Long and Chang Wei?", "cypher": "match (n:ENTITY{name:'True is Taste'}) - [:Relationship{name:'Star'}]->(h) with h order by h.name where h.name <> 'Ma Yunlong' and h.name <> 'Chan\u4f1f' return h.name limit 3"}, {"query": "Is there anyone named Murad?", "cypher": "match (n:ENTITY{name:'Mudolph'}) where n is not null return 1"}, {"query": "What are the main achievements of people born in Jiangsu Province?", "cypher": "match (:ENTITY{name:' Jiangsu Province'}) <- [:Relationship{name:' place of birth'}]- ((q),(q) - [:Relationship{name:' major achievements'}]->(x) return distinct x.name limit 3"}, {"query": "What is the symbol for magnetic field strength? What is the unit?", "cypher": "match (:ENTITY{name:'magnetic field strength'}) - [:Relationship{name:'symbol'}]->(n) return n.name as name union all match (:ENTITY{name:'magnetic field strength'}) - [:Relationship{name unit:''}]->(m) return m.name as name"}, {"query": "Tell us about the book you know about, the 06J106 umbrella and the umbrella in the basement?", "cypher": "match (:ENTITY{name:'06J106 umbrella and umbrella for the canopy'}) --(h) with h order by h.name where h.name <> 'books' return h.name"}, {"query": "What are the health risks of long-term inhalation of industrial dust?", "cypher": "match (:ENTITY{name:'long-term inhalation of productive dust'}) <- [:Relationship{name:'common cause'}]- ((m), (m) - [:Relationship{name:'common site'}]->(n) where n.name='lung' return distinct m.name"}, {"query": "Do you know which exhibitions are held at Shenyang International Expo Center? Can you list 7?", "cypher": "match (:ENTITY{name:'Shenyang International Exhibition Centre'}) <- [:Relationship{name:'Car show venue'}]- (x) return x.name limit 7"}, {"query": "Do you know what the report's criteria for the production of grain, GDP per capita, are?", "cypher": "match (:ENTITY{name:'Cereal production, GDP per capita'}) <- [:Relationship{name:'scoring criteria'}]- (x) return x.name"}, {"query": "I'm not sure what kind of accident was caused by the burning of garbage.", "cypher": "match (:ENTITY{name:' caused by burning of garbage'}) <- [:Relationship{name:' cause of accident'}]- (h) return h.name"}, {"query": "Please tell me which commemorative coins are issued by the six countries in Africa?", "cypher": "match (:ENTITY{name:'6 national legal flags'}) <- [:Relationship{name:'Africa'}]- (q) return q.name"}, {"query": "Can you help me to find out about the Shanghai Yichang Pension?", "cypher": "match (:ENTITY{name:' Shanghai Yichang Sanatorium'}) - [*1..3]-(p) return p.name limit 10 The name of the game is the same as the name of the game."}, {"query": "What is the key attribute of the entire curriculum for the education and development of children aged 0-6?", "cypher": "match (:ENTITY{name:'0-6 years old full curriculum'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 1"}, {"query": "Can you please tell me which chemical has the EINECS registration number 000-000-0?", "cypher": "The following is a list of all the different ways The EINECS is credited in the database:"}, {"query": "I'm going to list five talk shows, where are they all?", "cypher": "match (:ENTITY{name:'talk show'}) <--(m), (m) - [:Relationship{name:'show venue'}]->(n) return m.name,n.name limit 5"}, {"query": "How to pick two school profiles in the 9th and 3rd level of Zizhar?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Zhihar City 9th Secondary School'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 2"}, {"query": "The game size and the size of the knight's castle are all dice, each with a dice tag. Find out how many of these games are in order of number of tags.", "cypher": "match (n:ENTITY{name:'Cavalry Castle'}) - [:Relationship{name:'game size'}]->(:ENTITY) <-[:Relationship{name:'game size'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC "}, {"query": "The word in English is called hu\u00ec, and the pencil on the outside is at least?", "cypher": "match (:ENTITY{name:'hu\u00ec'}) <- [:Relationship{name:'foreign language name'}]- ((h) - [:Relationship{name:'foreign language name'}]->(m) return min(m.name)"}, {"query": "Can you tell me about all the relationship types that are in the six layers of the Flying Dragon?", "cypher": "The following pages link to The Unknown:"}, {"query": "Can you help me to find out about the two famous white cloud caves in the mountains of Oahu?", "cypher": "match ((:ENTITY{name:'Crowd of the White Clouds'}) - [:Relationship{name:'Famous attractions'}]-> (n) return n.name limit 2"}, {"query": "I need to know 5 things about Seong-jo Jeong.", "cypher": "match (:ENTITY{name:'Seong-jo Jeong'}) --(m) return distinct m.name limit 5 The name of the match is"}, {"query": "Can you introduce me to two comedy films?", "cypher": "match (:ENTITY{name:'comedy'}) <- [:Relationship{name:'type'}]-(p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 2"}, {"query": "Do you know which zoos were built in 1959? Can you find five for me?", "cypher": "match (:ENTITY{name:'1959'}) <- [:Relationship{name:'Relationship time'}]- ((p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 5"}, {"query": "Please tell me what the label is for 2-methyl-5-hydroxyethylene.", "cypher": "match (:ENTITY{name:'2-methyl-5-methacrylate'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Can you tell me about a career in Guggenheim?", "cypher": "match (:ENTITY{name:'spoon'}) <--(m) - [:Relationship{name:'profession'}]->(q) return q.name order by q.name limit 1"}, {"query": "What does it mean in Japanese?", "cypher": "match (:ENTITY{name:'\u3044\u3056\u304b\u3084'}) <- [:Relationship{name:' Japanese name'}]- ((m) return m.name"}, {"query": "What are the famous attractions of the rose garden? How much does the ticket cost?", "cypher": "match (:ENTITY{name:'Park'}) - [:Relationship{name:'Famous attractions'}]->(n) return n.name as name union all match (:ENTITY{name:'Park'}) - [:Relationship{name:'Tickets price definition'}]->(m) return m.name as name"}, {"query": "The Chitrara River is about 280 km long and is connected to the Chitrara River by a two-tiered relationship.", "cypher": "match (n:ENTITY{name:'Chittarlal River'}) - [:Relationship*1..2]->(x) where x.name<>'about 280 km' return distinct x.name"}, {"query": "Find out what chemical has CAS number 147702-16-7?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "I have a lot of pieces priced the same as my architectural tour, and they have different brick labels.", "cypher": "match (n:ENTITY{name:'My and my mom's architectural journey'}) - [:Relationship{name:'Pricing'}]->(:ENTITY) <- [:Relationship{name:'Pricing'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY cC DES "}, {"query": "The book is a work of Orthodox history, how many words are there in it?", "cypher": "match ((:ENTITY{name:'Orthodox Church'}) - [:Relationship{name:'word count'}]-> (m) return m.name"}, {"query": "Can you tell me which of the artworks is representative of what brand?", "cypher": "match (:ENTITY{name:'What is the symbol?'}) <- [:Relationship{name:'represents the work'}]- (x) return x.name order by x.name limit 10"}, {"query": "Born in May 1946, what other profession can you have besides being the director of the Ethics Laboratory at the Wuhan Institute of Education and Science?", "cypher": "match (:ENTITY{name:'May 1946'}) <- [:Relationship{name:'date of birth'}]-(q),(q) - [:Relationship{name:'profession'}]->(m) where m.name <> 'Director of the Deer Laboratory of the Wuhan City Institute of Education and Science' return distinct m.name limit 1"}, {"query": "What kind of event do you like to watch the 1987 NBA All-Star Game?", "cypher": "Match (s) (n) return (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n)"}, {"query": "Do you know which chemicals have CAS number 62669-60-7?", "cypher": "match (x:ENTITY{name:'62669-60-7'}) <- [:Relationship{name:'CAS login number'}]- (m) return distinct m.name"}, {"query": "How much do you know about the 11.01 Chiang Mai Highway accident?", "cypher": "match (:ENTITY{name:'11.01 Huang Kun Highway in Qingdao'}) --(h) with h order by h.name return h.name"}, {"query": "Help me find five species of plants.", "cypher": "match (:ENTITY{name:'family of Sterculiaceae) }) <-[:Relationship{name:'family'}]-(m) return distinct m.name limit 5"}, {"query": "Which exhibitions are held in the National Agricultural Exhibition Hall? Can you name eight?", "cypher": "match (:ENTITY{name:'National Agricultural Exhibition Hall'}) <- [:Relationship{name:'Exhibition Hall'}]- (q) return q.name limit 8 The name of the exhibition hall is not known."}, {"query": "What is the shortest distance between the South China Vocational College and the Hunan Transportation Vocational Technical College on the second floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'South China Vocational College'}) - [:Relationship*..2]-(b:ENTITY{name:'Hunan Transportation Vocational Technical College'})) return count ((p)"}, {"query": "The other seven items in the second layer of the SAF assault rifle are:", "cypher": "match (:ENTITY{name:'SAF assault rifle'}) - [:Relationship*1..2]-(p) where p.name <> 'weapon equipment' return p.name limit 7"}, {"query": "What is the shortest path between the two layers of the North Pole and the East Pole?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Shanhai\u00b7Overseas North'}) - [*..2]-(b:ENTITY{name:'Shanhai\u00b7Overseas East'})) return count ((p)"}, {"query": "How do you understand 1st of December?", "cypher": "match (:ENTITY{name:'13th of December'}) --(n) with n order by n.name return n.name"}, {"query": "What does the concept of absolute space mean? What is the center of this concept?", "cypher": "match (:ENTITY{name:'Absolute space cosmology'}) - [:Describe{name:'tag'}]->(n) return n.name as name union all match (:ENTITY{name:'Absolute space cosmology'}) - [:Relationship{name:'Center of the universe'}]->(m) return m.name as name"}, {"query": "What are the famous sights in Hanyang District? Where are they located?", "cypher": "The name of the game is a combination of the name of the game itself and the name of the game itself."}, {"query": "Can you tell me what kind of relationship is covered in the middle of the 5 layers of melon?", "cypher": "The following is a list of all the different ways Match path=(n) <- [:Relationship*5]-(p:ENTITY{name:'Cinnamon'}) UNWIND relationships(path) AS rel RETURN rel.name limit 5"}, {"query": "I want to download the relationship profile of Jusufi Plumb, a Croatian, in the 2nd tier?", "cypher": "match (n:ENTITY{name:'Jusufi Plumb'}) - [:Relationship*1..2]->(x) where x.name<>'Croatia' return distinct x.name"}, {"query": "The first is the profile of Kabarkapa Boban in the Republic of Montenegro.", "cypher": "match (n:ENTITY{name:'Cabarkapa Boban'}) - [:Relationship*1..2]->(x) where x.name <> 'Republic of Montenegro' return distinct x.name"}, {"query": "What planet is the orbit of a celestial body that is eccentrically circular?", "cypher": "match (:ENTITY{name:' is centrifugal'}) <- [:Relationship{name:' orbital'}]- (x) return x.name"}, {"query": "The exhibition is a great opportunity to learn about the benefits of outdoor products, outdoor equipment, outdoor industry and more.", "cypher": "match (:ENTITY{name:'outdoor supplies, outdoor equipment, outdoor industry, etc'}) <- [:Relationship{name:'main business'}]- ((x) - [:Relationship{name:'exhibition features'}]->(h) return distinct h.name"}, {"query": "The author of the book, who is also a member of the CCP, has published 10 other works.", "cypher": "match (:ENTITY{name:'cultural figure'}) <- [:Tag{name:'tag'}]-(x) - [:Relationship{name:'representative work'}]->(h) where h.name <> 'reported under the banner of the CCP' return distinct h.name limit 10"}, {"query": "I need a five-tiered, no less than two-tiered relationship character?", "cypher": "The following is a list of all the different ways Unwind is credited in the database:"}, {"query": "Who is it that brings death, and you cannot repay it?", "cypher": "match (:ENTITY{name:'laughing your ass off'}) <- [:Relationship{name:'book name'}]- ((x),(x) - [:Relationship{name:'author'}]->(q) return distinct q.name"}, {"query": "Where did X You come from and who wrote it?", "cypher": "match (:ENTITY{name:'X You'}) --(p) return distinct p.name"}, {"query": "I would like to know the 5 main achievements of the star of LUA Entertainment, the brokerage company.", "cypher": "match (:ENTITY{name:'LUA Entertainment'}) <- [:Relationship{name:'brokerage company'}]-(m),(m) - [:Relationship{name:'main achievement'}]->(h) return h.name order by h.name limit 5"}, {"query": "Can you give me an example of a 100 point elite label that is not social?", "cypher": "match (:ENTITY{name:'100 points elite'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'social activity' return p.name limit 1"}, {"query": "What are the three main awards received by the Anhui Province Teaching Center in addition to the National Priority Secondary Vocational School and the Anhui Province Model School for the Educational and Moral Education of Minors?", "cypher": "match (n:ENTITY{name:'Relationship{name:'main award'}]->(h) where h.name <> 'National level priority secondary vocational school' and h.name <> 'Anhui Province Minority Thought Moral Education Model School' return distinct h.name limit 3"}, {"query": "Help me find one evergreen tree that is native to Yunnan.", "cypher": "match (:ENTITY{name:'\u4e91\u5357'}) <- [:Relationship{name:' distribution'}]-(m), (m) - [:Relationship{name:' belongs to'}]->(n) where n.name='evergreen junsu' return distinct m.name limit 1"}, {"query": "Help me find 10 college teachers.", "cypher": "match (:ENTITY{name:' college teacher'}) <- [:Relationship{name:' profession'}]- (n) return n.name limit 10"}, {"query": "I would like to know what works are written in the same language as the teacher and the stray cat? What are the labels for each of these works? Please list them in order of number of labels for each work.", "cypher": "match (n:ENTITY{name:'teacher and stray cat'}) - [:Relationship{name:'for white language'}]->(:ENTITY) <-[:Relationship{name:'for white language'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "What games have the same game screen as the daily supermarket? What are the names of the individual labels? Can each game be sorted by the number of labels from small to large?", "cypher": "match (n:ENTITY{name:'day by day supermarket'}) - [:Relationship{name:'game picture'}]->(:ENTITY) <- [:Relationship{name:'game picture'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Do you know what tea is made with this process?", "cypher": "match (:ENTITY{name:' half-square'}) <- [:Relationship{name:' process'}]- ((n) - [:Relationship{name:' Chinese name'}]->(q) return distinct q.name limit 3"}, {"query": "The following is a list of the topics covered in the book:", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'North Korea' return distinct x.name"}, {"query": "What are the labels for the shooting in central Mexico on October 28?", "cypher": "match (:ENTITY{name:'10\u00b728 Central Mexico shooting'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'modern history' return x.name"}, {"query": "Can you list the 10 main achievements of Franciscus Vieta?", "cypher": "match (:ENTITY{name:'Franciscus Vieta'}) <- [:Relationship{name:' foreign language name'}]- ((m) - [:Relationship{name:' major achievement'}]->(x) return distinct x.name limit 10"}, {"query": "Did you know that Pamplona (Spain) usually plays with his left or right foot?", "cypher": "match (:ENTITY{name:'Pamplona (Spain) '}) <- [:Relationship{name:'Born'}]- ((p) - [:Relationship{name:'Usually used feet'}]->(x) return distinct p.name"}, {"query": "What are the representative works of Chen Berda?", "cypher": "match (:ENTITY{name:'Chen Berda'}) - [:Relationship{name:'representing work'}]->(m) return distinct m.name"}, {"query": "Can you tell me what the ghost of a pig is?", "cypher": "match (:ENTITY{name:'piggy'}) --(q) return q.name skip 1 The name of the game is the same as the name of the game"}, {"query": "What is the name of the long novel written by Zhukov?", "cypher": "match (:ENTITY{name:'Zhukov'}) <- [:Relationship{name:'author'}]-(m), (m) - [:Relationship{name:'literary genre'}]->(n) where n.name='long novel' return distinct m.name"}, {"query": "I want information on the three-layer relationship of the five-letter word \"pepper\" in the alphabet?", "cypher": "match (n:ENTITY{name:'fuck'}) - [:Relationship*1..3]->(x) where x.name <>'five-line' return distinct x.name"}, {"query": "Can you tell me about the three professions of this politician?", "cypher": "The following is a list of the most commonly used tags in the world:"}, {"query": "I wonder what year is the year of the Doge of Han and the year of the second year of the calendar?", "cypher": "match (:ENTITY{name:'Dong Han Jian and the second year\u3002'}) <- [:Relationship{name:'Year Number'}]- (h) return distinct h.name"}, {"query": "Can you tell me when the book will be published?", "cypher": "match ((:ENTITY{name:'Relationship{name:' time of publication'}]-> (p) return p.name)"}, {"query": "Can you list 8 things that are related to Tier 4 labeling of tech products?", "cypher": "match (n) - [:Tag*4{name:'tag'}]->(p:ENTITY{name:'technology product'}) RETURN distinct n.name limit 8"}, {"query": "Please help me find out the name of the company with business registration number 441900000793609", "cypher": "match (:ENTITY{name:'441900000793609'}) <- [:Relationship{name:'Relationship'}]- (x) return distinct x.name"}, {"query": "Can you say the first three Chinese names of the Sun God?", "cypher": "match (:ENTITY{name:'Tang Tao Basmin'}) - [:Relationship{name:'Chinese name'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "Can you recommend a place that is open from 09:00-19:00?", "cypher": "match (:ENTITY{name:'09:00-19:00'}) <- [:Relationship{name:'open time'}]- (h) return distinct h.name"}, {"query": "What are the representative works of the company Dragon Union Investment Limited? Can you name 10?", "cypher": "match (:ENTITY{name:'Kos Dragon Union Investment Shares Limited'}) <- [:Relationship{name:' brokerage company'}]-(n) - [:Relationship{name:' representing work'}]->(p) return distinct p.name limit 10"}, {"query": "You know the name is Ning Kongwang, and there are 7 messages in the 3rd layer of Zhuang .", "cypher": "match (:ENTITY{name:'Jin'}) - [*1..3]-(p) where p.name <> 'Ning Kongwang' return p.name limit 7"}, {"query": "Do you know where the restaurant 1F has a desire kitchen coming?", "cypher": "Match (:ENTITY{name:' Desire Kitchen'}) <- [:Relationship{name:'1F'}]- (p) return p.name The name of the match is a combination of the following:"}, {"query": "Name the main award received by a school in the East District of the city of Yerevan.", "cypher": "match (:ENTITY{name:'Relationship{name:'main award'}}-> (q) return distinct q.name limit 1"}, {"query": "What is the profession of a person born on December 26, 1992?", "cypher": "match (q:ENTITY{name:'December 26, 1992'}) <- [:Relationship{name:' date of birth'}]-(x),(x) - [:Relationship{name:' occupation'}]->(n) return distinct n.name limit 1"}, {"query": "What is the price of books by Thich Nhat Hanh?", "cypher": "match (:ENTITY{name:'\u5146\u610f'}) <- [:Relationship{name:'author'}]- ((n) - [:Relationship{name:'pricing'}]->(q) return distinct q.name"}, {"query": "What are the most representative works of this Chinese artist? Please list 10 of them.", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(m) - [:Relationship{name:'representative work'}]->(h) return h.name order by h.name limit 10"}, {"query": "Which industries have won the National Award for Technological Invention 1 and the National Award for Scientific and Technological Progress 2?", "cypher": "match (:ENTITY{name:'National Prize of Technology 1 Secondary Prize of Science and Technology 2 Secondary Prize of Progress'}) <- [:Relationship{name:'main achievement'}]- ((n) - [:Relationship{name:'profession'}]->(x) return distinct x.name"}, {"query": "Did you know that the publication, The Encyclopedia of Parenting for 6 Year Olds, has some great news?", "cypher": "match (:ENTITY{name:'0 6 years old parenting encyclopedia'}) --(x) with x order by x.name where x.name <> ' publications' return x.name"}, {"query": "Where is the scope of application of round angle feed?", "cypher": "match (:ENTITY{name:'rounded feed'}) <- [:Relationship{name:'Chinese name'}]- ((m),(m) - [:Relationship{name:'scale of application'}]->(h) return distinct h.name limit 1"}, {"query": "What is the meaning of the Pearl of Great Price?", "cypher": "Match (:ENTITY{name:'Tang-hai Jewel'}) - [:Tag{name:'tag'}]->(n) return n.name The name of the game is the same as the name of the game itself."}, {"query": "What is the shortest path between the 2nd floor of the building of Baolide Steel Pipe Co., Ltd. in Zhejiang and the 2nd floor of the building of the building of Ningbo Zhijin Machinery Co., Ltd.?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Bolide Steel Pipe Co., Ltd. of Zhejiang City'}) - [*..2]-(b:ENTITY{name:'Ningbo City Chijin Machinery Co., Ltd. of Ningbo City'})) return count ((p)"}, {"query": "What is the name of a tropical storm with maximum winds of 18 meters per second?", "cypher": "match (:ENTITY{name:'18 meters per second'}) <- [:Relationship{name:'maximum wind speed'}]- (h) return h.name"}, {"query": "What is the report of the Chinese Entrepreneur Survey System?", "cypher": "match (:ENTITY{name:'China Entrepreneur Survey System'}) <- [:Relationship{name:' publisher'}]- (n) return distinct n.name"}, {"query": "Do you know what Wang Friendship does for a living?", "cypher": "match (:ENTITY{name:'Wang Friendship'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 1"}, {"query": "Can you tell me about the three main departments that are engineering schools?", "cypher": "match (:ENTITY{name:' engineering'}) <- [:Relationship{name:' major faculty'}]- (m) return distinct m.name limit 3"}, {"query": "What is called the mud treasure?", "cypher": "match (:ENTITY{name:'Mudba Khambha'}) <- [:Relationship{name:'also known as '}]-(m) return distinct m.name"}]