[{"query": "What is the name of the blue rock shark and where is it mainly found?", "cypher": "match (:ENTITY{name:'Blue Rock'}) - [:Relationship{name:'do not call'}]->(n) return n.name as name union all match (:ENTITY{name:'Blue Rock'}) - [:Relationship{name:'distribution area'}]->(m) return m.name as name"}, {"query": "The first thing I did was find out who the university professor is who won the National Natural Science Foundation?", "cypher": "match (:ENTITY{name:'National Natural Science Foundation'}) <- [:Relationship{name:'main achievements'}]- (mn) - [:Relationship{name:'profession'}]->(n:ENTITY{name:'university professor'}) return mn.name"}, {"query": "Which of the major departments are included in the Shanghai area universities?", "cypher": "match (:ENTITY{name:' Shanghai'}) <- [:Relationship{name:' area'}]- ((q),(q) - [:Relationship{name:' major department'}]->(x) return distinct x.name limit 5"}, {"query": "I need to replicate the work of the gift of the three layers of relationships.", "cypher": "match (n:ENTITY{name:'presented'}) - [:Relationship*1..3]->(x) where x.name <>'present' return distinct x.name"}, {"query": "Can you describe the diesel engine in five words?", "cypher": "match (:ENTITY{name:'* ship diesel engine'}) --(p) with p order by p.name return p.name limit 5"}, {"query": "Can you name the top 10 people who are screenwriters?", "cypher": "match (:ENTITY{name:' writer'}) --(n) return n.name order by n.name limit 10"}, {"query": "Can you tell me the relationship information within the five layers of the 5-86kg Sial Chris?", "cypher": "match (n:ENTITY{name:'Siale Chris'}) - [*1..5]->(x) where x.name<>'86 kg' return distinct x.name limit 5"}, {"query": "Avery Bradley, born in Tacoma, Washington, USA, is a writer and photographer who lives in the city of Tacoma, Washington.", "cypher": "match (:ENTITY{name:' Avery Bradley'}) - [*1..4]-(p) where p.name <> 'Tacoma, Washington, USA' return distinct p.name limit 6"}, {"query": "What is the shortest path between a family name and a family name in the two layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' painted surname'}) - [:Relationship*..2]-(b:ENTITY{name:' east gate surname'})) return count ((p)"}, {"query": "Can you tell us about the three main achievements of this man, born in January 1962, and what he has achieved?", "cypher": "match (h:ENTITY{name:'January 1962'}) <- [:Relationship{name:'date of birth'}]-(q),(q) - [:Relationship{name:'main achievements'}]->(p) return p.name skip 1 limit 3"}, {"query": "Do you have a CAS registration number for 7-Cyan-4-Cyan on your profile?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "I'm going to ask you, do you know if Brian Gordon has any representative works?", "cypher": "match (:ENTITY{name:'Brian Gordon'}) - [:Relationship{name:'represents work'}]-> (q) return distinct q.name limit 3"}, {"query": "I need to know the relationship between the two layers of the Jiao Tong Complete Selection of Literary Works?", "cypher": "match (n:ENTITY{name:'2013 Chinese interior design thesis collection'}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "Who is 188 in height and lists three of his works?", "cypher": "match (:ENTITY{name:'6 feet 2 inches ((188cm) '}) <- [:Relationship{name:'height'}]-(m),(m) - [:Relationship{name:'represents work'}]->(q) return m.name order by m.name,q.name limit 3"}, {"query": "Three words that describe what you know about 11-alpha-glycine?", "cypher": "match (:ENTITY{name:'11-alpha-alkylated cannibals'}) --(m) with m order by m.name where m.name <> 'chemical' return m.name limit 3"}, {"query": "Speaking of the 1+1 easy winner; Special training: Primary school mathematics graphics and geometry different from the first label content of the publication?", "cypher": "match (:ENTITY{name:'1+1 easily crowned; special training: elementary school mathematics graphics and geometry'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> ' publications' return h.name limit 1"}, {"query": "In no more than three words, describe the tech product 210-D that you know?", "cypher": "match (:ENTITY{name:'210-D'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'technology product' return n.name limit 3"}, {"query": "What can you tell me about Zeljko Joksimovic's profession?", "cypher": "match (:ENTITY{name:'Zeljko Joksimovic'}) <- [:Relationship{name:'foreign language name'}]-(q) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 2"}, {"query": "Where is the address of the Royal Wealth Company?", "cypher": "match (p:ENTITY{name:'Royal Wealthy Company'}) return p.location The name of the company is not known"}, {"query": "Can you tell me everything you know about the double-clawed frog?", "cypher": "match (:ENTITY{name:' double strawberry'}) - [:Relationship*1..3]-(p) return distinct p.name limit 10"}, {"query": "What is the purpose of the school in Jiangxi Province's Jian City 5th Secondary School?", "cypher": "match (:ENTITY{name:'Kongqing Primary School founded by Jiangsu Five-Chinese Association in the first year of the Republican Party, later renamed to Township West Primary School, renamed to Shaanxi Primary School during the anti-Japanese War, renamed to Fifth Secondary School in Jiangsu Province in 1970 and still exists."}, {"query": "The following is a list of 5 characters who can be considered screenwriters.", "cypher": "match (:ENTITY{name:' writer'}) --(h) return distinct h.name limit 5"}, {"query": "Do you know how many counties are located in western India? Name three?", "cypher": "match (:ENTITY{name:'West of India'}) <- [:Relationship{name:'geographical location'}]- (m) return m.name limit 3"}, {"query": "When was the Taipei Lake Bridge built and when did it open?", "cypher": "match (:ENTITY{name:'Thailand's Bridge'}) - [:Relationship{name:'Thailand's Bridge'}]->(n) return n.name as name union all match (:ENTITY{name:'Thailand's Bridge'}) - [:Relationship{name:'Thailand's Bridge'}->(m) return m.name as name"}, {"query": "I need to start the topic essay series on 13: Central exam math hot topic essay introduction to information in the relationship layer 2?", "cypher": "match (n:ENTITY{name:'theme type exam series: middle school math hot topic exam'}) - [:Relationship*1..2]->(x) where x.name <>'13' return distinct x.name"}, {"query": "What other information can you give me besides music? Please help me find 8 information in 3 layers.", "cypher": "match (:ENTITY{name:'musical work'}) - [*1..3]-(p) where p.name <> 'the door of the delight' return p.name limit 8"}, {"query": "I want to know all the personal information about the seven-word-style frog girl, Gif Muaro [Oak Tree]?", "cypher": "match (n:ENTITY{name:'frognet daughter gift Murunga [oak tree]'}) - [:Relationship*]->(x) where x.name <>'seven words' return distinct x.name"}, {"query": "The first label attribute in the language book of the first grade is?", "cypher": "match (:ENTITY{name:'09 spring 1st grade language [under]'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 1"}, {"query": "Can you tell me 10 things you know about the two levels of the TV station that are not in the Xiamen area?", "cypher": "match (:ENTITY{name:'Alam TV station'}) - [*1..2]->(p) where p.name <> 'Alam City Alam Island Shiming District Lake North' return p.name limit 10"}, {"query": "What is the profession of this person born in October 1963? Can you tell me one?", "cypher": "match (:ENTITY{name:'October 1963'}) <- [:Relationship{name:'date of birth'}]- ((p),(p) - [:Relationship{name:'profession'}]->(x) return x.name skip 2 limit 1"}, {"query": "Have you been impressed with the 0712 Love Movie Network label?", "cypher": "match (:ENTITY{name:'0712 Love Movie Network'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "In six messages, I'm getting to know who we are as young and old as we are, and who is not involved in youth.", "cypher": "match (:ENTITY{name:'Dedicated to the young and old'}) --(h) with h order by h.name return h.name limit 6"}, {"query": "What is the name of the active volcano in the Hawaiian Islands?", "cypher": "match (:ENTITY{name:'Hawaiian Sea Island'}) <- [:Relationship{name:'location'}]-(m), (m) - [:Relationship{name:'nature'}]->(n) where n.name='living volcano' return distinct m.name"}, {"query": "Can you name 15 words that come to mind when you think of America?", "cypher": "match (:ENTITY{name:' United States'}) <- [:Relationship{name:' country'}]- (x) return x.name limit 15 The name of the match is the name of the country."}, {"query": "What are the works of Zhang Jianhui?", "cypher": "match (:ENTITY{name:'Chang Soon-jin'}) <- [:Relationship{name:'Years'}]-(m), (m) - [:Relationship{name:'Author'}]->(n) where n.name='Chang Soon-jin' return distinct m.name"}, {"query": "Can you find me the name of the professor?", "cypher": "match (:ENTITY{name:'professor'}) <- [:Relationship{name:'profession'}]-(n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 3"}, {"query": "Can you list a school that has a 3 jump label relationship with Yangzhou Normal University of Technology in Jiangsu?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Canton University of Technology, Jiangsu Province'}) return distinct n.name limit 1"}, {"query": "How many people live in Changchun County?", "cypher": "Match ((:ENTITY{name:' Changchun County'}) - [:Relationship{name:' Population'}]-> (n) return n.name"}, {"query": "I need information about the relationship between the two layers of this book.", "cypher": "match (n:ENTITY{name:'lever of the platform'}) - [*1..2]->(x) where x.name <> 'book name' return distinct x.name"}, {"query": "Who is the author of the Chinese arms embargo?", "cypher": "match (:ENTITY{name:'China weapon'}) - [:Relationship{name:'author'}]->(m) return distinct m.name"}, {"query": "What cars have front-wheel-drive rear-wheel-drive?", "cypher": "match (:ENTITY{name:' front disc rear drum'}) <- [:Relationship{name:' brake mode'}]- (p) return p.name limit 17"}, {"query": "The question is, what technology can be used to treat coal mine water?", "cypher": "match (:ENTITY{name:' coal mine water'}) <- [:Relationship{name:' processing target'}]- (q) return q.name"}, {"query": "Can you give me a list of five people who are models in this profession?", "cypher": "match (:ENTITY{name:' model'}) --(q) return distinct q.name limit 5"}, {"query": "Have you seen the work of Saint-Jean published on the Chinese website?", "cypher": "match (:ENTITY{name:'Sancho'}) --(n) with n order by n.name where n.name <> 'longitudinal Chinese net' return n.name"}, {"query": "Do you have an English name for the 2015 Copa Am\u00e9rica in Chile, what is it?", "cypher": "match ((h:ENTITY{name:'2015 Chilean American Cup'}) - [:Relationship{name:'English name'}]-> (n) return n.name"}, {"query": "What is the shortest distance between Hunan Software Vocational College and Hunan Transportation Engineering College on the second level?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Hunan Software Vocational College'}) - [:Relationship*..2]-(b:ENTITY{name:'Hunan School of Transportation Engineering'})) return count ((p)"}, {"query": "Who are the soldiers in Huang An, Hubei?", "cypher": "match (:ENTITY{name:'Hubei Huang'an'}) <- [:Relationship{name:'place of birth'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='military' return distinct m.name"}, {"query": "What are the works of the Chinese light industry publishers and when are they published?", "cypher": "match (:ENTITY{name:'China light industry'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'publication time'}]->(q) return distinct h.name,q.name"}, {"query": "Find 123 Happy Learning Centers and no more than five new labels besides education?", "cypher": "match (h:ENTITY{name:'123 happy learning center'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'education' return n.name limit 5"}, {"query": "Find out the manufacturers of professional logos: Can you tell us about the 5 companies that are related to Shenzhen Shenzhen Shenmue Industrial Products Co., Ltd.?", "cypher": "match (n:ENTITY{name:' Shenzhen City Shenzhen Mining Processing Products Co., Ltd. '}) - [*]->(x) where x.name<>' Shenzhen Mining Processing is a Chinese professional brand and trademark manufacturer, located in Shenzhen, Guangdong."}, {"query": "Do you remember who was the host of the 3/15 evening show on Central TV in 2014?", "cypher": "match ((:ENTITY{name:'2014 Central TV 3\u00b715 evening'}) - [:Relationship{name:'host'}]-> (x) return x.name"}, {"query": "Is there a representation of the contemporary playwright Dingming?", "cypher": "match (:ENTITY{name:'Dinming [contemporary playwright]'}) - [:Relationship{name:'represents work'}]-> (x) return distinct x.name"}, {"query": "Tell me what you know about Chen Qianwei as another representative of the Wu family.", "cypher": "match (:ENTITY{name:'Chen Qianwen'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'representative work'}]->(q) where q.name <> 'Rouwater family' return distinct q.name limit 1"}, {"query": "I need to introduce myself in a two-tiered relationship with a Chinese man named Deediat Ramli.", "cypher": "match (n:ENTITY{name:'DJDYAT Ramli'}) - [*1..2]->(x) where x.name <> 'Chinese name' return distinct x.name"}, {"query": "I'm wondering if there's a novel called Face on the Roof, Mysterious Grey Tower, Eyes Hanging in the Sky, Night Train, 12:00 midnight, what kind of novel is this?", "cypher": "match (:ENTITY{name:'face on the roof of a mysterious grey building hanging eyes in the sky night spirit car at midnight'}) <-[:Relationship{name:'alias'}]- (x) return x.name"}, {"query": "What is the shortest relationship path between the two layers of the Great Barrier Reef and the Taiwanese Mountain Barrier Reef?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Big bean'}) -[:Relationship*..2]-(b:ENTITY{name:'Taiwanese bean'})) return count ((p)"}, {"query": "What is the effect of a taste bud?", "cypher": "match (:ENTITY{name:'a functional unit'}) - [:Relationship{name:'effect'}]-> (m) return distinct m.name"}, {"query": "Can you explain 3-hydroxybenzylbenzene and its compounds in 3 sentences?", "cypher": "match (:ENTITY{name:'3-metric base and order'}) --(m) with m order by m.name return m.name limit 3"}, {"query": "Can you tell us about the three professions that Li Weiwei has?", "cypher": "match (:ENTITY{name:'Li Ving'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 3"}, {"query": "Please tell me who is the historical celebrity of Scorpio? Name 11?", "cypher": "Match (n:ENTITY{name:'Relationship{name:'Star'}}) - (m) return m.name limit 11 The name of the match is not shown."}, {"query": "I'm a Taiwanese born in China, can you tell me about the people in the three-tiered relationship between Taiwan and China?", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'Relationship' return distinct x.name"}, {"query": "Can you give me three examples of countries in Europe whose capitals are in the same country?", "cypher": "match (:ENTITY{name:'Europe'}) <- [:Relationship{name:'the continent'}]- ((x),(x) - [:Relationship{name:'the capital'}]->(q) return distinct q.name limit 3"}, {"query": "In which schools are the Humanities and Social Sciences faculties?", "cypher": "match (:ENTITY{name:'Faculty of Humanities and Social Sciences'}) --(h) return distinct h.name"}, {"query": "What is the main business of assisting in the sale of financial instruments issued by fundraisers?", "cypher": "match (:ENTITY{name:'assisting in the sale of financial instruments issued by the funder's issuer'}) <- [:Relationship{name:'distinction'}]- ((x),(x) - [:Relationship{name:'main business'}]->(n) return distinct n.name limit 1"}, {"query": "What is the area code of the Zhuzhou district in Fujian province?", "cypher": "match (:ENTITY{name:'Relationship{name:'area'}) - (q) return q.name"}, {"query": "Problems, can you tell me what the 4th floor tag is with the city?", "cypher": "The following is a list of all the different ways Match (n) - [:Tag*4{name:'tag'}]->(p:ENTITY{name:'city'}) RETURN distinct n.name"}, {"query": "Do you know when the company was founded?", "cypher": "match (p:ENTITY{name:'Jump Company'}) return p.time The name of the match is the name of the company."}, {"query": "For the book 0 3 years old: The best start in life for children can you bet the label?", "cypher": "match (:ENTITY{name:'03 years old: Best start in life for children'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'books' return x.name"}, {"query": "Russian Chechen parliament building explosion with a nice label", "cypher": "match (:ENTITY{name:'10\u00b719 Russian Chechen Parliament building explosion'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "Can you list 7 chemicals that are 98% pure?", "cypher": "The following is a list of the most commonly used names in the game."}, {"query": "I'm going to tell you about the five levels of relationships that are relevant to the mother of Lord Moon.", "cypher": "match (n:ENTITY{name:'same'}) - [*1..5]->(x) where x.name <>'\u8bb8\u6708\u537f' return distinct x.name limit 5"}, {"query": "I'm looking for a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new, a new book, a new book, a new, a new book", "cypher": "match (:ENTITY{name:'Absolute demon hunter's wife'}) --(m) with m order by m.name where m.name <> 'long day one bit' return distinct m.name limit 4"}, {"query": "What is the shortest contact path between the two layers of the 75-mm 130 mm multiple rocket gun and the 75-mm 155 mm self-propelled grenade?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'75-type 130mm multiple rocket gun'}) - [*..2]-(b:ENTITY{name:'Japanese 75-type 155mm self-propelled grenade gun'})) return count ((p)"}, {"query": "I want to know who Danny Menting is. Can you tell me about him?", "cypher": "match (n:ENTITY{name:'Danny Menting'}) --(m) return m.name order by m.name"}, {"query": "I'm curious about the nicknames for bitter wheat flour, can you tell me the top 10?", "cypher": "match (:ENTITY{name:'bitter wheat flour'}) - [:Relationship{name:'alias'}]-> (x) return x.name order by x.name limit 10"}, {"query": "Which transducer has a zero point of 0.5 percent at 55 degrees Celsius?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "I'm not sure how much you know about Jia Jiacom.", "cypher": "match (h:ENTITY{name:'Jia Jia'}) --(p) return p.name skip 1 This is a list of all the different ways Jia Jia is credited in the database."}, {"query": "I need to counterfeit with Solomon: The Last Judgment: Can I judge a movie from the same company? What are the labels on each of these films? Please sort by the number of labels from small to large.", "cypher": "match (n:ENTITY{name:'Solomon's forgery: post-post; trial'}) - [:Relationship{name:'production company'}]->(:ENTITY) <- [:Relationship{name:'production company'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c)"}, {"query": "I'm wondering if there are any competitions in Yangzhou (Canton of the Monkey) ?", "cypher": "match (:ENTITY{name:'Shanghai River'}) <- [Relationship{name:'Holding place'}]- (q) return distinct q.name"}, {"query": "What does the equatorial magnetic gradient of the magnetic slope and the geomagnetic equator mean?", "cypher": "match (:ENTITY{name:'magnetic tilt'}) - [:Relationship{name:'equal magnetic tilt'}]->(n) return n.name as name union all match (:ENTITY{name:'magnetic tilt'}) - [:Relationship{name:'geomagnetic equator'}]->(m) return m.name as name"}, {"query": "The following are the top five facts about the industry:", "cypher": "match (n:ENTITY{name:''}) - [*]->(x) where x.name <> 'industry person' return distinct x.name limit 5"}, {"query": "What are the 10 most common occupations of Chinese people?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(m),(m) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 10"}, {"query": "What information do you know about dancers who are in a two-tier relationship with the exception of the artist?", "cypher": "match (:ENTITY{name:'asphalt[dance artist]'}) - [*1..2]->(p) where p.name <> 'artist' return p.name limit 10"}, {"query": "Optical products with multiple zooms of 12x optical zoom + 4x digital zoom are classified under which 3 labels?", "cypher": "match (:ENTITY{name:'12x optical zoom + 4x digital zoom'}) <- [:Relationship{name:'focal number'}]-(m) - [:Tag{name:'tag'}]->(x) return distinct x.name limit 3"}, {"query": "What chemical is C26H45NO9?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "How many species of flying insects do you know? Can you name five?", "cypher": "match (:ENTITY{name:'square'}) <-[:Relationship{name:'square'}]- (x) return x.name limit 5"}, {"query": "What else do you know about the respirator, apart from its simple structure? Find 8 information in 3 layers.", "cypher": "match (:ENTITY{name:' Respirator'}) - [*1..3]-(p) where p.name <> ' structure simple, operation quick and easy ' return p.name limit 8"}, {"query": "K ((AlSi2O6) is the chemical equation for what substance?", "cypher": "match (:ENTITY{name:'K(AlSi2O6)'}) --(x) return distinct x.name"}, {"query": "What are the labels of Edgar VanCilla? Can you tell me the first one?", "cypher": "match (:ENTITY{name:'Edgar Chanchilla'}) - [:Tag{name:'tag'}]-> (q) return q.name order by q.name limit 1"}, {"query": "What academic category does Bayes' decision theory fall into?", "cypher": "match (:ENTITY{name:'Bayez decision theory'}) <- [:Relationship{name:'theory'}]- (m) return m.name"}, {"query": "Help me find two plants in the genus Acropteryx.", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship{name:'Relationship'}]-(m) return distinct m.name limit 2"}, {"query": "Anne Waldman is a cook? Can you name her three jobs?", "cypher": "match (:ENTITY{name:'Annie Waldman'}) <- [:Relationship{name:'Chinese name'}]-(h) - [:Relationship{name:'profession'}]->(p) return distinct p.name limit 3"}, {"query": "I need to know the boiling point of cyclohexanedioxyethane, can you help me?", "cypher": "match ((:ENTITY{name:'ring-self-based trioxide ketone'}) - [:Relationship{name:'boiling point'}]-> (x) return x.name"}, {"query": "Who is it?", "cypher": "match (:ENTITY{name:'\u3084\u3059\u3060\u307e\u3044'}) <--(n) return n.name The name of the match is"}, {"query": "Do you know how many companies are operating in Shanghai?", "cypher": "match (p:ENTITY{location:' Shanghai'}) return count ((p)"}, {"query": "Do you know which hotels have check-in hours from 15:00-18:00? Name 3?", "cypher": "match (:ENTITY{name:'15:00-18:00'}) <- [:Relationship{name:'time of entry'}]- (q) return q.name limit 3 The name of the game is the same as the name of the game itself."}, {"query": "What are the properties of 3D Vibration Mouse besides being an Internet product?", "cypher": "match (p:ENTITY{name:'3D vibrating mouse'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'Internet product' return q.name limit 3"}, {"query": "I'm curious to know who the Tit-Fid case is, can you tell me?", "cypher": "match (:ENTITY{name:'Titefeed event'}) <- [:Relationship{name:'represented work'}]- (n) return distinct n.name"}, {"query": "Please tell me what is in the Nanjing City License for the Marketing of Clenbuterol [Retail Application No. 2015009507].", "cypher": "match (:ENTITY{name:' Nanjing City Pharmaceutical License for the manufacture of acupuncture [Retail declaration No. 2015009507]'}) --(q) return distinct q.name limit 1"}, {"query": "The show is so amazing, do you know what year it's coming out?", "cypher": "match ((:ENTITY{name:'10 at I'm good God'}) - [:Relationship{name:'release time'}]-> (x) return x.name"}, {"query": "Sb ((3+) Sb ((5+) O4 is the chemical equation for what substance?", "cypher": "match (:ENTITY{name:'Sb(3+)Sb(5+)O4'}) --(x) return distinct x.name"}, {"query": "I know that the Taiji Cultural Park is in Xinjiang, Yangtze City, and is open all day, so give me 5 more details about this place.", "cypher": "match (n:ENTITY{name:'Kouji Park'}) -->(h) with h order by h.name where h.name <> 'Yanjing City, Yangzhou' and h.name <> 'All weather' return h.name limit 5"}, {"query": "What is TIM's nickname?", "cypher": "match (n:ENTITY{name:'Tim'}) <- [:Relationship{name:'alias'}]- (m) return distinct m.name"}, {"query": "Please tell me what are the three types of relationships that are involved in the two layers of the flower?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'plain branch chickpea flower'}) UNWIND relationships(path) AS rel return distinct rel.name limit 3"}, {"query": "Do you want to know more about the relationship between the two levels of the teacher Cao Cao?", "cypher": "match (n:ENTITY{name:'Cao Xue'}) - [*1..2]->(x) where x.name <> 'teacher' return distinct x.name"}, {"query": "Which novel has reached a cumulative reading of 113,1871 times?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "The first EP with a pop music label, what other label is it?", "cypher": "match (x:ENTITY{name:'1st EP'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'pop music' return q.name"}, {"query": "Can you find two American R-rated movies?", "cypher": "match (:ENTITY{name:' USA:R'}) <- [*]-(m), (m) - [:Relationship{name:' Director'}]->(n) return distinct m.name, n.name limit 2"}, {"query": "What is the alias of the fighter?", "cypher": "match (:ENTITY{name:'Relationship{name:' alias'}]-(m) return distinct m.name"}, {"query": "Ro lists 7 labyrinth romance novels that are not labeled as teenage romance.", "cypher": "match (:ENTITY{name:' Labyrinth Romanesque'}) --(m) with m order by m.name where m.name <> 'girl' return distinct m.name limit 7"}, {"query": "What are the occupations of people who are considered to be industry personalities?", "cypher": "match (:ENTITY{name:'person in the industry'}) <- [:Tag{name:'tag'}]-(h),(h) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 5"}, {"query": "1039 A48 Knowledge in 5 words?", "cypher": "match (:ENTITY{name:'1039 A48'}) --(x) with x order by x.name return x.name limit 5"}, {"query": "What are the applications of products with muscle, drainage, feedback, protection, isolation functions?", "cypher": "match (:ENTITY{name:'add, drain, feedback, protection, isolation'}) <- [:Relationship{name:'product function'}]- ((q),(q) - [:Relationship{name:'technical application'}]->(x) return distinct x.name limit 3"}, {"query": "Can you recommend me 5 sites for group shopping?", "cypher": "match (:ENTITY{name:' group shopping site'}) <- [:Relationship{name:' site type'}]- (p) return p.name limit 5"}, {"query": "I want to go to the Shanghai station for the May 2012 concert, can you check online for me how much the tickets cost?", "cypher": "match ((:ENTITY{name:'2012 May Day Concert Shanghai Station'}) - [:Relationship{name:'Ticket price'}]-> (x) return x.name"}, {"query": "What exhibitions have been organized by the Guangdong Provincial Lighting Association?", "cypher": "match (:ENTITY{name:' Guangdong Provincial Lighting Association'}) <- [:Relationship{name:' Hosted Unit'}]- (h) return h.name"}, {"query": "The Philippines has been hit by a series of earthquakes, including the first one in the Philippines in 2010.", "cypher": "match (:ENTITY{name:'10?15 Philippines earthquake'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "I'm writing this afternoon, how many years has this been published?", "cypher": "match (:ENTITY{name:'written to this afternoon'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'published years'}]->(q) return distinct q.name limit 1"}, {"query": "Find out about the 5 pieces of artwork that are related to the secondary and the gift to the calling of the caller.", "cypher": "match (n:ENTITY{name:'secondary and gift-to-call'}) - [*]->(x) where x.name <>'once upon a time' return distinct x.name limit 5"}, {"query": "Which of the following people is represented by a straight line of the Broththa Strait?", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}}) - (h) return distinct h.name"}, {"query": "There is a book that is a good subject to read, and should be about science.", "cypher": "match (:ENTITY{name:' good subject reading, both should be about science'}) <- [:Relationship{name:' resume'}]- (n) return n.name"}, {"query": "Can you give me three pieces of information about the 12580 businessmen's union?", "cypher": "match (:ENTITY{name:'12580 merchant union'}) --(x) with x order by x.name return x.name limit 3"}, {"query": "What is the nickname of the same DNA triplets?", "cypher": "match (:ENTITY{name:'The same DNA triplets'}) - [:Relationship{name:'alias'}]-> (m) return distinct m.name"}, {"query": "Do you know anything else about 1-amino-2-alkenols with chemical properties?", "cypher": "match (:ENTITY{name:'1-amino-2-phenols'}) --(x) with x order by x.name where x.name <> 'chemistry' return x.name"}, {"query": "The following are 10 other professions in which you can work in addition to teaching.", "cypher": "match (p:ENTITY{name:' in sequence'}) <- [:Relationship{name:' in Chinese name'}]-(n),(n) - [:Relationship{name:' profession'}]->(m) where m.name <> 'professor' return distinct m.name limit 10"}, {"query": "Did you know that there are guaranteed brick companies?", "cypher": "match (p:ENTITY{location:'guaranteed'}) return p.name"}, {"query": "The three men were given jobs that they could do besides being associate professors at the Northwestern Teachers College's School of Foreign Languages.", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(n),(n) - [:Relationship{name:'profession'}]->(x) where x.name <> 'Associate Professor at the School of Foreign Languages at Northwestern Teachers College' return distinct x.name limit 3"}, {"query": "I would like to introduce you to Pedro Verona Rodriguez P\u00e9rez.", "cypher": "match (:ENTITY{name:'Pedro Verona Rodr\u00edguez P\u00e9rez'}) --(m) return m.name order by m.name"}, {"query": "Can you help me find out about the public school in Mid-Saharan?", "cypher": "match (:ENTITY{name:'Nigeria'}) <- [:Relationship{name:'Region'}]- (mn) - [:Relationship{name:'Category'}]->(n:ENTITY{name:'Public school'}) return mn.name"}]