[{"query": "The large fruit lily is a protected plant in which category?", "cypher": "match (:ENTITY{name:'Big Tree'}) - [:Relationship{name:'protection level'}]->(n) return n.name as name union all match (:ENTITY{name:'Big Tree'}) - [:Relationship{name:'distribution area'}]->(m) return m.name as name"}, {"query": "What does the moonlight mean? Where did it come from?", "cypher": "match (:ENTITY{name:'daylight'}) - [:Relationship{name:'explanation'}]->(n) return n.name as name union all match (:ENTITY{name:'daylight'}) - [:Relationship{name:'out of place'}]->(m) return m.name as name"}, {"query": "I would like to know the other 4 information about the athlete Jagelkar 2nd level.", "cypher": "match (:ENTITY{name:'Phillippe Jagelca'}) -[:Relationship*1..2]-(p) where p.name <> 'athlete' return p.name limit 4"}, {"query": "Tell me about the three films you know about Sato Ryuji, besides his other work as a \"Live Spectacle Fire Movie Ninja\" assistant to Yuki Bobo.", "cypher": "match (:ENTITY{name:'\u4f50\u85e4\u6d41\u53f8'}) <- [:Relationship{name:'Chinese name'}]- ((x) - [:Relationship{name:'representative work'}]->(m) where m.name <> '\u300eLive Spectacle Fire Shadow Ninja\u300f \u5b87\u667a\u6ce2\u4f50\u52a9 return distinct m.name limit 3"}, {"query": "Can you tell me about the people who are in a 4th level relationship with Liu Yan? Can you name two?", "cypher": "match (n) <- [:Relationship*4{name:' partner'}]- ((p:ENTITY{name:' elegant'}) RETURN distinct n.name limit 2"}, {"query": "Who is the interim commander-in-chief of the new army of the Wu Zetian Rebellion?", "cypher": "match (:ENTITY{name:'Provisional Commander-in-Chief of the New Army of the Wu-Tang Rebellion'}) <- [:Relationship{name:'Main achievements'}]- ((m) return distinct m.name"}, {"query": "Do you know what purely public (non-commercial) bicycle parks are?", "cypher": "match (:ENTITY{name:' purely public (non-commercial) bicycle fleet'}) <- [:Relationship{name:' fleet nature'}]- (h) return distinct h.name"}, {"query": "Can you recommend 5 novels that are being published in Jinjiang City?", "cypher": "match (:ENTITY{name:'Jingjiang City'}) <- [:Relationship{name:'connecting platform'}]- (m) return distinct m.name limit 5"}, {"query": "Can you list the areas with 750,000 hectares of arable land?", "cypher": "match (x:ENTITY{name:'750,000 tons'}) <- [:Relationship{name:'cultivated area'}]- (m) return distinct m.name"}, {"query": "Do you know of any literary works that date back to 1344?", "cypher": "match (:ENTITY{name:'1344 year made'}) <- [:Relationship{name:'years'}]- (h) return h.name"}, {"query": "What is the alias of the main character in Grand Theft Auto: The Lost and Damned?", "cypher": "match (:ENTITY{name:'Grand Theft Auto: The Lost and Damned(lost and cursed) }) <- [:Relationship{name:'representing work'}]- ((h) - [:Relationship{name:'alias'}]->(n) return distinct n.name"}, {"query": "What is CF-105 Avro Chinese translation?", "cypher": "match (:ENTITY{name:'CF-105 Avro'}) <- [:Relationship{name:'English name'}]- (x) return distinct x.name"}, {"query": "10 things that make me understand 007's death?", "cypher": "match (:ENTITY{name:'007 dead fight'}) --(n) with n order by n.name return n.name limit 10"}, {"query": "Can you tell us more about the career of Balu, what his faith is and what military rank he holds?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)"}, {"query": "The 2012 Burmese Tea Party from the Tea Culture Expo to the Purple Sands Boutique Exhibition is set to be held in which exhibition hall?", "cypher": "match ((:ENTITY{name:'2012 Burhan Belly from the Tea Culture Fair's Purple Sands Boutique Show}) - [:Relationship{name:' Exhibition Gallery'}]-> (p) return p.name"}, {"query": "How do you explain the term \"misuse of public funds\"?", "cypher": "match (:ENTITY{name:'abuse of public funds'}) <- [:Relationship{name:'interpretation'}]- ((m) return distinct m.name"}, {"query": "Do you know how fast the ocean plate is moving?", "cypher": "match (:ENTITY{name:' ocean plate'}) <- [:Relationship{name:' Chinese name'}]- ((x),(x) - [:Relationship{name:' moving speed'}]->(q) return distinct q.name"}, {"query": "Can you find me two archaeological sites and describe them?", "cypher": "match (:ENTITY{name:'archaeological artifacts'}) <- [:Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return m.name, n.name limit 2"}, {"query": "Who killed Ju Friendly in the Fifth Dynasty and took the throne?", "cypher": "match (:ENTITY{name:'Tongdong Five Generations'}) <- [:Relationship{name:'at the time'}]-(m), (m) - [:Relationship{name:'main achievement'}]->(n) where n.name='Killing Zhu Jingming, taking the throne' return m.name"}, {"query": "Can you tell me what kind of relationship is involved in the farmers in the three layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' what is a farmer called'}) UNWIND relationships(path) AS rel return distinct rel.name limit 1"}, {"query": "I'm not sure if this is a good idea, but I'm not sure if it's a good idea.", "cypher": "match (:ENTITY{name:'The apprentice of the magician's puppet'}) --(h) return h.name order by h.name limit 1"}, {"query": "Can you list four war dramas and tell me when they will be released?", "cypher": "match (:ENTITY{name:'war drama'}) <- [*]-(m), (m) - [:Relationship{name:'release time'}]->(n) return m.name, n.name limit 4"}, {"query": "Do you know the three labels in Xiaoping County besides the language?", "cypher": "match (:ENTITY{name:'Shawks over Baokpo County Three's Head'}) - [:Tag{name:'tags'}]-> (p) with p order by p.name where p.name <> 'language' return p.name limit 3"}, {"query": "What is the nickname of the weapon tank developed in 1963?", "cypher": "match (h:ENTITY{name:'1963'}) <- [:Relationship{name:'time of research and development'}]- ((x) - [:Relationship{name:'alias'}]->(p) return distinct p.name"}, {"query": "Please tell me what the fourth layer of the label relationship is social events?", "cypher": "match (n) - [:Tag*4{name:'tag'}]->(p:ENTITY{name:'social event'}) RETURN distinct n.name limit 5"}, {"query": "I wonder what the magnitude of the 10.23 Ganja earthquake was?", "cypher": "match ((:ENTITY{name:'10.23 Glyphosate earthquake'}) - [:Relationship{name:'seismicity'}]-> (x) return x.name"}, {"query": "Do you know what chemical is C2H7NO?", "cypher": "match (:ENTITY{name:'C2H7NO'}) <- [:Relationship{name:'molecular'}]- (h) return distinct h.name"}, {"query": "The game is a Christmas-themed game that is a Christmas-themed game.", "cypher": "match (:ENTITY{name:'2011 Christmas bubble'}) --(q) with q order by q.name where q.name <> 'game' return q.name"}, {"query": "What is Shi Yong-kyu's profession?", "cypher": "match (:ENTITY{name:'\u77f3\u6c38\u594e'}) <- [:Relationship{name:' Chinese name'}]-(n),(n) - [:Relationship{name:' profession'}]->(m) return distinct m.name limit 1"}, {"query": "Give me all the information about SKF 22380CAK/W33 bearings in three seconds?", "cypher": "match (x:ENTITY{name:'SKF 22380CAK/W33 bearing'}) --(p) with p order by p.name return p.name"}, {"query": "What is the name of the chemical called 1-Adamantyl methyl ketone?", "cypher": "The name of the product is \"Relationship\" (Relationship)"}, {"query": "The conference was held in Beijing, China, on the theme of disaster history.", "cypher": "match (q:ENTITY{name:'China disaster history'}) <- [:Relationship{name:'content'}]- (p) return p.name"}, {"query": "Can you give me five items that I can use to find out about archaeological sites?", "cypher": "match (:ENTITY{name:'Archaeological artifacts'}) <--(n) return n.name limit 5"}, {"query": "Can you tell me what Nova's entry is?", "cypher": "match (:ENTITY{name:'\u30ce\u30fc\u30d0'}) <- [:Relationship{name:' foreign language name'}]- ((x) - [:Relationship{name:' entry work'}]->(p) return distinct p.name"}, {"query": "What is the name of the nation of King Seuss and what are his labels?", "cypher": "The name of the game is \"The Battle of the Sexes\" (Relationship) and the name of the game is \"The Battle of the Sexes\" (Relationship)."}, {"query": "What are the public schools in Ning District, Shanghai?", "cypher": "match (:ENTITY{name:'Shanghai Mayor Ning District'}) <- [:Relationship{name:'area'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='public secondary school' return m.name"}, {"query": "I know that the school was founded in 1958 and the current principal is Liu Weifang, so give me five more details.", "cypher": "match (n:ENTITY{name:' downloader school'}) -->(h) with h order by h.name where h.name <> '1958' and h.name <> 'Jin Wei Fang' return h.name limit 5"}, {"query": "The county is also known as Sheridan County.", "cypher": "match (:ENTITY{name:'Shyam County'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'alpha name'}]->(q) return distinct q.name"}, {"query": "I recommend three TV series shot in Shanghai, not the summer of bubbles.", "cypher": "match (:ENTITY{name:'Shanghai'}) <- [:Relationship{name:'place of birth'}]-(m),(m) - [:Relationship{name:'main works'}]->(h) where h.name <> 'Summer of the Foam' return distinct h.name limit 3"}, {"query": "Can you recommend a film or TV series that Sugiyama loves?", "cypher": "Match (:ENTITY{name:'Sujiragi'}) <- [:Relationship{name:'main character'}]- (n) return n.name"}, {"query": "The first is that the people who are in the village are not very good at school, but they are not very good at school.", "cypher": "match (:ENTITY{name:'canopy, villa/child, you can't go'}) --(x) with x order by x.name return x.name"}, {"query": "What are the main works of the authors of the 10 constellations of Virgo?", "cypher": "match (:ENTITY{name:'virgin'}) <- [:Relationship{name:'star'}]- ((n) - [:Relationship{name:'main work'}]->(m) return distinct m.name limit 10"}, {"query": "What is the name of the largest Chinese campus community affiliated with Search?", "cypher": "match (:ENTITY{name:'Search'}) <- [:Relationship{name:'affiliated'}]-(m), (m) - [:Relationship{name:'nature'}]->(n) where n.name='China's largest campus community' return distinct m.name"}, {"query": "Have you heard about the 1969 Singapore race riots?", "cypher": "match (:ENTITY{name:'1969 Singapore ethnic riots'}) --(q) with q order by q.name return q.name"}, {"query": "What is the name of the event organized by Chinese Online?", "cypher": "match (:ENTITY{name:' in Chinese online'}) <- [:Relationship{name:' host unit'}]- (h) return h.name"}, {"query": "The two types of relationships that Emily's mourning involves are what, five?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'to mourn Emily's mother's death'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 5"}, {"query": "What profession did you take after fighting in the anti-Japanese war, the liberation war, the heroic war against the Axis?", "cypher": "match (:ENTITY{name:'anti-Japanese War, Liberation War, Anti-US-Assistance Korea, etc'}) <- [:Relationship{name:'main achievements'}]- ((x) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 5"}, {"query": "The Soviet-built Type 671 attack nuclear submarine, when was it designed?", "cypher": "match ((:ENTITY{name:'671 attack nuclear submarine'}) - [:Relationship{name:'temporary time'}]-> (m) return m.name"}, {"query": "Can you help me find the phone number in Yangon?", "cypher": "match ((:ENTITY{name:'Picnic'}) - [:Relationship{name:'Phone area code'}]-> (n) return n.name"}, {"query": "What is the slang term?", "cypher": "match (:ENTITY{name:''}) - [:Relationship{name:'do not call'}]-> (m) return distinct m.name"}, {"query": "Can you help me find the alias of the thermobaric bomb?", "cypher": "match (:ENTITY{name:'thermobaric bomb'}) <- [:Relationship{name:' foreign language name'}]-(x),(x) - [:Relationship{name:' alias'}]->(h) return distinct h.name"}, {"query": "Do you know anything else about John Lennon's Ideal World other than the 1988 release? Help me find 4 pieces of information in 2 layers.", "cypher": "match (:ENTITY{name:' The Ideal World of John Lennon'}) - [*1..2]-(p) where p.name <> '1988/10/7' return p.name limit 4"}, {"query": "Do you know what 100 classic books are?", "cypher": "match (:ENTITY{name:'100 classic books'}) --(q) with q order by q.name return q.name"}, {"query": "Who is the first of the top 10 entertainment personalities of 2013 according to the news, and what is your impression?", "cypher": "Match (s) (n) return (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n) (n)"}, {"query": "The building in which the street is located is the one in which the city is located.", "cypher": "match (:ENTITY{name:'Appreciation Street'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'city to which belongs'}]->(n) return distinct n.name"}, {"query": "What other labels can you give to the 100 different types of ants in the publication?", "cypher": "match (x:ENTITY{name:'100 different practices'}) - [:Tag{name:'tags'}]-> (n) with n order by n.name where n.name <> 'publications' return n.name"}, {"query": "What is the shortest relationship path between the two layers of diffraction and diffraction?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortest paths'}) - [*..2]-(b:ENTITY{name:'shortest paths'})) return count ((p)"}, {"query": "Do you want to know about the 5 facts about the mathematics teacher Wang Zhenjia?", "cypher": "match (n:ENTITY{name:'spanish'}) - [*]->(x) where x.name <> 'math teacher' return distinct x.name limit 5"}, {"query": "Can you list any artifacts from the Zhejiang Provincial Museum collection?", "cypher": "The museum is located in the city of Zhejiang, Zhejiang Province."}, {"query": "Can you find me four publications published by the WU Teacher's University Press?", "cypher": "match (:ENTITY{name:'Washington University Press'}) <- [:Relationship{name:'Publications'}]-(h),(h) - [:Relationship{name:'Book name'}]->(q) return distinct h.name,q.name limit 4"}, {"query": "What else do you know about the Bay of Lei besides that it belongs to the Shandong Tobacco Company?", "cypher": "match (:ENTITY{name:'Relationship*1..2]-(p) where p.name <> 'Shandong Province Tobacco City' return p.name limit 10"}, {"query": "Can you list five items related to the 2008 Jiangmen Municipal Work Report?", "cypher": "match (n:ENTITY{name:'2008 Jiangmen City Government work report'}) - [*]->(x) where x.name <>'2008 Jiangmen City Government work report' return distinct x.name limit 5"}, {"query": "Do you know how much she is charging for her book?", "cypher": "match (:ENTITY{name:'Wendell's edited}) <- [:Relationship{name:'author'}]- ((x),(x) - [:Relationship{name:'priced'}]->(q) return distinct q.name"}, {"query": "What kind of novels are there where the guy who is related to the real-life Shin Tae-yong and the real-life General Shin Tae-yong?", "cypher": "match (:ENTITY{name:'hyunjin and the real-life generals'}) <- [:Relationship{name:'blood source'}]-(h),(h) - [:Relationship{name:'type'}]->(m) return distinct m.name"}, {"query": "What is the name of the processor that uses A4 A6 A8 A10 A12 series?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Do you know the name of the vans made by Makina?", "cypher": "match (:ENTITY{name:'Makinara'}) <- [:Relationship{name:'production unit'}]- (p) return p.name"}, {"query": "The following is a list of the top 10 best-selling singles of all time, including the number one single of the year, \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song Ever\", \"The Best Song is the One and the Best is the Other One\" and \"What is the Meaning of This?\"", "cypher": "match (n:ENTITY{name:'suburbs vocabulary\u00b7\u5584\u80dc\u821e\u00b7\u987a'}) - [:Relationship*1..3]->(x) where x.name <>'\u4e50\u5e9c' return distinct x.name"}, {"query": "The three species of the family are distributed in which regions?", "cypher": "match (:ENTITY{name:'clown'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' distribution area'}]->(n) return m.name,n.name limit 3"}, {"query": "What are the films directed by Kim Yong-kyu? Can you tell me about five?", "cypher": "Match (:ENTITY{name:'Kin Yong-kyu'}) <- [:Relationship{name:'director'}]-(p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 3"}, {"query": "Tell me about three famous alumni of Zhongning Vocational High School, but who else besides Liu Guo and Chen Minghui?", "cypher": "match (n:ENTITY{name:'Zhouning Vocational Secondary School'}) -[:Relationship{name:'known alumnus'}]->(h) where h.name <> 'Hong Kong' and h.name <> 'Chenming Yang' return distinct h.name limit 3"}, {"query": "I'm going to be the first to introduce you to some of the most representative works of Conti Barber.", "cypher": "match (:ENTITY{name:'Conte Barber'}) - [:Relationship{name:'representing work'}]-> (m) return m.name skip 3"}, {"query": "I'm looking for a book published by Taobao Literature Publishing, can you find me three?", "cypher": "match (:ENTITY{name:'Tao Wei Literature Publishing House'}) <- [:Relationship{name:'Publishing House'}]-(n) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 3"}, {"query": "Do you know how the Sony A580 works?", "cypher": "match (:ENTITY{name:'Soniaa580'}) <- [:Relationship{name:'Chinese name'}]- ((n) - [:Relationship{name:'operating method'}]->(h) return distinct n.name"}, {"query": "There is a service hotline that is responsible for industry complaints, consultations, what is it called?", "cypher": "match (:ENTITY{name:' Accepting complaints and consultations from industry'}) <- [:Relationship{name:' Function'}]- (h) return h.name"}, {"query": "(+) - Can you help me check the molecular weight of the bag of dandelion?", "cypher": "match ((:ENTITY{name:'(+) - packet of jellyfish'}) - [:Relationship{name:'molecular mass'}]-> (x) return x.name"}, {"query": "What is the shortest distance between Ningxia Central Mountain Hospital and Ningxia Beijing Women's Hospital within two floors?", "cypher": "match p=allshortestpaths (((a:entity{name:'Ningxia Central Mountain Hospital'}) - [*..2]-(b:ENTITY{name:'Ningxia Beijing Women's Hospital'})) return count ((p)"}, {"query": "I want to know who is the president of the Civilian Village of Xi'an County in accordance with the law.", "cypher": "match (:ENTITY{name:'Consistent with the City of Xi'an County Citizenship Village's Chairman'}) --(h) return h.name order by h.name"}, {"query": "Do you know Sam Hunt's nickname? Name three, please.", "cypher": "match (:ENTITY{name:'Sam Hunt, American country singer, former college football player\u3002'}) <- [:Describe{name:'description'}]-(p) - [:Relationship{name:'alias'}]->(q) return distinct p.name limit 10"}, {"query": "What are the main awards that the Lao Dragon Center in Jinjiang, Jiangsu province has received?", "cypher": "match (:ENTITY{name:'Relationship Centre of the city of Jinjiang, Jiangsu Province'}) <- [Relationship{name:'Chinese name'}]- ((q),(q) - [Relationship{name:'main award'}]->(n) return distinct n.name limit 3"}, {"query": "Do you know what is the profession of Ben Ben?", "cypher": "match (m:ENTITY{name:'spanish'}) <- [:Relationship{name:'spanish'}]- ((x) - [:Relationship{name:'spanish'}]->(n) return distinct n.name limit 1"}, {"query": "1940s people - What other professions were born in 1940 besides one of the artists?", "cypher": "match (:ENTITY{name:'1940'}) <- [:Relationship{name:'date of birth'}]-(h) - [:Relationship{name:'profession'}]->(n) where n.name <> 'artist' return distinct n.name limit 3"}, {"query": "Do you know what kind of propulsion system the Type 001A carrier uses?", "cypher": "match ((:ENTITY{name:'001A aircraft carrier'}) - [:Relationship{name:'power unit'}]-> (n) return n.name"}, {"query": "Please explain the simplified Chinese version of the National Standard of the People's Republic of China: Flammable Alloy Board 3 layers in relation to the details of the introduction.", "cypher": "match (n:ENTITY{name:'National standard of the People's Republic of China: non-flammable aluminum plate'}) - [:Relationship*1..3]->(x) where x.name <>'simplified Chinese' return distinct x.name"}, {"query": "What has the production committee of Beyond the Border done?", "cypher": "match (:ENTITY{name:' Production committee from the other side of the border'}) <--(n) return n.name"}, {"query": "What is the metadata that can be used for engineering simulation analysis?", "cypher": "match (n:ENTITY{name:' engineering simulation analysis'}) --(x) return distinct x.name"}, {"query": "Do you know the names of the novels written by pencil marks?", "cypher": "match (:ENTITY{name:'falling down'}) <- [:Relationship{name:'author'}]- ((x) - [:Relationship{name:'Chinese name'}]->(h) return distinct h.name"}, {"query": "What is the book feeding and caring for babies 0-3 years old by Chemical Industries?", "cypher": "match (m:ENTITY{name:'0-3 years old baby feeding and care book'}) --(q) with q order by q.name where q.name <> 'chemical industry publisher' return q.name"}, {"query": "Which books have the same literary style as the carriage maker and what are the labels on them?", "cypher": "The following is a list of characters that appear in the game The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Z"}, {"query": "What does enmity mean? Where did it come from?", "cypher": "match (:ENTITY{name:'enemy and foe'}) - [:Relationship{name:'definition'}]->(n) return n.name as name union all match (:ENTITY{name:'enemy and foe'}) - [:Relationship{name:'outcome'}]->(m) return m.name as name"}, {"query": "Can you tell me which major departments can be included in the universities in Guangdong, China?", "cypher": "match (:ENTITY{name:'China Guangdong'}) <- [:Relationship{name:'area'}]-(n),(n) - [:Relationship{name:'main department'}]->(h) return distinct h.name"}, {"query": "Please explain the full content of the Nantong Maritime Vocational Technical College.", "cypher": "match (:ENTITY{name:'Nantong City Shipping Vocational Technical College'}) --(q) return q.name order by q.name"}, {"query": "The software operating system launched in June 2013 is still in good condition?", "cypher": "match (:ENTITY{name:'June 2013'}) <- [:Relationship{name:'listing date'}]-(p) - [:Relationship{name:'operating system'}]->(n) return distinct n.name"}, {"query": "I wonder what kind of jobs are there for the great ones?", "cypher": "match (:ENTITY{name:'strong family'}) <- [:Relationship{name:'ethnicity'}]-(m),(m) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 3"}, {"query": "What is Wang Rixit doing? Did he mention two jobs he did?", "cypher": "match (:ENTITY{name:'King of Swords'}) <--(n),(n) - [:Relationship{name:'Career'}]->(x) return distinct x.name limit 2"}, {"query": "Can you find out how big the hot spring area and lake view water system is in Yangtze?", "cypher": "match (x:ENTITY{name:'Yangsiung waterfall resort'}),(x) - [:Relationship{name:'waterfall area'}]-> (m), (x) - [:Relationship{name:'lake view waterfall system'}]->(n) return m.name,n.name"}, {"query": "How about 19 tons of spray in 5 words?", "cypher": "match (:ENTITY{name:'19 nitrous spray'}) --(p) with p order by p.name return p.name limit 5"}, {"query": "Can you tell me about one of Tracy Kay Wolfe's representative works?", "cypher": "match (:ENTITY{name:'Tracy Kay Wolfe'}) - [:Relationship{name:'represents work'}]-> (h) return distinct h.name limit 1"}, {"query": "The following is a list of topics related to the two-tiered relationship of urban geography in Northeast China, published by Science Press.", "cypher": "match (n:ENTITY{name:'Northeast China's urban geography'}) - [:Relationship*1..3]->(x) where x.name <> 'scientific publisher' return distinct x.name"}, {"query": "What are the most representative works of the writer who died on March 22, 2015? Can you name three?", "cypher": "match (:ENTITY{name:'22 March 2015'}) <- [:Relationship{name:'date of death'}]-(h) - [:Relationship{name:'representative work'}]->(n) return distinct n.name limit 3"}, {"query": "What are the novels that are being published in Jinjiang Literature City? Can you tell me seven?", "cypher": "match (m:ENTITY{name:'Jingjiang City'}) <- [:Relationship{name:'connecting platform'}]- (p) return p.name limit 7"}, {"query": "Tell me, what are the two main ingredients of the purple rice besides the purple rice and the iced sugar?", "cypher": "match (n:ENTITY{name:'Relationship{name:'main ingredient'}]->(h) with h order by h.name where h.name <> 'purple rice' and h.name <> 'ice sugar' return h.name limit 2"}, {"query": "What is the name of the accident that killed 21 people?", "cypher": "match (:ENTITY{name:'21 dead'}) <- [:Relationship{name:'personal injury'}]- (m) return distinct m.name"}, {"query": "What are the lessons in Zhuhai's primary school?", "cypher": "match (:ENTITY{name:'Jubei City High School'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'School training'}]->(n) return distinct n.name"}, {"query": "I'm going to be a little more specific about this.", "cypher": "match (:ENTITY{name:'brad paisley'}) --(x) return x.name skip 3 The name of the match is"}, {"query": "I would like to know what are the main ingredients of Taiwanese roasted corn. What is it for and what storage methods are used?", "cypher": "match (:ENTITY{name:'Taiwan roasted corn'}) - [:Relationship{name:'main raw material'}]->(n) return n.name as name union all match (:ENTITY{name:'Taiwan roasted corn'}) - [:Relationship{name:'suitable for the crowd'}]->(m) return m.name as name union all match (:ENTITY{name:'Taiwan roasted corn'}) - [:Relationship{name:'(storage method'}]->r) return r.name as name"}, {"query": "Can you quickly name three labels for a 1980 model 7.62mm automatic pistol?", "cypher": "match (:ENTITY{name:'1980 model year 7.62 mm automatic pistol'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 3"}, {"query": "Do you know which company has 2,000 law firms and more than 30,000 lawyers on its operating team?", "cypher": "match (:ENTITY{name:'2 thousand law firms, over 30,000 lawyers'}) <- [:Relationship{name:'operating team'}]- (q) return q.name"}, {"query": "Can you name 20 Chinese teachers who don't repeat themselves?", "cypher": "match (:ENTITY{name:'teacher'}) <--(m), (m) --(n) where n.name='China' return distinct m.name limit 20"}, {"query": "Do you know which match was held on 27.7.2015?", "cypher": "match (:ENTITY{name:'2015.7.27'}) <- [:Relationship{name:' time of holding'}]- (x) return distinct x.name"}, {"query": "10 schools with the same name as the University of Technology, Eddiscoville and founded in 1989 are recommended.", "cypher": "match (:ENTITY{name:'1989'}) <- [:Relationship{name:'time of founding'}]-(x),(x) - [:Relationship{name:'known alumni'}]->(m) where m.name <> 'Corting University of Technology, Edinburgh University' return distinct m.name limit 10"}, {"query": "What is the name of the fishology that we commonly call the colored flower?", "cypher": "match (:ENTITY{name:'color gift flower, stone stick'}) <-[:Relationship{name:'clan name'}]-(m) return distinct m.name"}, {"query": "Can you find the top 10 introductions to you for my fork?", "cypher": "match (:ENTITY{name:' you are my fork'}) --(h) with h order by h.name return h.name limit 10"}, {"query": "I want to know what the 1945 fighter's label says.", "cypher": "match (:ENTITY{name:'1945 fighter'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "The first three Chinese names for 11 God Thieves are?", "cypher": "match (:ENTITY{name:'11 godfather'}) - [:Relationship{name:'Chinese name'}]-> (q) with q order by q.name return q.name limit 3"}, {"query": "What companies are there in Qingdao?", "cypher": "match (p:ENTITY{location:'Qingdao'}) return p.name"}, {"query": "What is the domestic and foreign editions of the Modern History Studies of Liu Xiaobo?", "cypher": "match (r:ENTITY{name:'Modern History Research'}) - [:Relationship{name:' Domestic issue'}]->(n) return n.name as name union all match (r:ENTITY{name:'Modern History Research'}) - [:Relationship{name:'International issue'}]->(m) return m.name as name"}, {"query": "The most famous attractions in the Welsh Grey Provincial Park are Hanken Falls and Dawson Falls, to name but two.", "cypher": "match (n:ENTITY{name:'Wells Grey Provincial Park'}) - [:Relationship{name:'Famous attractions'}]->(h) where h.name <> 'Hanken Falls' and h.name <> 'Dawson Falls' return distinct h.name limit 2"}, {"query": "I need to know about 18K gold X-rays by five things?", "cypher": "match (:ENTITY{name:'18K gold X pendant'}) --(h) with h order by h.name return h.name limit 5"}, {"query": "Which dialect is the official language of Beijing - Zhongshan - Zhongshan?", "cypher": "match (:ENTITY{name:'Beijing official language-\u671d\u5cf0\u7247-\u671d\u9633\u8bdd'}) <- [:Relationship{name:'dialect'}]-(x),(x) - [:Relationship{name:'transport'}]->(q) return distinct x.name,q.name"}, {"query": "What is the English name of Duncan?", "cypher": "match ((:ENTITY{name:'spanish'}) - [:Relationship{name:'spanish name'}]-> (n) return n.name"}, {"query": "What are the five labels of a young rain besides poetry and literature?", "cypher": "match (n:ENTITY{name:'bring a younger rain'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'poetry' and h.name <> 'literature' return distinct h.name limit 5"}, {"query": "Do you know which units are working with the 2012 Wu Zetian Concert?", "cypher": "Match (s) (h) return (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h (h) (h) (h) (h) (h (h"}]