[{"query": "I would like to know about the three-tier relationship company related to the organization Xinjiang Green Building Co., Ltd.", "cypher": "match (n:ENTITY{name:'Xinjiang Green Building Co. Ltd'}) - [*1..3]->(x) where x.name<>'organizing entity' return distinct x.name"}, {"query": "Tell me, what are the five types of jobs that Chinese nationals do?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(m),(m) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 5"}, {"query": "Help me find a German novelist.", "cypher": "match (:ENTITY{name:'Germany'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='playwright, novelist' return distinct m.name limit 1"}, {"query": "Can you tell me which of them are famous alumni of the Beijing Yangtze River Experimental High School?", "cypher": "match (:ENTITY{name:'Beijing City Yangtze Experimental Secondary School'}) - [:Relationship{name:'Known Alumni'}]-> (h) return h.name order by h.name limit 5"}, {"query": "Can you give me a list of exhibition events in Beijing China International Expo Center?", "cypher": "match (m:ENTITY{name:'Beijing China International Exhibition Center'}) <- [:Relationship{name:' Exhibition location'}]- (p) return p.name"}, {"query": "How many companies have you started in the last 14 years?", "cypher": "match (p:ENTITY{time:'2014'}) return count ((p)"}, {"query": "Do you know what kind of medicine is bringing hope to patients with terminal tumors?", "cypher": "match (:ENTITY{name:'bringing hope to patients with incurable tumors'}) <- [:Relationship{name:'impact'}]- (q) return q.name"}, {"query": "Tell me about the two pine-street labels, apart from society and life.", "cypher": "match (n:ENTITY{name:'Pinewood Boulevard'}) - [:Tag{name:'tag'}]->(h) with h order by h.name where h.name <> 'society' and h.name <> 'life' return h.name limit 2"}, {"query": "What are the five types of relationships within the four levels of Lotus Bridge Station?", "cypher": "The following pages link to The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The Lottery: The"}, {"query": "Which works and books were written in the same year and are each labeled with a rose?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "What was the name of the concert held on 11 and 12 September 2011?", "cypher": "match (:ENTITY{name:'September 11 and 12, 2011'}) <- [:Relationship{name:' time of event'}]- (p) return p.name"}, {"query": "In addition to the 20+ awards for the Riverside City Ethical Education Advanced Collective, which awards has Li received?", "cypher": "match (:ENTITY{name:'Liangmianhuang Middle School or Liangmianhuang'}) <- [:Relationship{name:'abbreviated as '}]-(p),(p) - [:Relationship{name:'Main award'}]->(x) where x.name <> 'River City Deaf Education Advanced Collective and other 20+ projects' return distinct x.name limit 5"}, {"query": "Can you tell me a label for 100 euro?", "cypher": "match (:ENTITY{name:'100ioo\u5229\u8d2d\u4e70'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 1"}, {"query": "I want five messages from industry figures like He Changping, okay?", "cypher": "match (n:ENTITY{name:'Hengming'}) - [*]->(x) where x.name<>'industry person' return distinct x.name limit 5"}, {"query": "The first is to find the most accomplished Americans in the world.", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(q),(q) - [:Relationship{name:'main achievements'}]->(p) return q.name order by q.name limit 1"}, {"query": "I would like to know more about the game Black Girl 1/9.", "cypher": "match (h:ENTITY{name:'1/9 black girl'}) --(q) with q order by q.name where q.name <> 'game' return q.name"}, {"query": "What is the name of the book with the ISBN number 9787549239306?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Who is the Denver Nuggets' 34th?", "cypher": "match (:ENTITY{name:'Denver Miners'}) <- [:Relationship{name:'Related team'}]-(m), (m) - [:Relationship{name:'T-shirt number'}]->(n) where n.name='34' return distinct m.name"}, {"query": "Can you tell me what the foreign name of this book is and what language and publisher it is in?", "cypher": "match (:ENTITY{name:'positive energy heartbeat'}) - [:Relationship{name:'foreign language heartbeat'}]->(n) return n.name as name union all match (:ENTITY{name:'positive energy heartbeat'}) - [:Relationship{name:'speech'}]->(m) return m.name as name union all match (:ENTITY{name:'positive energy heartbeat'}) - [:Relationship{name:'publishing'}]-(r>) return r.name as name"}, {"query": "Can you recommend some of the famous places in the subtropical monsoon climate? Can you tell us about the top 5?", "cypher": "match (:ENTITY{name:'subtropical monsoon climate'}) <- [:Relationship{name:'climate type'}]-(n),(n) - [:Relationship{name:'famous attractions'}]->(h) return h.name skip 1 limit 5"}, {"query": "In no more than ten sentences, 1+1 easily won the Optimized Training in 6th grade Mathematics in addition to the publication labels?", "cypher": "match (:ENTITY{name:'1+1 easily won the optimization training; 6th grade math'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> ' publications' return q.name limit 10"}, {"query": "The 105 mm 6\u00d76 round armored assault gun has military tags, but what other tags are there?", "cypher": "match (:ENTITY{name:'105 mm 6\u00d76 round armored assault gun'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'military' return q.name"}, {"query": "What is the status of the Muns in Liang Shenyang?", "cypher": "match (p:ENTITY{name:'Manh'}) <--(x) --> ((q:ENTITY{name:'Lining Shenyang'}) return x.name"}, {"query": "Can you help me find five works by Zhang's wife?", "cypher": "match (:ENTITY{name:'\u5f20\u56fd\u7acb'}) <- [:Relationship{name:' husband'}]-(p) - [:Relationship{name:' main work'}]->(n) return distinct n.name limit 5"}, {"query": "Can you list three different professions that celebrities do?", "cypher": "match (:ENTITY{name:'person'}) <- [:Tag{name:'tag'}]-(m),(m) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 3"}, {"query": "You don't understand what the sale of a brick in two layers has to do with it?", "cypher": "The following is a list of all the different ways Match path=(n) <- [:Relationship*2]-(p:ENTITY{name:'sell a chicken'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "The group is based in the United States, but it is not affiliated with any political party.", "cypher": "match (:ENTITY{name:'metabolic class'}) - [:Relationship{name:' country'}]->(n) return n.name as name union all match (:ENTITY{name:'metabolic class'}) - [:Describe{name:'tag'}]->(m) return m.name as name"}, {"query": "The painting of General Meng Zhen is from which dynasty?", "cypher": "Match (:ENTITY{name:'Marshal Meng Xiaoqing's painting'}) - [:Relationship{name:'Dynasty'}]-> (m) return distinct m.name"}, {"query": "What are the benefits of the white skin, white fruit, and lean meat soup?", "cypher": "match (:ENTITY{name:'scrubbed white fruit lean meatballs'}) - [:Describe{name:'describe'}]->(n) return n.name"}, {"query": "The word definition.trel?", "cypher": "match (:ENTITY{name:'.trel'}) --(x) with x order by x.name return distinct x.name skip 1 limit 1"}, {"query": "What occupations do you know of this Chinese national? Can you name three?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(m),(m) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 3"}, {"query": "Help me find five words that read \"o\".", "cypher": "match (:ENTITY{name:'\u00e0o'}) <- [:Relationship{name:'spelling'}]-(m) return distinct m.name limit 5"}, {"query": "Help me find the 10 words next to the clothes.", "cypher": "match (:ENTITY{name:'clothing'}) <- [:Relationship{name:'clothing'}]-(m) return distinct m.name limit 10"}, {"query": "The number of the telephone number of the Environmental Emergency and Accident Investigation Center is?", "cypher": "match (:ENTITY{name:' Environmental Emergency and Accident Investigation Center'}) <- [:Relationship{name:' Management department'}]- (m) return m.name"}, {"query": "Do you know the waterfall character Mu Chun? What other information is there besides the 80th General of Liangsan, please find the other 7 information in layer 2", "cypher": "match (:ENTITY{name:'Mu Chun'}) - [:Relationship*1..2]->(p) where p.name <> '80th' return p.name limit 7"}, {"query": "Can you tell me who else has written about the \"Kinshasa\" campaign?", "cypher": "match (:ENTITY{name:'Crow's nest'}) --(x) return x.name order by x.name"}, {"query": "I heard that the 11.30 Shibuya earthquake was very strong, do you know what the specific magnitude was?", "cypher": "match ((:ENTITY{name:'11\u00b730 when the earthquake occurs'}) - [:Relationship{name:'seismic level'}]-> (m) return m.name"}, {"query": "Can you tell me about the book Chess Tactics in General?", "cypher": "match (:ENTITY{name:'chess tactics in general'}) <- [:Relationship{name:' book name'}]-(x),(x) - [:Tag{name:'tag'}]->(q) return distinct q.name"}, {"query": "The film is based on the life of the French actor Th\u00e9ophile Gautier, who was born in Paris in 1928.", "cypher": "match (:ENTITY{name:'Th\u00e9ophile Gottier'}'}) - [:Relationship{name:'nationality'}]->(n) return n.name as name union all match (:ENTITY{name:'Th\u00e9ophile Gottier'}) - [:Relationship{name:'representing work'}]->(m) return m.name as name"}, {"query": "Can you recommend a hybrid with a fuel consumption of 7 liters?", "cypher": "match (:ENTITY{name:'7L'}) <- [:Relationship{name:'complete state of use fuel consumption'}]- (x) return x.name"}, {"query": "I'm trying to find a way to write a simple and confusing type, what is the full name?", "cypher": "match (:ENTITY{name:' short and confused'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:' full name'}]->(n) return distinct m.name,n.name limit 1"}, {"query": "What is the name of the freshwater whitefish and where is it mainly found?", "cypher": "match (:ENTITY{name:'sweetwater whitefish'}) - [:Relationship{name:'do not call'}]->(n) return n.name as name union all match (:ENTITY{name:'sweetwater whitefish'}) - [:Relationship{name:'distribution area'}]->(m) return m.name as name"}, {"query": "What about the Shanghai-born scientists?", "cypher": "match (:ENTITY{name:' Shanghai'}) <- [:Relationship{name:' place of birth'}]-(m), (m) - [:Tag{name:' tag'}]->(n) where n.name='scientist' return m.name"}, {"query": "What do people born in Dongde Town, Liujiang County do?", "cypher": "match (:ENTITY{name:'Liujiang County German Town'}) <- [:Relationship{name:'birthplace'}]-(h),(h) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 4"}, {"query": "What is the name of a common Southern snack made from rice and fodder?", "cypher": "match (:ENTITY{name:'a common southern snack'}) <- [:Relationship{name:'definition'}]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) where n.name='rice, rice' return distinct m.name"}, {"query": "Can you get me three industrial books to read?", "cypher": "match (:ENTITY{name:'industrial book'}) <- [:Tag{name:'tag'}]-(n) - [:Relationship{name:'book'}]->(q) return distinct q.name limit 3"}, {"query": "I would like to know what the scope of the 50 yuan card is?", "cypher": "match (:ENTITY{name:'50\u5143'}) <- [:Relationship{name:'hanging off fee'}]-(p) - [:Relationship{name:'scale of domain'}]->(x) return distinct x.name limit 1"}, {"query": "Do you know which concert has a song that features the heroine, her back-up, etc?", "cypher": "match (:ENTITY{name:'You are the heroine, you are the shadow of her back'}) <- [:Relationship{name:'Represents song'}]- (n) return n.name"}, {"query": "Segatta Viktor Smari is an Icelander born on November 21, 1992. I would like to know four more things about him.", "cypher": "match (n:ENTITY{name:'Segatta Viktor Smari'}) -->(h) with h order by h.name where h.name <> '1992/11/21' and h.name <> 'Iceland' return h.name limit 4"}, {"query": "What else do you know about the campus underground besides the work of director Park Geun-hye?", "cypher": "match (:ENTITY{name:'campus underground'}) - [:Relationship*1..3]-(p) where p.name <> 'Pong's' return p.name limit 5"}, {"query": "Can you name five Albanian writers who have been so well represented?", "cypher": "match (x:ENTITY{name:'Albania'}) <- [:Relationship{name:'nationality'}]-(h),(h) - [:Relationship{name:'representative work'}]->(p) return distinct p.name limit 5"}, {"query": "Can you list five things in a four-tier relationship that are related to English footballer Delph Fabian?", "cypher": "match (n:ENTITY{name:'Delph Fabian'}) - [*1..4]->(x) where x.name <>'Delph Fabian, English footballer\u3002' return distinct x.name limit 5"}, {"query": "I'm going to be taking a look at the top 10 things about Jilin North China University.", "cypher": "match (:ENTITY{name:'Jilin North China University'}) --(p) return p.name order by p.name limit 10"}, {"query": "What other achievements have graduates of the Department of Political Science at Nanking University achieved besides the 2009 Nanking University Award for Outstanding Achievement in Social Science Research?", "cypher": "match (:ENTITY{name:'Political Science Department'}) <- [:Relationship{name:' Graduate School'}]-(q) - [:Relationship{name:' Major achievements'}]->(p) where p.name <> '2009 NTU Social Science Research Award for Outstanding Achievement' return distinct p.name limit 1"}, {"query": "What is the shortest relationship path between the two layers of the redback and the corn cob?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'redback spider'}) - [*..2]-(b:ENTITY{name:'corn spider'})) return count ((p)"}, {"query": "Asking ten princesses who fell in love with your Chinese name?", "cypher": "match (:ENTITY{name:'Princess Princess Loves You'}) - [:Relationship{name:'Chinese name'}]-> (h) with h order by h.name return distinct h.name limit 10"}, {"query": "I'm going to ask you, what are the other names of the South Road in Han City?", "cypher": "match (:ENTITY{name:'Han City Road'}) <- [:Relationship{name:'Chinese name'}]- ((h) - [:Relationship{name:'alpha name'}]->(p) return distinct p.name limit 2"}, {"query": "When did the 2013 CCTV celebrity selection kick off?", "cypher": "Match ((x:ENTITY{name:'2013 CCTV world famous person'}) - [:Relationship{name:' Selected first review'}]-> (n) return n.name"}, {"query": "Tell me, is this Ignacy Jan Paderewski a good man?", "cypher": "match (:ENTITY{name:'Ignacy Jan Paderewski'}) --(h) return distinct h.name"}, {"query": "Do you know which labels are there in the National Palace of Culture? Can you tell me three other good ones besides entertainment?", "cypher": "match (:ENTITY{name:'All the People's Palace'}) - [:Tag{name:'tags'}]-> (p) with p order by p.name where p.name <> 'entertainment work' return p.name limit 3"}, {"query": "What are some of the songs sung by Huang Zheng?", "cypher": "match (:ENTITY{name:'\u9ec4\u8d2f\u4e2d'}) <- [:Relationship{name:' original song'}]-(p) - [:Relationship{name:' Chinese name'}]->(n) return distinct n.name"}, {"query": "Help me find 10 species of vertebrates in the subfamily", "cypher": "match (:ENTITY{name:' vertebrate Armenia'}) <- [:Relationship{name:' Armenia'}]- ((h) return h.name limit 10 This is a list of characters that are listed in the game."}, {"query": "What are the 5 messages of emotional motherhood besides music that you can tell me?", "cypher": "match (:ENTITY{name:'the feeling of being alone'}) --(m) with m order by m.name where m.name <> 'music' return distinct m.name limit 5"}, {"query": "Do you have any information about the relationship between the three layers of the hive?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' beehive'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "Who is the one who has graduated from the fourth edition of the Radio Artists Training Course and will give me his representative work?", "cypher": "match (:ENTITY{name:' fourth period of radio artists training class'}) <- [:Relationship{name:' graduate school'}]-(h) - [:Relationship{name:' major works'}]->(x) return h.name order by h.name,x.name limit 10"}, {"query": "The book is called \"Audio Presenting Theory\" and it is related to the book \"Introduction to a book with no more than four levels of relationship\".", "cypher": "match (n:ENTITY{name:' hosted by the broadcaster'}) - [*1..4]->(x) where x.name <> 'book name' return distinct x.name"}, {"query": "I'm not sure what kind of concerts were held at the Workers' Stadium.", "cypher": "match (:ENTITY{name:'Workers' Stadium'}) <- [:Relationship{name:'Concert venue'}]- (p) return p.name"}, {"query": "I know the second season of Don't Be Proud airs on January 11, 2017, do you know the other times?", "cypher": "match (:ENTITY{name:'Don't be so proud [2016 ?? \u82b8, A Dream of a Lifetime]'}) - [:Relationship{name:' air time'}]-> (q) with q order by q.name where q.name <> '11 January 2017 ((second season)) ' return q.name"}, {"query": "Do you know what the occupation of a person born in Nanchang, Jiangxi Province is?", "cypher": "match (:ENTITY{name:'Nanjing City'}) <- [:Relationship{name:'Born'}]-(m),(m) - [:Relationship{name:'Profession'}]->(x) return x.name skip 1 limit 3"}, {"query": "Tell me about some of the major departments at the Faculty of Law in Cecil C. Flesch, the top five.", "cypher": "match (:ENTITY{name:'Cape Fles Law School'}) <- [:Relationship{name:'Main Faculty'}]- (m) return m.name order by m.name limit 5"}, {"query": "Can you list the five types of professions that politicians do?", "cypher": "match (:ENTITY{name:'political figure'}) <- [:Tag{name:'tag'}]-(x),(x) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 5"}, {"query": "I'm not sure what this person is doing.", "cypher": "match (x:ENTITY{name:'Duncan'}) --(q) return q.name order by q.name"}, {"query": "Can you find out about the personal life of the football prodigy Merdovic in the Luka 2 relationship?", "cypher": "match (n:ENTITY{name:'Merdovic Luka'}) - [:Relationship*1..2]->(x) where x.name<>'football' return distinct x.name"}, {"query": "The following is a brief introduction to the 2012 Central to Local National Key Ecosystem Functional Areas Transfer Payment Process.", "cypher": "match (:ENTITY{name:'2012 Central to local national key ecological functional areas transfer payment method'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "Can you tell us about Hannah Emily Anderson, please?", "cypher": "match (:ENTITY{name:'Hannah Emily Anderson'}) --(h) return h.name order by h.name"}, {"query": "What country is Van Kang from?", "cypher": "Match ((:ENTITY{name:'spanish'}) - [:Relationship{name:'nationality'}]-> (n) return n.name"}, {"query": "Tell me about Kevin Allen's career, first line?", "cypher": "match (:ENTITY{name:'Kevin Allen'}) - [:Relationship{name:'profession'}]-> (h) return h.name order by h.name limit 1"}, {"query": "I would like to know what kind of jobs are available for you? Can you give me 10?", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'profession'}]->(q) return q.name order by q.name limit 10"}, {"query": "I want you to tell me what other names are there for this place in Taipei?", "cypher": "match (:ENTITY{name:'Taylor'}) <- [:Relationship{name:'address'}]-(q) - [:Relationship{name:'do not name'}]->(x) return x.name order by x.name limit 10"}, {"query": "Do you know how many regular buses there are?", "cypher": "match (m:ENTITY{name:'bus'}) <- [:Relationship{name:'bus type'}]- (p) return distinct p.name"}, {"query": "The 2&#39;-deoxy-nucleotide-5&#39;-triphosphate salt mixed solution you used yesterday, what is its product number?", "cypher": "match ((:ENTITY{name:'2&#39;- deoxyribonucleic acid-5&#39;- triphosphate salt mixed solution'}) - [:Relationship{name:' product number'}]-> (m) return m.name"}, {"query": "I would like to know which places are associated with the third tier of the label of the University of Gambia?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Cobaya University'}) return distinct n.name limit 5 The name of the university is not known"}, {"query": "The two lakes are located in the southern part of the country, and the two lakes are located in the southern part of the country.", "cypher": "match (:ENTITY{name:'Two Lakes Special Area'}) - [*1..3]-(p) return p.name limit 20"}, {"query": "Do you know the label attribution of this social event, the 1.2 oil pipeline explosion in southern Yemen?", "cypher": "match (:ENTITY{name:'11\u00b72 South Yemen oil pipeline explosion'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'social event' return n.name"}, {"query": "The incident of the 10.22 Ikea wreckage, which caused a sensation, what is the status of the case?", "cypher": "match ((:ENTITY{name:'10.22 Lake Tahoe remains case'}) - [:Relationship{name:'case status'}]-> (x) return x.name"}, {"query": "What is the name of the incident involving a US Air Force B-52 bomber?", "cypher": "match (:ENTITY{name:'B-52 bomber of the United States Air Force'}) <- [:Relationship{name:' model'}]- (x) return x.name"}, {"query": "The book was published on 6/1/1998, what is the price?", "cypher": "match (:ENTITY{name:'1998/6/1'}) <- [:Relationship{name:' time of publication'}]- ((x),(x) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "Can you find out about the four-tier relationship between Wang Wei's work and the work of the Chongqing Monk [in the village of Abbey near Chongqing Temple]?", "cypher": "match (n:ENTITY{name:'\u5bc4\u5d07\u50e7[\u5d07\u5bfa\u8fd1\u4e1c\u963f\u8986\u6751]'}) - [*1..4]->(x) where x.name <>'\u738b\u7ef4' return distinct x.name"}, {"query": "What are the works of novelists called Khlo\u00e9 Ch'ing-wen?", "cypher": "match (:ENTITY{name:' cold\u6e05\u6c76'}) <- [:Relationship{name:' author'}]-(x),(x) - [:Relationship{name:' Chinese name'}]->(p) return distinct p.name"}, {"query": "Can you run away? Whose work is the little vanilla? Name the first three.", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}}) - (h) return h.name order by h.name limit 5"}, {"query": "Can you tell me what the relationship is between the two levels of psychological dysfunction involved?", "cypher": "The following pages link to The Unknown:"}, {"query": "Can you name some of the famous alumni of the school?", "cypher": "match (:ENTITY{name:'Divisionary secondary school is a mountain secondary school\u3002'}) <-[:Describe{name:'description'}]-(n) -[:Relationship{name:'known alumni'}]->(q) return distinct q.name"}, {"query": "Tell me about the work of the two-tier relationship between Hideyoshi and Nakano?", "cypher": "match (n:ENTITY{name:' and \u91ce\u5b50'}) - [:Relationship*1..2]->(x) where x.name <>'hino' return distinct x.name"}, {"query": "Can you tell me about the information about the Grand Canyon?", "cypher": "match (:ENTITY{name:'Crystal'}) --(p) return distinct p.name"}, {"query": "Can you find information on the relationship between the two layers of Chen's 20th century Western Marxist philosophy?", "cypher": "match (n:ENTITY{name:'20th century Western Marxist philosophy'}) - [:Relationship*1..2]->(x) where x.name <>'Chen Shih-min' return distinct x.name"}, {"query": "Can you please translate 175\u00b0 color blindness into other languages?", "cypher": "match (:ENTITY{name:'175\u00b0 color blind'}) <- [:Relationship{name:'other translated name'}]- (h) return distinct h.name"}, {"query": "Can you find out the five models? What are their nationalities?", "cypher": "The following is a list of the most commonly used names in the world:"}, {"query": "Quickly, give me three tags for the intelligence and potential of children aged 0-6 years old.", "cypher": "match (:ENTITY{name:'0-6 years of age children's intelligence and potential development'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "Can you tell me about the introduction to Don Quixote?", "cypher": "match (:ENTITY{name:'P'}) --(p) return p.name order by p.name limit 10"}, {"query": "The project that gave me the key to the building, the project that gave me the information about the three-tier relationship between my brother and my brother-in-law?", "cypher": "match (n:ENTITY{name:'problems less than the underlying brother'}) - [:Relationship*1..3]->(x) where x.name <>'building key' return distinct x.name"}, {"query": "Can you tell me about the three labels that are in the Ali-Tibet Arak Cemetery besides food and vegetables?", "cypher": "match (n:ENTITY{name:'Tibetan Ali as a cemetery in the form of a wooden mound'}) - [:Tag{name:'label'}]->(h) with h order by h.name where h.name <> 'food' and h.name <> 'dishes' return h.name limit 3"}, {"query": "What are the common symptoms of infectious spots?", "cypher": "match (:ENTITY{name:' Infectious red spots'}) - [:Relationship{name:' Common symptoms'}]-> (m) return distinct m.name"}, {"query": "Help me find the 11 words next to the three native words.", "cypher": "match (:ENTITY{name:'\u571f'}) <- [:Relationship{name:'\u90e8\u9996'}]-(m), (m) - [:Relationship{name:'\u603b\u7b14\u753b'}]->(n) where n.name='11' return distinct m.name limit 3"}, {"query": "Can you tell me about one of the representative works of this painter?", "cypher": "match (:ENTITY{name:'painter'}) <- [:Relationship{name:'profession'}]-(x) - [:Relationship{name:'representing work'}]->(m) return m.name order by m.name limit 1"}, {"query": "Rolet, a software on Android that teaches you to draw cartoon characters in three layers of relationships.", "cypher": "match (n:ENTITY{name:'Teach you to draw animated characters'}) - [*1..3]->(x) where x.name<>'Teach you to draw animated characters' is a software application for Android running on the platform 32.19 MB."}, {"query": "What is the price of Li's books?", "cypher": "match (:ENTITY{name:'Lee Min Ho'}) <- [:Relationship{name:'author'}]- ((n) - [:Relationship{name:'pricing'}]->(q) return distinct q.name"}, {"query": "Can you tell me about the three and a half seconds that will determine your life?", "cypher": "match (:ENTITY{name:'0.5 seconds decide your life'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 3"}, {"query": "Can you name two people who have secondary professional relationships with actors?", "cypher": "Match (n) - [:Relationship*2{name:'profession'}]->(p:ENTITY{name:'actor'}) RETURN distinct n.name limit 2"}, {"query": "I'm going to be writing a book about the science of 1-methylphenidate.", "cypher": "match (:ENTITY{name:'1-methylphenidate'}) --(n) with n order by n.name where n.name <> 'science' return n.name"}, {"query": "The asteroid is less than 900,000 miles (1.45 million kilometers) away, what is it called?", "cypher": "match (:ENTITY{name:'less than 900,000 miles (~1.45 million km) '}) <- [:Relationship{name:'distance from'}]- (n) return distinct n.name"}, {"query": "What are the symptoms of chronic non-convulsive gastritis?", "cypher": "match (:ENTITY{name:' Chronic non-convulsive gastritis'}) - [:Relationship{name:' common symptoms'}]-> (m) return distinct m.name"}, {"query": "How much do you know about the 12/15 riots in Athens, Greece?", "cypher": "match (:ENTITY{name:'12\u00b715 Greek Athens riots'}) --(q) with q order by q.name return q.name"}, {"query": "Do you know what the animals in the animal kingdom are called? Can you give me two examples?", "cypher": "The following is a list of the most commonly used characters in the game."}, {"query": "What is the other thing about the hornbeam?", "cypher": "match (:ENTITY{name:'sect'}) <-[:Relationship{name:'sect'}]-(m) where m.name <>'hornworm' return distinct m.name"}, {"query": "Can you find the EINECS login number for the dispersed blue peach RFL?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Who was born in Red Mountain City, Inner Mongolia, and went to the Haikou University?", "cypher": "match (p:ENTITY{name:'Harbin University'}) <--(x) -->(q:ENTITY{name:'Inner Mongolia Red Mountain City'}) return x.name"}, {"query": "Can you name three main functions of the substances that regulate the gut microbiome?", "cypher": "match (:ENTITY{name:'regulate the gut microbiome'}) <- [:Relationship{name:'main function'}]- ((n) return distinct n.name limit 3"}, {"query": "What is the software developed by Sun Studio?", "cypher": "match (:ENTITY{name:'to the sun's studio'}) <- [:Relationship{name:'developer'}]- (h) return distinct h.name"}, {"query": "Can you find me the tags for the contemporary historical event 10/29 in Guizhou, the demolition of the Public Security Building?", "cypher": "match (:ENTITY{name:'10\u00b729 Quang Nam demolition of the Public Security Building incident'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'contemporary historical event' return x.name"}, {"query": "Please try to label the publication as a \"Handbook for Growing Up for Toddlers 0-6 Years Old\".", "cypher": "match (:ENTITY{name:'0-6 years old early childhood development manual'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'publication' return x.name"}, {"query": "Can you name three teachers?", "cypher": "match (:ENTITY{name:'teacher'}) <- [:Relationship{name:'profession'}]- (x) return x.name limit 3"}, {"query": "What are the best-selling games developed by Nintendo?", "cypher": "match (:ENTITY{name:'Nintendo Corporation'}) <- [:Relationship{name:'developer'}]- ((m), (m) - [:Relationship{name:'best selling game'}]->(n)? return distinct m.name,n.name"}, {"query": "Who is the voice of the Saint Warrior star? Name 10?", "cypher": "match (x:ENTITY{name:'Sandwich Star'\u03a9'}) <- [:Relationship{name:'Log in work'}]-(h) - [:Relationship{name:'sounding'}]->(n) return distinct n.name limit 10"}, {"query": "Can you list the top 5 achievements of Steppenwolf?", "cypher": "match (m:ENTITY{name:'Stephan'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'main achievement'}]->(p) return distinct p.name limit 5"}, {"query": "The list of 7 dishes and their ingredients.", "cypher": "match (:ENTITY{name:'dishes'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'ingredients'}]->(n) return m.name, n.name limit 7"}]