[{"query": "Can you list the three levels of relationships involved in the two first-time migrants?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'first time on the web'}) UNWIND relationships(path) AS rel return distinct rel.name limit 2"}, {"query": "What are the main ingredients in the list of 10 delicious dishes?", "cypher": "match (:ENTITY{name:'old and rare'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'main raw material'}]->(n) return m.name,n.name limit 10"}, {"query": "The recipient of the Ministry of Agriculture, the Gansu Provincial Science and Technology Progress Award and the National Ministry's first and second-class award for seven consecutive years, has he achieved other achievements besides representing the cultivation of the Gansu apple tree?", "cypher": "match (:ENTITY{name:'Multiple times winner of the Ministry of Agriculture, Gansu Provincial Science and Technology Progress Award 7 times winner of the Provincial First and Second Class Award of the Ministry of State'}) <- [:Relationship{name:'main achievement'}]-(m),(m) - [:Relationship{name:'representative work'}]->(x) where x.name <> 'Relationship' return distinct x. limitname 10"}, {"query": "Where is the famous indoor gardening showcase?", "cypher": "match (:ENTITY{name:' indoor gardening exhibition area'}) <- [:Relationship{name:' famous attractions'}]- (p) return distinct p.name"}, {"query": "The Turkish journalist, who is also a member of the Turkish parliament, has been asked to give a profile of his three-tier relationship with Sharir Hamza.", "cypher": "match (n:ENTITY{name:'Shakir Hamza'}) - [*1..3]->(x) where x.name <>'Turkey' return distinct x.name"}, {"query": "Can you show me some personal information about the four-tier relationship with the attacking defender Hethuning Tony?", "cypher": "match (n:ENTITY{name:'Huthunning Tony'}) - [*1..4]->(x) where x.name <>'guard' return distinct x.name limit 5"}, {"query": "Please tell me the name of this famous person from the late Qing Dynasty.", "cypher": "match (:ENTITY{name:' late clear'}) <- [:Relationship{name:' at the time'}]-(p),(p) - [:Relationship{name:' word number'}]->(n) return n.name order by n.name limit 1"}, {"query": "Can you introduce the Chinese Academy of Sciences' Institute of Psychology?", "cypher": "match (:ENTITY{name:'Psychological Institute of the Chinese Academy of Sciences'}) --(q) return distinct q.name"}, {"query": "The position on the pitch belongs to the defender, he has played in all the places you know?", "cypher": "match (:ENTITY{name:'back'}) <- [:Relationship{name:'on-field position'}]- ((x),(x) - [:Relationship{name:'played'}]->(h) return h.name skip 1 limit 10"}, {"query": "The article was written by a journalist from the South China Sea who was a member of the South China Sea delegation to the UN General Assembly.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name<>'Sueyang' return distinct x.name limit 5"}, {"query": "The steel plate number of the 8407 material is ASSAB 8407 2M and is the same as the 8407 steel plate number.", "cypher": "match (:ENTITY{name:'8407 material'}) - [:Relationship{name:'steel plate number'}]-> (m) with m order by m.name where m.name <> 'ASSAB 8407 2M' return m.name"}, {"query": "The unit that operates the Beijing subway system is?", "cypher": "match (:ENTITY{name:'Beijing Metro'}) <- [:Relationship{name:'system name'}]- ((x) - [:Relationship{name:'operating unit'}]->(h) return distinct h.name"}, {"query": "Can you list three relationships that win in the two layers of tensions?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'win in ten'}) UNWIND relationships(path) AS rel return distinct rel.name limit 3"}, {"query": "The first is that the term \"metallic quadruple\" is not a scientific term, but a non-disciplinary one.", "cypher": "match (:ENTITY{name:'1-methyl tetrahedron'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'discipline' return p.name limit 1"}, {"query": "Find the company description in the 3-tier relationship related to the food additive acidic jellybean?", "cypher": "match (n:ENTITY{name:'acidic tartrate'}) - [:Relationship*1..3]->(x) where x.name <> 'food additives' return distinct x.name"}, {"query": "Apart from filming in India, what else do you know about Bollywood?", "cypher": "match (:ENTITY{name:'Bollywood love'}) - [*1..2]-(p) where p.name <> 'India' return distinct p.name limit 10"}, {"query": "I was wondering what are the famous places where tickets are free? Can you name three?", "cypher": "match (:ENTITY{name:' free'}) <- [:Relationship{name:' ticket price'}]- ((q),(q) - [:Relationship{name:' famous attraction'}]->(m) return m.name order by m.name limit 3"}, {"query": "I want all the information about the 16 books of the Neutral Glue Long Silk Sewing Machine.", "cypher": "match (n:ENTITY{name:' Neutral adhesive long thread machine'}) - [:Relationship*]->(x) where x.name <>'16' return distinct x.name"}, {"query": "Do you know what types of relationships are involved in the three layers of cabinet?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'simple'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Find out where the two players from Utrecht FC are from.", "cypher": "match (:ENTITY{name:'Udler FC'}) <- [*]-(m), (m) - [:Relationship{name:'nationality'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "What can be made with pig's belly and chicken?", "cypher": "match (:ENTITY{name:' pig's belly, chicken'}) --(x) return distinct x.name"}, {"query": "I know that Aevarsson \u00c1rmann Peter is an Icelandic footballer, can you tell me three more things about him?", "cypher": "match (n:ENTITY{name:'Aevarsson \u00c1rmann Peter'}) -->(h) with h order by h.name where h.name <> 'Iceland' and h.name <> 'football' return h.name limit 3"}, {"query": "Do you have any information on the location of the 5 second level relations with Beijing?", "cypher": "The following is a list of all the different ways The Great Wall of China is credited in the database:"}, {"query": "The article was written by a journalist from the Hong Kong-based newspaper, The Times of China.", "cypher": "match (:ENTITY{name:'1944 Mengyang Conference biography'}) --(q) with q order by q.name where q.name <> ' publication' return q.name"}, {"query": "So let me explain the pass function.", "cypher": "match (:ENTITY{name:' passing function'}) - [:Tag{name:' tag'}]-> (m) return distinct m.name"}, {"query": "Please tell me who is the founder of the website that promotes Chinese martial arts hygiene technology and inherits the classic traditional health culture?", "cypher": "match (:ENTITY{name:'Advancing Chinese martial arts hygiene technology, inheriting classic traditional hygiene culture'}) <- [:Relationship{name:'site slogan'}]-(m),(m) - [:Relationship{name:'founder'}]->(q) return q.name order by q.name limit 3"}, {"query": "Please list me a list of people who are thinkers by profession.", "cypher": "match (:ENTITY{name:'thinker'}) <- [:Relationship{name:'profession'}]- (x) return x.name order by x.name"}, {"query": "A word about the era of the 212th Ward?", "cypher": "match (:ENTITY{name:'1 area 212's fun rental era'}) --(n) with n order by n.name return n.name limit 1"}, {"query": "How long is the shortest relationship between Wang Jianhui and Sun Tzu in the two levels?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Wang Jianping'}) - [*..2]-(b:ENTITY{name:'Sung Jae-hee'})) return count ((p) The number of paths is not known."}, {"query": "Is there another label for 2-hydroxy tetrahydrocetaethane used in medicine?", "cypher": "match (:ENTITY{name:'2-methacrylate tetrahydrate'}) - [:Tag{name:'label'}]-> (p) with p order by p.name where p.name <> 'medicine' return p.name"}, {"query": "Help me find 10 dishes.", "cypher": "match (:ENTITY{name:'home common dishes'}) <- [:Relationship{name:'category'}]-(m) return distinct m.name limit 10"}, {"query": "Who is the author of Carmen?", "cypher": "Match (:ENTITY{name:'Carmen'}) - [:Relationship{name:'author'}]->(n) return n.name"}, {"query": "Do you know what accident happened on the highway near the village of Nine Ways in Jinzhou, Jining Province?", "cypher": "match (:ENTITY{name:'Highway near the village of Khang Da-dong, Yi County, Jinzhou, Liaoning Province'})"}, {"query": "2009 Literature Does China have labels other than books? Give five examples", "cypher": "match (:ENTITY{name:'2009 Literature China'}) - [:Tag{name:'tags'}]-> (h) with h order by h.name where h.name <> 'books' return h.name limit 5"}, {"query": "What is the name of the substance that makes up 3% of the entire human genome?", "cypher": "match (:ENTITY{name:' accounts for 3% of the entire human genome'}) <- [:Relationship{name:' meaning'}]- (x) return x.name"}, {"query": "What are the occupations of people born on January 30, 1845?", "cypher": "match (m:ENTITY{name:'30 January 1845'}) <- [:Relationship{name:'date of birth'}]- ((x) - [:Relationship{name:'profession'}]->(h) return distinct h.name"}, {"query": "What are the main achievements of the graduates of the Faculty of Education in Xi'an?", "cypher": "match (:ENTITY{name:'Duncy Teachers College'}) <- [:Relationship{name:'Graduate School'}]-(p) - [:Relationship{name:'Major achievement'}]->(q) return distinct q.name limit 1"}, {"query": "Tell me about the action, comedy, crime genre films that Columbia Pictures has produced.", "cypher": "match (p:ENTITY{name:'Columbia Film Corporation'}) <--(x) -->(q:ENTITY{name:'Action Comedy Crime'}) return x.name"}, {"query": "Do you remember where the Harbin flood occurred in 1932?", "cypher": "match ((:ENTITY{name:'1932 Harbin flood'}) - [:Relationship{name:'place of occurrence'}]-> (p) return p.name"}, {"query": "What are the main works of writers who have been awarded the status of Public Interest Ambassadors?", "cypher": "match (:ENTITY{name:'Public interest image ambassador'}) <- [:Relationship{name:'Major achievement'}]- ((p),(p) - [:Relationship{name:'Major work'}]->(n) return distinct n.name"}, {"query": "I'm not sure if you'd recommend 2 peach-themed situations besides the game.", "cypher": "match (:ENTITY{name:' peaches'}) --(m) with m order by m.name where m.name <> 'game' return distinct m.name limit 2"}, {"query": "What are the occupations of people born in Linhai City, Zhejiang Province?", "cypher": "match (:ENTITY{name:'Linghai City, Zhejiang Province'}) <- [:Relationship{name:'place of birth'}]- ((p),(p) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 5"}, {"query": "Help me find a hairy-eyed plant in the genus Murano.", "cypher": "match (:ENTITY{name:'spoon'}) <- [:Relationship{name:'spoon'}]-(m), (m) - [:Relationship{name:'spoon'}]->(n) where n.name='spoon' return distinct m.name"}, {"query": "When asked what is Weijiang's profession? Can you name three?", "cypher": "match (:ENTITY{name:' when waijiang'}) <- [:Relationship{name:' Chinese name'}]-(m),(m) - [:Relationship{name:' profession'}]->(n) return n.name order by n.name limit 3"}, {"query": "I wonder if it's 360 degrees?", "cypher": "match (:ENTITY{name:'360 big rotation'}) --(p) with p order by p.name return p.name"}, {"query": "What is the most famous place for subtropical monsoon climate?", "cypher": "match (:ENTITY{name:'subtropical monsoon climate'}) <- [:Relationship{name:'climate type'}]- ((x),(x) - [:Relationship{name:'famous attractions'}]->(n) return distinct n.name limit 1"}, {"query": "What labels are appropriate for Green's Fairy Tale 1?", "cypher": "match (:ENTITY{name:'(1CD) Green Fairy Tales 1}) - [:Tag{name:'tags'}]-> (p) with p order by p.name return p.name"}, {"query": "What does she do? Where did she graduate? What is her major?", "cypher": "The name of the game is the same as the name of the game itself. The name of the game is the same as the name of the game itself."}, {"query": "Can you find 100 meters of rubbish with no more than 5 labels?", "cypher": "match (x:ENTITY{name:'100 meters away'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "Did you have trouble telling me about the people in the two-tiered relationship between the Polaty and the Khati?", "cypher": "match (n:ENTITY{name:'Bolati-Zhonghati'}) -[:Relationship*1..2]->(x) where x.name <>'Roller compaction quality control' return distinct x.name"}, {"query": "What are the chemical substances with a molecular weight of 199.63? Can you name four?", "cypher": "The name of the function is the name of the function itself."}, {"query": "Do you know which films were released in 2014? Can you list 16?", "cypher": "match (:ENTITY{name:'2014'}) <- [:Relationship{name:' time of delivery'}]- (m) return m.name limit 16"}, {"query": "What kind of car weighs 2,900 kg?", "cypher": "Match (:ENTITY{name:'2900 kg'}) <- [:Relationship{name:'body weight'}]- (h) return h.name"}, {"query": "What is the name of the company in Yangon?", "cypher": "match (p:ENTITY{location:' Long Spring'}) return p.name The name of the game is"}, {"query": "I'm not sure what the Muslims are doing, but I'm not sure what the Muslims are doing.", "cypher": "match (:ENTITY{name:'Islam'}) <- [:Relationship{name:'nationality'}]-(m) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 3"}, {"query": "The government's work department, the office of the city commissioner of Jindal, has five levels of relations.", "cypher": "match (n:ENTITY{name:'The City of Xi'an City Council'}) - [*1..5]->(x) where x.name <> 'Government work department' return distinct x.name"}, {"query": "What are the main causes of accumulation?", "cypher": "match (:ENTITY{name:'accumulation'}) - [:Relationship{name:'main cause'}]->(m) return distinct m.name"}, {"query": "How many companies were created in 2002?", "cypher": "match (p:ENTITY{time:'2002'}) return count ((p)"}, {"query": "Find out who wrote the two books published by Hunan Science and Technology Publishing.", "cypher": "match (:ENTITY{name:'Hunan Science and Technology Publishing'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' author'}]->(n) return m.name,n.name limit 2"}, {"query": "The book was published on 2001/1/1 and what is the price?", "cypher": "match (:ENTITY{name:'2001/1/1'}) <- [:Relationship{name:' time of publication'}]- ((x),(x) - [:Relationship{name:' pricing'}]->(q) return distinct q.name"}, {"query": "The website is also known for its online games, which are the most popular online games in the world.", "cypher": "match (:ENTITY{name:'bringing the most satisfying online games to players'}) <- [:Relationship{name:'site password'}]- (q) return q.name"}, {"query": "Do you know which cucumber varieties are there?", "cypher": "match (:ENTITY{name:' cucumber'}) <- [:Relationship{name:' species category'}]- (x) return x.name limit 8"}, {"query": "And the 2006 report on the work of the government of the city of Triafa, in the Florado district, where I was speaking about public education?", "cypher": "match (:ENTITY{name:'2006 Flowery Township, Getafe Township Government work report'}) --(q) with q order by q.name where q.name <> 'public' return q.name"}, {"query": "What are the reported consequences of the 2004 North Korean Long River train station explosion?", "cypher": "match ((:ENTITY{name:'2004 North Korean Longchann railway station explosion'}) - [:Relationship{name:'results'}]-> (p) return p.name"}, {"query": "Please describe the characteristics of the exhaust pipe bolt.", "cypher": "match (:ENTITY{name:' exhaust pipe bolt'}) <- [:Relationship{name:' Chinese name'}]- ((m),(m) - [:Relationship{name:' characteristics'}]->(x) return distinct x.name"}, {"query": "Can you tell me what the main prizes are for the athlete who plays as a defender on the pitch? Can you tell me three?", "cypher": "match (:ENTITY{name:' defender'}) <- [:Relationship{name:' position on the field'}]-(x) - [:Relationship{name:' main award'}]->(h) return h.name order by h.name limit 3"}, {"query": "Can you name three things about the profession of this man, born in March 1980?", "cypher": "match (:ENTITY{name:'March 1980'}) <- [:Relationship{name:' date of birth'}]-(m),(m) - [:Relationship{name:' profession'}]->(n) return n.name skip 2 limit 3"}, {"query": "What is the name of the movie/city that Ming Mei-Shing, An-Yin stars in?", "cypher": "match (:ENTITY{name:'speech/city'}) <- [:Relationship{name:'type'}]-(m), (m) - [:Relationship{name:'leading role'}]->(n) where n.name='minh may, an in' return distinct m.name"}, {"query": "Can you please translate the name of 2-dihydroxybutyric acid into English?", "cypher": "match ((:ENTITY{name:'2-dihydroxybutyric acid'}) - [:Relationship{name:'English name'}]-> (m) return m.name"}, {"query": "Social events 12.11 Shenzhen Khun New Area fire disaster What is the label?", "cypher": "match (:ENTITY{name:'12.11 Shenzhen Khanyang New Area Fire Incident'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'social event' return p.name"}, {"query": "Can you list 5 plants in the hay section?", "cypher": "match (:ENTITY{name:'hey undergraduate'}) <- [:Relationship{name:'subject'}]- (h) return distinct h.name limit 5"}, {"query": "I'm going to tell you about five major achievements of people born in 1840.", "cypher": "match (:ENTITY{name:'1840'}) <- [:Relationship{name:'date of birth'}]-(h),(h) - [:Relationship{name:'main achievement'}]->(x) return x.name order by x.name limit 5"}, {"query": "The first label for the prostate G2 solution?", "cypher": "match (:ENTITY{name:' Prostate G2 solution'}) --(m) with m order by m.name return m.name limit 1"}, {"query": "What is the current installation directory for %systemdrive%?", "cypher": "match (:ENTITY{name:'%systemdrive%'}) <- [:Relationship{name:'Current system drive'}]- (n) return distinct n.name"}, {"query": "Do you know what the profession of Michael Zimbalist is?", "cypher": "Match (:ENTITY{name:'Michael Zimbalist'}) - [:Relationship{name:'profession'}]-> (n) return distinct n.name"}, {"query": "Please help me find the stock code of Sichuan National Steel Construction Group Limited", "cypher": "match (:ENTITY{name:' Sichuan Guoyuan Construction Group Limited'}) - [:Relationship{name:' stock code'}]-> (m) return distinct m.name"}, {"query": "Where is the headquarters of China One Drag Group Limited?", "cypher": "match (:ENTITY{name:'China One Drag Group Limited'}) - [:Relationship{name:'Hall of business'}]->(n) return n.name as name union all match (:ENTITY{name:'China One Drag Group Limited'}) - [:Relationship{name:'Company nature'}]->(m) return m.name as name"}, {"query": "[Kim Jong-min directed the Korean TV series]", "cypher": "match (:ENTITY{name:'sign [Kim Shin Min directed Korean television series]'}) --(m) return m.name order by m.name"}, {"query": "Can you name me a few magnitude 4.3 earthquakes?", "cypher": "The following is a list of the most common earthquakes in the world."}, {"query": "Remember the detective of the past, you know?", "cypher": "match (n:ENTITY{name:'remembering the detective from the past'}) --(x) return x.name"}, {"query": "World Asthma Day 2013: Tianjin launches first label of the charity fund", "cypher": "match (:ENTITY{name:'2013 World Asthma Day: Tianjin establishes a charity relief fund'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 1"}, {"query": "Can you tell me the name of the relationship between the two layers of the school?", "cypher": "The following pages link to The Earthquake and the Earthquake:"}, {"query": "Do you know what chemical is CAS number 5122-82-7?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "The designer of the plane pilot's bounce seat, who died in 2002, lists 10 other achievements.", "cypher": "match (:ENTITY{name:'2002'}) <- [:Relationship{name:'date of death'}]-(h),(h) - [:Relationship{name:'main achievement'}]->(q) where q.name <> 'Research aircraft pilot bounce seat' return distinct q.name limit 10"}, {"query": "As far as I know, the book on esophageal imaging is written by Li Wenhua and Liu Yinjie, published by People's Health Publishing, and I would like to know six more things about this book, if you can help me find out.", "cypher": "match (n:ENTITY{name:'Epiphany'}) -->(h) with h order by h.name where h.name <> 'Li Wenhua Chenrenjie' and h.name <> 'People's Health Publishing' return h.name limit 6"}, {"query": "What are the four types of relationships that are associated with the Zhejiang campus of Taiyuan University?", "cypher": "The following pages link to The University of the Pacific:"}, {"query": "What do you know about the shooter 007 Legends?", "cypher": "match (:ENTITY{name:'007 legend'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'shooting game' return p.name"}, {"query": "Do you know what game is on the list of games in SwordNet 3?", "cypher": "match (:ENTITY{name:'swordnet3'}) <- [:Relationship{name:'list'}]- (q) return distinct q.name"}, {"query": "I wonder what the big motivational reality shows are?", "cypher": "match (x:ENTITY{name:'large motivational reality show'}) <- [:Relationship{name:' type'}]- (q) return q.name"}, {"query": "Do you know anything else about the flame-inducing tides besides the arthropod door? Help me find 5 information in 2 layers.", "cypher": "match (:ENTITY{name:' flame to the tide'}) - [*1..2]-(p) where p.name <> ' limbs door' return p.name limit 5"}, {"query": "Which schools are the same type of schools as the Taij\u014d Coal School, and what are the labels of each school?", "cypher": "match (n:ENTITY{name:'Tahara Coal School'}) - [:Relationship{name:'School type'}]->(:ENTITY) <- [:Relationship{name:'School type'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) BY ORDER c DESC "}, {"query": "I'm not sure if you can tell me if Elena Gebel is a cook by profession.", "cypher": "match (:ENTITY{name:'Ailena Gerber'}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'profession'}]->(x) return distinct x.name"}, {"query": "What is the shortest relationship path between Jiang Yao and Zhao Qin in the two layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Jiao Yao'}) - [*..2]-(b:ENTITY{name:'Jiao Yao'})) return count ((p) The number of paths is the same as the number of paths used in the previous example."}, {"query": "Do you know where the headquarters of Huang Energy Sichuan Hydroelectric Co. Ltd. is?", "cypher": "match (:ENTITY{name:'Hua Energy Sichuan Hydroelectric Co. Ltd'}) <- [:Relationship{name:'company name'}]-(n) - [:Relationship{name:'headquarters location'}]->(q) return distinct q.name"}, {"query": "I'm not sure if it's possible to say that Devon Haasson has a career, but not an actor and a voiceover?", "cypher": "match (n:ENTITY{name:'Deng Xiaosheng'}) - [:Relationship{name:'profession'}]->(h) where h.name <> 'actor' and h.name <> 'voice' return distinct h.name limit 1"}, {"query": "Which cities are included in the National Social and Economic Development Plan?", "cypher": "match (:ENTITY{name:'National social and economic development plan single city'}) - [:Relationship{name:'list'}]->(m) return distinct m.name"}, {"query": "What is the shortest path between Luca Antonielli and Brad Jones on the second floor?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "11 G101 Graph Application - Calculator of the Pi-Fat Steel Strength How well do you know this book?", "cypher": "match (:ENTITY{name:'11G101 Graphing application-Pygmalion steel braid calculator'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'books' return m.name"}, {"query": "What does tail tattoo mean? What cities are more popular?", "cypher": "match (:ENTITY{name:'Taekyu [Chinese traditional festival]'}) - [:Describe{name:'Tag'}]->(n) return n.name as name union all match (:ENTITY{name:'Taekyu [Chinese traditional festival]'}) - [:Relationship{name:'Popular area'}]->(m) return m.name as name"}, {"query": "What are the other major achievements of Randy Larson, who won the Science Research and Development Award?", "cypher": "match (:ENTITY{name:'Randy Larson'}) - [:Relationship{name:' Major achievements'}]-> (x) with x order by x.name where x.name <> 'President of the American Psychological Association of the Midwest' return x.name"}, {"query": "I wonder if the companies that operate in Nanjing are all famous?", "cypher": "match (p:ENTITY{location:' Nanjing'}) return p.name"}, {"query": "What else do you know about room air conditioners? Find out 4 things about them in the 2nd level.", "cypher": "match (:ENTITY{name:' room air regulator'}) - [*1..2]-(p) where p.name <> 'life' return distinct p.name limit 4"}, {"query": "What is the shortest relationship path between the two films?", "cypher": "Match p=allshortestpaths (((a:ENTITY{name:'Relationship*..2]-(b:ENTITY{name:'Relationship')))) return count ((p) The following is a list of all the episodes of the television series The Simpsons."}, {"query": "What clubs are in the same country as Pasqualina? What are the other clubs with different labels? Please list them in order of number of clubs, from small to large.", "cypher": "match (n:ENTITY{name:'Paskiannina Football Club'}) - [:Relationship{name:'country'}]->(:ENTITY) <- [:Relationship{name:'country'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c)"}, {"query": "What important events happened to Deng Wei, a member of the Chinese delegation to the 2010 Asian Games for the Disabled in Guangzhou?", "cypher": "match (:ENTITY{name:'Paying away, male, member of the Hong Kong delegation to the 2010 Asian Games for Disabled People in Guangzhou\u3002'}) <- [:Describe{name:'describe'}]-(h) - [:Relationship{name:'important event'}]->(n) return distinct n.name"}, {"query": "Please introduce the five tags for the 2023 Hangzhou Asian Games.", "cypher": "match (:ENTITY{name:'2023 Hangzhou Asian Games'}) - [:Tag{name:'tag'}]-> (n) return distinct n.name limit 5"}, {"query": "What is the total length of the American M4 carbine?", "cypher": "match (:ENTITY{name:'American M4 carbine gun'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'full gun length'}]->(n) return distinct n.name"}, {"query": "Search for her graduation and career paths, and what is her current job?", "cypher": "match (:ENTITY{name:'\u6625\u82d7'}) - [:Relationship{name:'Graduate School'}]->(n) return n.name as name union all match (:ENTITY{name:'\u6625\u82d7'}) - [:Relationship{name:'professional direction'}]->(m) return m.name as name union all match (:ENTITY{name:'\u6625\u82d7'}) - [:Relationship{name:'position'}]-(r>) return r.name as name"}, {"query": "Who are the military graduates of Huangpu Military Academy?", "cypher": "match (:ENTITY{name:'Hungary Military College'}) <- [:Relationship{name:'Graduate School'}]-(m) return distinct m.name"}, {"query": "I'm not sure if I can get a copy of the book, but I'm not sure if I can get a copy of the book.", "cypher": "match (:ENTITY{name:'0-2 years old baby early learning card'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "What kind of mixing effects is used in 101 Spotted Dogs?", "cypher": "match ((:ENTITY{name:'101 spotted dog'}) - [:Relationship{name:'mixed sound'}]-> (m) return m.name"}, {"query": "The Republic of Chad belongs to which continent?", "cypher": "match (:ENTITY{name:'Republic of Chad'}) - [:Relationship{name:'country'}]->(m) return distinct m.name"}, {"query": "The first thing I want to do is to get the information on the 024 full-time living facility.", "cypher": "match (:ENTITY{name:'024 full-time living organism'}) --(q) with q order by q.name where q.name <> 'real estate' return q.name"}, {"query": "What are the public secondary schools in Daqing City?", "cypher": "match (:ENTITY{name:'Khongshan City'}) <- [:Relationship{name:'the area'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='public school' return distinct m.name"}, {"query": "Please tell me which of the five relationships involved in the three levels of Nero O'Donnell is good?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "Shanghai Customs Inspection Technology Co., Ltd. has been established for a long time, do you know the exact timing of the issuance?", "cypher": "match ((:ENTITY{name:'Shanghai Collateral Technology Co. Ltd'}) - [:Relationship{name:'Delivery time'}]-> (x) return x.name"}, {"query": "Who has the same date of birth as Metge Nicolas, and who has a tag?", "cypher": "The following is a list of all the different ways Metge Nicolas is credited in the database:"}, {"query": "Do you know the middle school guy? Can you say the first one?", "cypher": "match (:ENTITY{name:'guy high school'}) --(p) return p.name order by p.name limit 1"}, {"query": "Do you know about Hong Valley Mountain? Find out about the other 10 information in the 2nd level, apart from the information about the location outside Linzhou.", "cypher": "match (:ENTITY{name:'\u6d2a\u8c37\u5c71'}) - [:Relationship*1..2]->(p) where p.name <> '15 km southwest of Linzhou city' return p.name limit 10"}, {"query": "What is the maximum power of the 13 wheeled assault vehicles in the army?", "cypher": "match ((:ENTITY{name:'13 wheeled assault vehicle'}) - [:Relationship{name:'maximum power'}]-> (n) return n.name"}, {"query": "What is the shortest relationship between the 50mm and MP5 rifle?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'50-style shotgun'}) - [*..2]-(b:ENTITY{name:'MP5 series shotgun'})) return count ((p)"}, {"query": "What can you say about the relationship between the long-term deal and the third tier of the national debt label?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'long-term deal in government bonds'}) RETURN distinct n.name limit 2"}, {"query": "The information of Coldheart, can you introduce me to three other people besides the footballers?", "cypher": "match (:ENTITY{name:' coldhearted'}) --(m) with m order by m.name where m.name <> 'footballer' return distinct m.name limit 3"}, {"query": "Please tell me the representative work of Yu Yong-Wei, can I have three besides the ordinary world and a servant and two masters?", "cypher": "match (n:ENTITY{name:'Yu Yong-chi'}) - [:Relationship{name:'main works'}]->(h) with h order by h.name where h.name <> 'ordinary world' and h.name <> 'one servant second master' return h.name limit 3"}, {"query": "What else do you know about Ryderberg besides being a geneticist?", "cypher": "match (:ENTITY{name:'Leatherberg'}) - [:Relationship*1..2]-(p) where p.name <> 'geneticist' return p.name limit 10"}, {"query": "I need a simple Chinese version of the plastic composite tube with card-pressure tube. Can I have three more related content?", "cypher": "match (:ENTITY{name:'Plastic composite tubing with card-pressure tube'}) --(m) with m order by m.name where m.name <> 'simplified Chinese' return distinct m.name limit 3"}, {"query": "Do you know the name of the game with the H5 game theme?", "cypher": "match (:ENTITY{name:'H5 game fighter'}) <- [:Relationship{name:'subject'}]- (h) return distinct h.name"}, {"query": "Do you know which famous alumni of schools with the names Mind Chun-Tseol, Stop the Good, Boku-Ryu-Ryu, Self-Reliance?", "cypher": "match (:ENTITY{name:'Minded respectful, stop being so good, scholarly, smart, self-assured'}) <- [:Relationship{name:'curriculum'}]- ((h) - [:Relationship{name:'known alumni'}]->(n) return distinct n.name limit 10"}]