[{"query": "Help me find three dishes made with chicken brains.", "cypher": "match (:ENTITY{name:'crow brain'}) <- [:Relationship{name:'main ingredient'}]-(m) return distinct m.name limit 3"}, {"query": "Do you have all the information about the types of relationships within the six layers that Master Gao Yong is involved in?", "cypher": "match path=(n) <- [:Relationship*6]- ((p:ENTITY{name:'Chang Yong Fa's'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you name 10 professions that Sergeant Jun has?", "cypher": "match (:ENTITY{name:'\u9646\u58eb\u4fca'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'profession'}]->(q) return q.name order by q.name limit 10"}, {"query": "Do you know what happened on November 24, 2016?", "cypher": "match (p:ENTITY{name:'November 24, 2016'}) <- [:Relationship{name:'time of event'}]- (h) return distinct h.name"}, {"query": "How do you say \"extremely busy\" or \"extremely confused\" in English?", "cypher": "match (:ENTITY{name:'describes how very busy or confused it looks'}) --(x) return distinct x.name"}, {"query": "Three things made me understand.", "cypher": "match (:ENTITY{name: '.INFO domain name'}) --(m) with m order by m.name return m.name limit 3"}, {"query": "And what will make you know what the height of the Cup is?", "cypher": "match (n:ENTITY{name:'Relationship{name:'common height'}]-> (h) return h.name"}, {"query": "In addition to the lavender and the melon deer, there is another famous attraction in the Western Aromatic Gardens.", "cypher": "match (n:ENTITY{name:'West Fragrance Garden'}) - [:Relationship{name:'Famous attractions'}]->(h) with h order by h.name where h.name <> 'Cinderella' and h.name <> 'Cinderella' return h.name limit 1"}, {"query": "The book is a study of the four-layer relationship between cancer and cancer treatment.", "cypher": "match (n:ENTITY{name:' Malignant tumour endotherapy research'}) - [*1..4]->(x) where x.name <> 'Malignant tumour endotherapy research' return distinct x.name"}, {"query": "The novel is like the flower of the year, waiting to bloom in which of the following websites?", "cypher": "match ((:ENTITY{name:'like the year of the flower'}) - [:Relationship{name:'connected website'}]-> (n) return n.name"}, {"query": "Please help me find out if the language of the software for the 3Asia rental car is not English.", "cypher": "match (:ENTITY{name:'Tri-Asia rental car'}) - [*1..2]-(p) where p.name <> 'English' return p.name limit 5"}, {"query": "What is the shortest distance between Shenza County and Sochi County?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Shenzhen County'}) - [*..2]-(b:ENTITY{name:'Shenzhen County'})) return count ((p)"}, {"query": "I'm not sure what the Chinese are doing, but I'm not sure what the Chinese are doing.", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnicity'}]-(x) - [:Relationship{name:'representative work'}]->(h) return h.name skip 1 limit 3"}, {"query": "Do you know what kind of representative works this Chinese man has?", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnicity'}]-(p),(p) - [:Relationship{name:'representative work'}]->(h) return h.name skip 3 limit 5"}, {"query": "Can you name three of the most representative works of the Tanguay?", "cypher": "match (q:ENTITY{name:'canal\u7384'}) - [:Relationship{name:'represents work'}]-> (x) return distinct x.name limit 3"}, {"query": "Please tell me about the company in the second level of the relationship with Chengdu Boyun Printing Co., Ltd., headquartered at 31 North Road in Grand Canyon.", "cypher": "match (n:ENTITY{name:'Chengdu Bo Yun Printing Co. Ltd'}) - [:Relationship*1..2]->(x) where x.name <>'Da Nang North Road 31' return distinct x.name"}, {"query": "Tell me where the 10 species of plants in the genus are distributed?", "cypher": "match (:ENTITY{name:''}) <--(m), (m) - [:Relationship{name:' distribution area'}]->(n) return distinct m.name, n.name limit 10"}, {"query": "I wonder what the Jinjiang Development and Reform Commission is responsible for?", "cypher": "match (:ENTITY{name:'Jinzhou City Development and Reform Commission'}) <- [:Relationship{name:'Chinese name'}]-(q),(q) - [:Relationship{name:'responsible'}]->(n) return distinct n.name limit 1"}, {"query": "Can you introduce me to two books priced at $68.00?", "cypher": "The following is a list of the most commonly used keywords in the search results."}, {"query": "What are the ingredients and main ingredients of cheese rice?", "cypher": "Match (:ENTITY{name:' cheesecake'}) - [:Relationship{name:' ingredients'}]->(n) return n.name"}, {"query": "What other awards has Han Shan Teacher Training College received besides the third-class award for the advancement of university science and technology?", "cypher": "match (:ENTITY{name:'Hangsan Teachers' College'}) - [:Relationship{name:'main award'}]->(h) where h.name <> 'Guangdong Province University of Science and Technology Progress Third Class Award one ((as of 2009)) ' return h.name"}, {"query": "Can you describe the career of R. Felshaw? Can you name the top 10?", "cypher": "match (:ENTITY{name:'Fersh, R.'}) - [:Relationship{name:'profession'}]-> (h) return h.name order by h.name limit 10"}, {"query": "Can you list the following publications and information about the two-tier relationship between Dr. Liu and the prosecution?", "cypher": "match (n:ENTITY{name:' and Dr. Liu Jia's relationship'}) - [:Relationship*1..2]->(x) where x.name <> 'publication' return distinct x.name"}, {"query": "What is the name of a documentary that was featured in the Golden Horse Award-winning documentary in Taiwan?", "cypher": "Match (:ENTITY{name:'Taiwanese Film Golden Horse Award'}) <- [:Relationship{name:'award winning record'}]- (h) return h.name"}, {"query": "The Shanghai Central Library has branches in addition to the Caoyang branch.", "cypher": "match (:ENTITY{name:'China Shanghai'}) <- [:Relationship{name:'area'}]-(x) - [:Relationship{name:'main department'}]->(m) where m.name <> 'Cao Xiao Branch' return distinct m.name limit 3"}, {"query": "The following is a list of the topics that are recommended for the price of vocational and technical education materials and plastic materials.", "cypher": "match (n:ENTITY{name:'Vocational technical education materials\u00b7plastic materials'}) - [:Relationship*1..2]->(x) where x.name <>'26' return distinct x.name"}, {"query": "Can you please list me 5 of the four levels of relationships that are relevant to the literary work of St. Clare May?", "cypher": "match (n:ENTITY{name:' and St. Mayberry'}) - [*1..4]->(x) where x.name<> 'literary work' return distinct x.name limit 5"}, {"query": "What is the name of the 100 choice subject exam?", "cypher": "match (:ENTITY{name:'100 articles'}) <- [:Relationship{name:'selection questions'}]- (h) return distinct h.name"}, {"query": "Can you tell me about the five varieties of tea?", "cypher": "match (:ENTITY{name:' tea'}) <- [:Tag{name:' tag'}]-(h) return h.name limit 5 This is a list of all the different ways H.Tag{name:' tea'} is credited in the database."}, {"query": "Where is Jiangsu TV located? Who is the director?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'HQ location'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'Tayuan Chairman'}]->(m) return m.name as name"}, {"query": "Ask yourself, what institution values platforms: open, sharing, collaborative, dedicated, and persistent?", "cypher": "match (:ENTITY{name:' platform  open sharing  puzzle  dedication  persistence '}) <- [:Relationship{name:' values'}]- (n) return distinct n.name"}, {"query": "I'm looking for a voice actor for a virtual Japanese character.", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'nationality'}]-(x),(x) - [:Relationship{name:'sounding'}]->(m) return m.name order by m.name limit 1"}, {"query": "What are the three main ingredients of colorful sandwiches besides the lemon and carrot?", "cypher": "match (n:ENTITY{name:'colored sand waterfall'}) -[:Relationship{name:'main ingredient'}]->(h) where h.name <> 'carrot mud' and h.name <> 'carrot mud' return distinct h.name limit 3"}, {"query": "Can you list the albums released by CUBE Entertainment?", "cypher": "Match (:ENTITY{name:'CUBE Entertainment'}) <- [:Relationship{name:' record company'}]- (n) return distinct n.name"}, {"query": "Can you tell me about one of the main achievements of this Chinese person?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(q) - [:Relationship{name:'main achievements'}]->(n) return n.name order by n.name limit 1"}, {"query": "Can you list which schools have a level 3 label relationship with the Central Academy of Cinema and Television and Media?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Central Academy of Cinema and Television Media'}) return distinct n.name limit 3"}, {"query": "Find out five popular songs and what their record label is.", "cypher": "match (:ENTITY{name:'pop music'}) <- [*]-(m), (m) - [:Relationship{name:'record company'}]->(n) return m.name, n.name limit 5"}, {"query": "Help me find three paintings of the pumpkin.", "cypher": "match (:ENTITY{name:'South Korea'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='painter' return m.name limit 3"}, {"query": "Where is Yongning Park located? How big is it?", "cypher": "match (:ENTITY{name:'Yongning Park'}) - [:Relationship{name:'Geographical location'}]->(n) return n.name as name union all match (:ENTITY{name:'Yongning Park'}) - [:Relationship{name:'occupying area'}]->(m) return m.name as name"}, {"query": "How to prevent soft feet?", "cypher": "match (:ENTITY{name:'softfoot'}) - [:Relationship{name:'prevention'}]->(m) return distinct m.name"}, {"query": "Please describe to me the three major awards that this celebrity with type O blood has won.", "cypher": "match (:ENTITY{name:'O type'}) <- [:Relationship{name:'blood type'}]-(q),(q) - [:Relationship{name:'main prize'}]->(h) return h.name skip 3 limit 3"}, {"query": "I'm not sure if you can tell me the personal information of this person, who is called Mi-Soo-Jin, in the four levels of his relationship?", "cypher": "match (n:ENTITY{name:'Tong Tzu Tzu'}) - [*1..5]->(x) where x.name <> 'Gangsu Province high-tech products identified as implementing rules' return distinct x.name limit 5"}, {"query": "Please collect box information on what 4 aspects of the game besides the web game?", "cypher": "match (:ENTITY{name:' collection box'}) --(m) with m order by m.name where m.name <> ' web game ' return distinct m.name limit 4"}, {"query": "What is the shortest path between the two levels of the World's Fair and the Empire Road?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'the family guy'}) - [*..2]-(b:ENTITY{name:'the road to empire'})) return count ((p)"}, {"query": "Do you know of any earthquakes that have a magnitude of 4.8?", "cypher": "match (:ENTITY{name:'4.8 degree'}) <- [:Relationship{name:'seismic degree'}]- (m) return distinct m.name"}, {"query": "I'm not sure if you know what Penn A does.", "cypher": "match (:ENTITY{name:'Penn A'}) - [:Relationship{name:'profession'}]-> (p) return p.name order by p.name limit 1"}, {"query": "Do you know about the four temples? Can you share with me the specifics?", "cypher": "match (:ENTITY{name:' the four great temples'}) --(h) return h.name skip 2"}, {"query": "Tell us about the top three athletes in the men's singles at the 2016 Rio Olympics.", "cypher": "match (:ENTITY{name:'2016 Rio Olympics Badminton Men's Singles Team'}) --(h) return h.name order by h.name limit 3"}, {"query": "I want all the information about where to look for a date.", "cypher": "match (n:ENTITY{name:'where to look for pictures'}) --(x) return x.name"}, {"query": "Can you provide me with information about the four-tier relationship and Bakaniceva Radikedike Malakai, born in Nausori?", "cypher": "match (n:ENTITY{name:'Bakaniceva Radikedike Malakai'}) - [*1..4]->(x) where x.name<>'Nausori' return distinct x.name"}, {"query": "Which machine has a blade mount angle of 35 degrees?", "cypher": "match (:ENTITY{name:'35\u00b0'}) <- [:Relationship{name:'leaf mounted corner'}]- (m) return m.name"}, {"query": "Please tell me which accidents resulted in one person being injured?", "cypher": "match (:ENTITY{name:'1 person injured'}) <- [:Relationship{name:'injured'}]- (q) return q.name limit 10"}, {"query": "Tell me, apart from Zhang Se Dong and Li Zhi, who are the producers of VillaEscape?", "cypher": "match (n:ENTITY{name:'VillaEscape'}) - [:Relationship{name:'producer'}]->(h) with h order by h.name where h.name <> 'Zhang Windong' and h.name <> 'Lee Min' return h.name limit 2"}, {"query": "What is the address of the company in Dalian?", "cypher": "match (p:ENTITY{location:'\u5927\u8fde'}) return p.name"}, {"query": "What is the shortest path between the corn cob and the corn cob?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortest corn'}) - [:Relationship*..2]-(b:ENTITY{name:'corn's shortest paths'})) return count ((p)"}, {"query": "Can you share something about the marble gate?", "cypher": "match (:ENTITY{name:' Marble Gate'}) --(q) return q.name skip 3 The name of the match is"}, {"query": "Do you know the person who represents the work of Madame de la Pamphale?", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}}) - (m) return m.name order by m.name"}, {"query": "Do you have any information about the main award won by Sundar Desai Primary School in Bursa?", "cypher": "match (:ENTITY{name:'Sunderecheen Primary School, Burhan City'}) - [:Relationship{name:'Major award'}]-> (p) return p.name order by p.name limit 1"}, {"query": "What is the name of an accident that happened in a bus chase?", "cypher": "match (:ENTITY{name:' there was a bus chase accident'}) <- [:Relationship{name:' content'}]- (x) return x.name"}, {"query": "What other profession does this person who fits the political label have?", "cypher": "match (:ENTITY{name:'political figure'}) <- [:Tag{name:'tag'}]-(m) - [:Relationship{name:'profession'}]->(p) return p.name skip 3 limit 1"}, {"query": "Can you name three people who won the 2006 Royal Institute of British Architects Regional Award (London)?", "cypher": "match (m:ENTITY{name:'2006 winner of the Royal Institute of British Architects Regional Award (London) ') --(x) return distinct x.name limit 3"}, {"query": "What is the name of a book in the series called the North Korea Humanities and Social Sciences Library?", "cypher": "match (:ENTITY{name:'Northeast Asia Humanities and Social Sciences Library'}) <- [:Relationship{name:' belongs to the series'}]- (m) return m.name"}, {"query": "I'm not sure if you're familiar with the book, but I'm not sure if you're familiar with the book, but I'm not sure if you're familiar with the book.", "cypher": "match (:ENTITY{name:'Flying Dragon Falls is an online novel whose author has abandoned Flying Dragon. \u25bd'}) <- [:Describe{name:'description'}]-(m),(m) - [:Relationship{name:'type of work'}]->(n) return distinct n.name"}, {"query": "I would like to know about the other four levels of the Goldman Sachs Group Limited in New York.", "cypher": "match (:ENTITY{name:'Goldwyn-Mayer's Limited'}) - [:Relationship*1..2]-(p) where p.name <> 'New York' return p.name limit 4"}, {"query": "Where is the geographical location of Lake Khyber Pakhtunkhwa?", "cypher": "Match (n:ENTITY{name:'Milan Lake'}) - [:Relationship{name:'Geographical location'}]-> (h) return h.name"}, {"query": "What is the definition of a 5s press?", "cypher": "match (:ENTITY{name:'5s compressor'}) --(n) with n order by n.name return n.name limit 1"}, {"query": "I'm not sure if you can tell me the label of 10 5-ton pumps.", "cypher": "match (:ENTITY{name:'5-ton water bottle'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 10"}, {"query": "Can you list the messages from the last one you showed me?", "cypher": "match (:ENTITY{name:'same as '}) --(q) return q.name order by q.name limit 1"}, {"query": "Please list the number of people who graduated from a school together with Yayoi and what are the labels of each person?", "cypher": "match (n:ENTITY{name:'Keynote'}) - [:Relationship{name:'Graduate School'}]->(:ENTITY) <- [:Relationship{name:'Graduate School'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Can you do it with just 5 knowledge?", "cypher": "match (:ENTITY{name:'1 area 212'}) --(x) with x order by x.name return x.name limit 5"}, {"query": "Can you help me find all the 10 fun labels?", "cypher": "match (p:ENTITY{name:'10\u8da3\u7f51'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "The six real estate brokers, where are they located?", "cypher": "match (:ENTITY{name:'real estate broker'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' area to which it belongs'}]->(n) return m.name,n.name limit 6"}, {"query": "Can you tell me five things or information about the Pharaoh's secret?", "cypher": "match (:ENTITY{name:'the Pharaoh's daughter'}) --(q) return distinct q.name limit 5"}, {"query": "Can you recommend a web series that is horror, surprise, suspense, reasoning?", "cypher": "match (h:ENTITY{name:'terror, surprise, suspicion, reasoning'}) <- [:Relationship{name:'type'}]- (p) return p.name"}, {"query": "What books are there that Hu Qingluo has written and what are they classified as?", "cypher": "match (:ENTITY{name:'Hu Qingqing's writing'}) <- [:Relationship{name:'author'}]-(h),(h) - [:Tag{name:'tag'}]->(q) return distinct h.name,q.name"}, {"query": "What are the main categories of DC motors?", "cypher": "match (:ENTITY{name:' direct current motor'}) - [:Relationship{name:' classification'}]-> (m) return distinct m.name"}, {"query": "Can you describe one of the works that have a third-tier label relationship to the attack?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'warlike attack'}) return distinct n.name limit 1"}, {"query": "Help me find two British physicists.", "cypher": "match (:ENTITY{name:'UK'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='physician' return distinct m.name limit 2"}, {"query": "Do you know what Liu Yueping's profession is?", "cypher": "match (q:ENTITY{name:'\u5cb3\u5e73'}) <- [:Relationship{name:' Chinese name'}]-(x),(x) - [:Relationship{name:' profession'}]->(m) return distinct m.name limit 1"}, {"query": "I wonder what language is used in the 1996 American film 12 Monkeys directed by Terry Gilliam?", "cypher": "match ((:ENTITY{name:'12 Monkeys [American 1996 film directed by Trey Gillam]'}) - [:Relationship{name:'For the White Language'}]-> (m) return m.name"}, {"query": "I'm not sure if you can tell me about the 12 drug networks with no more than three labels?", "cypher": "match (:ENTITY{name:'12 pharmacy'}) - [:Tag{name:'label'}]-> (x) with x order by x.name return x.name limit 3"}, {"query": "Is there a romance novel that is being published on Red Sleeve?", "cypher": "match (n:ENTITY{name:'red sleeve'}) <-[:Relationship{name:'linked website'}]-(m) -[:Relationship{name:'Chinese name'}]->(p) return distinct p.name limit 1"}, {"query": "Do you remember the Chinese awards, tell me one?", "cypher": "match (p:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(q),(q) - [:Relationship{name:'main award'}]->(h) return distinct h.name limit 1"}, {"query": "The article was written by a journalist from Guangdong People's Press, who wrote the three-tiered relationship of Mr. Chen's yearbook.", "cypher": "match (n:ENTITY{name:' Mr. Chen Yang's yearbook'}) - [:Relationship*1..3]->(x) where x.name<>'Guangdong People's Press' return distinct x.name"}, {"query": "Please tell me which award was given on January 16, 2011?", "cypher": "match (:ENTITY{name:'January 16, 2011'}) <- [:Relationship{name:' award time'}]- (m) return distinct m.name"}, {"query": "Help me find three plants in the genus Myrtaceae.", "cypher": "match (:ENTITY{name:' by subfamily'}) <- [:Relationship{name:' by family'}]-(m), (m) - [:Relationship{name:' genus'}]->(n) where n.name='family' return distinct m.name limit 3"}, {"query": "Who is the current principal of your secondary school in Senayan Town?", "cypher": "match ((:ENTITY{name:'Secondary School of Senayan Town'}) - [:Relationship{name:'current principal'}]-> (x) return x.name"}, {"query": "What is the name of the family of tea plants?", "cypher": "Match (:ENTITY{name:' tea pot'}) - [:Relationship{name:' classification'}]->(n) return n.name"}, {"query": "Ask about the five personal profiles of this person in Akreson in the five levels of his relationship.", "cypher": "match (n:ENTITY{name:'Acreston'}) - [*1..5]->(x) where x.name<> 'person' return distinct x.name limit 5"}, {"query": "Can you tell me about the 1-2-level relationship between Datunashvili Levan from Georgia and the Russian government?", "cypher": "match (n:ENTITY{name:'Datunashvili Levan'}) - [*1..2]->(x) where x.name<>'Georgia' return distinct x.name"}, {"query": "How do you explain the small number?", "cypher": "match (:ENTITY{name:'\u5c0f\u6c11\u4e4b\u8ba1'}) --(m) with m order by m.name return m.name"}, {"query": "What are the publications of China Construction and what is the price of the books?", "cypher": "match (:ENTITY{name:'China\u5efa\u5de5'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'pricing'}]->(q) return distinct h.name,q.name"}, {"query": "Do you know the four main departments of Hunan University of Finance and Industry and Vocational Technology, besides the Department of Accounting and Department of Electronic Information?", "cypher": "match (n:ENTITY{name:'Hunan College of Finance and Industry'}) -[:Relationship{name:'main faculty'}]->(h) where h.name <> 'accounting faculty' and h.name <> 'electronic information faculty' return distinct h.name limit 4"}, {"query": "Can you name five private companies?", "cypher": "match (:ENTITY{name:' private'}) <- [:Relationship{name:' corporate nature'}]- (n) return n.name limit 5"}, {"query": "What is the category of websites with more than 10 million registered users as of the end of February 2012?", "cypher": "match (:ENTITY{name:' as of the end of February 2012, over ten million registered}) <- [:Relationship{name:' user'}]-(n) - [:Relationship{name:' website type'}]->(x) return distinct x.name"}, {"query": "Can you talk about the 2006 North Korean nuclear test in foreign history?", "cypher": "match (:ENTITY{name:'2006 North Korean nuclear test'}) --(q) with q order by q.name where q.name <> 'foreign history' return q.name"}, {"query": "Can you name five professions of this man?", "cypher": "Match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(p) - [:Relationship{name:'profession'}]->(h) return h.name skip 2 limit 10 The name of the match is not shown in the following table:"}, {"query": "What are the professions of singers in Thailand? Name five?", "cypher": "match (:ENTITY{name:'sing'}) <- [:Relationship{name:'special features'}]-(p) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 5"}, {"query": "Can you list the personal relationships of Lemsalu Marek, an Estonian, in Tier 3?", "cypher": "match (n:ENTITY{name:'Lemsalu Marek'}) - [*1..3]->(x) where x.name <> 'Estonia' return distinct x.name"}, {"query": "Did you know that the five types of relationships are contained within the five layers of the serpentine framework?", "cypher": "The following is a list of all the links in the game."}, {"query": "What is the job of the man from Hunan Province?", "cypher": "match (:ENTITY{name:'Wan Li [Secretary General of the Hunan Province Standing Committee of the City of San'de City]'}) - [:Relationship{name:'profession'}]-> (x) return x.name skip 2"}, {"query": "The organizers of the Asian Volleyball Federation's event, please tell me the name of the event.", "cypher": "match (:ENTITY{name:'Asian Volleyball Federation'}) <- [:Relationship{name:'host unit'}]- (x) return x.name"}, {"query": "The Wolf House depicts a monument to what era?", "cypher": "match (:ENTITY{name:'the wolf's nest'}) - [:Relationship{name:'the event'}]->(n) return n.name as name union all match (:ENTITY{name:'the wolf's nest'}) - [:Relationship{name:'the dynasty'}]->(m) return m.name as name"}, {"query": "I would like to know about the 5 tips for sending a Chinese man to Beijing in the style of the Five Ghosts.", "cypher": "match (n:ENTITY{name:'send you to my home town'}) - [:Relationship*]->(x) where x.name<>'five-year-old' return distinct x.name limit 5"}, {"query": "What is the name of a material with a flame resistance of \u226520?", "cypher": "match (x:ENTITY{name:' a level \u226520'}) <- [:Relationship{name:' fire resistance time'}]- (m) return m.name"}, {"query": "Can you tell me about the main works of people born on this date 1976-09-09? Can you tell me about 5 of them?", "cypher": "match (:ENTITY{name:'1976-09-09'}) <- [:Relationship{name:'date of birth'}]-(p) - [:Relationship{name:'main work'}]->(n) return n.name order by n.name limit 5"}, {"query": "I would like to know where is the headquarters of my craft company, Guangzhou Municipal, when was it founded and what is its scope of operations?", "cypher": "match (:ENTITY{name:'Relationship's name:'Relationship's name:'Relationship's name:'Relationship's name:'Relationship's name:'Relationship's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name's name'"}, {"query": "What are the benefits of strawberries?", "cypher": "match (:ENTITY{name:'snowflake'}) - [:Relationship{name:'effect'}]-> (m) return distinct m.name"}, {"query": "Can you tell me about the rainbow below? What are the top 5?", "cypher": "match (:ENTITY{name:'Horse umbrella'}) --(h) return h.name order by h.name limit 5"}, {"query": "Who found the Swan? Can you tell five of them first?", "cypher": "match (:ENTITY{name:'Swan's sign'}) <--(n) return n.name limit 5"}, {"query": "Have you had trouble reading the software introduction for the new English language Advanced English Tutorials with no less than three layers of relationships?", "cypher": "match (n:ENTITY{name:'Newly written English Advanced Tutorial'}) - [:Relationship*1..3]->(x) where x.name <>'English' return distinct x.name"}, {"query": "Can you find me the main characters in Drunken Fist II?", "cypher": "match (p:ENTITY{name:'Drunken Fist II'}) <- [:Relationship{name:'main work'}]- (q) return q.name order by q.name"}, {"query": "The character in the anime series \"A Dream\" is called \"Mike\", who is the voice of the character?", "cypher": "match (:ENTITY{name:'A dreamcatcher series of works'}) <- [:Relationship{name:'Entertainment works'}]-(h),(h) - [:Relationship{name:'sounding'}]->(p) return distinct h.name,p.name"}, {"query": "Can you help me find the senior national artistic identity and her main achievements?", "cypher": "match (:ENTITY{name:'Senior Identifier of National Art'}) <- [:Relationship{name:'Profession'}]-(h),(h) - [:Relationship{name:'Major achievement'}]->(q) return distinct h.name,q.name"}, {"query": "Find out what kind of six virtual characters they are.", "cypher": "match (:ENTITY{name:'virtual person'}) <--(m), (m) - [:Relationship{name:'type'}]->(n) return m.name, n.name limit 6"}, {"query": "The Chinese company accounting fact-finding survey published this publication.", "cypher": "match (:ENTITY{name:'China business accounting fact-finding'}) <- [:Relationship{name:'book name'}]-(p) - [:Relationship{name:'publishing'}]->(n) return distinct n.name"}, {"query": "Tell me who is the star of the family? Name three moms?", "cypher": "match (:ENTITY{name:'\u571f\u5bb6\u65cf'}) <- [:Relationship{name:'\u6c11\u65cf'}]-(x) - [:Relationship{name:'Chinese name'}]->(h) return distinct h.name limit 3"}, {"query": "Talk to me about 2BIC? (not more than five words)", "cypher": "match (:ENTITY{name:'2BIC'}) --(m) with m order by m.name return distinct m.name skip 1 limit 5"}, {"query": "I want to find four Internet products, how many registered members?", "cypher": "match (:ENTITY{name:' Internet product'}) <--(m), (m) - [:Relationship{name:' registered member'}]->(n) return m.name, n.name limit 4"}, {"query": "Do you know what news 12345 Cinema has?", "cypher": "match (:ENTITY{name:'12345 filmnet'}) --(q) with q order by q.name return q.name limit 10"}, {"query": "What are the applications of the dot-com colored cells?", "cypher": "match (:ENTITY{name:'top-pointed coloured unit'}) - [:Relationship{name:'app'}]->(n) return n.name as name union all match (:ENTITY{name:'top-pointed coloured unit'}) - [:Relationship{name:'use'}]->(m) return m.name as name"}, {"query": "Tell me about the two main distribution areas for the chicken, apart from the one in Yangon and Nanjing?", "cypher": "match (n:ENTITY{name:'spoiled'}) - [:Relationship{name:'distribution area'}]->(h) with h order by h.name where h.name <> 'jungle' and h.name <> 'nanjing' return h.name limit 2"}, {"query": "And what do you know of the other name of the aphrodisiac?", "cypher": "match (:ENTITY{name:'sexual hormone'}) <- [:Relationship{name:'name of drug'}]-(x),(x) - [:Relationship{name:'alias'}]->(m) return distinct m.name limit 1"}, {"query": "There was an incident about the death of a person from Long River poisoning, what is the name of it?", "cypher": "match (:ENTITY{name:'Relationship{name:'event'}}) - (m) return m.name"}, {"query": "Can you tell me what year the American Telephone Company was founded?", "cypher": "match (:ENTITY{name:'American Telephone Company'}) <- [:Relationship{name:'company name'}]- ((p) - [:Relationship{name:'time of founding'}]->(n) return distinct n.name"}, {"query": "The five levels of Al-Shamari Emad Aziz's family history?", "cypher": "match (n:ENTITY{name:'Al-Shamari Emad Aziz'}) - [*1..4]->(x) where x.name <> 'person' return distinct x.name limit 5"}, {"query": "China 4A Area, help me find 30 of them?", "cypher": "match (:ENTITY{name:'AAAA'}) <--(m), (m) --(n) where n.name='China' return distinct m.name limit 30"}, {"query": "Do you know which ones have a secondary label to medicine? Can you name three?", "cypher": "The name of the game is \"Medicine\" (Medicine)"}, {"query": "I'm looking for a book about the relationship between parents and their children, and I'm looking for a book about the relationship between parents and their children.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'See you later' return distinct x.name"}, {"query": "What are the main departments of the Nantong Industrial and Commercial Technician College (Nantong City Industrial and Commercial High Technician School)?", "cypher": "match (:ENTITY{name:'Nantong Industrial and Commercial Technician College (Nantong City Industrial and Commercial High School) '}) <- [:Relationship{name:' Chinese name'}]- ((x),(x) - [:Relationship{name:' Main Faculty'}]->(q) return distinct x.name"}]