[{"query": "How do you read the script?", "cypher": "match (:ENTITY{name:' cast'}) - [:Relationship{name:' spelling'}]->(n) return n.name"}, {"query": "Can you recommend 20 books or novels related to the Qing Dynasty?", "cypher": "match (:ENTITY{name:'Qing Dynasty'}) <- [:Relationship{name:'belonging to dynasty'}]- (n) return n.name limit 20"}, {"query": "I'm not sure what kind of bridge is 730 meters long.", "cypher": "match (:ENTITY{name:'730 m'}) <- [:Relationship{name:'master across'}]- (h) return distinct h.name"}, {"query": "I'm interested in 5 of her messages.", "cypher": "match (:ENTITY{name:' Xu Min'}) --(h) return distinct h.name limit 5"}, {"query": "The name of the company in Suzhou?", "cypher": "match (p:ENTITY{location:'Suzhou'}) return p.name The name of the game is"}, {"query": "Do you have any idea how many local businesses are doing?", "cypher": "match (p:ENTITY{location:'please'}) return count ((p)"}, {"query": "Please tag the road collapse in Taihuahua on 12.26", "cypher": "match (:ENTITY{name:'12.26 Taih\u014d City road collapse incident'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name"}, {"query": "Can you find me two calligraphers?", "cypher": "match (:ENTITY{name:' calligrapher'}) <- [:Relationship{name:' profession'}]- ((x),(x) - [:Relationship{name:' Chinese name'}]->(q) return distinct q.name limit 2"}, {"query": "Tell me five stories about the 11/23 Guangdong Zhujiang New Town fire?", "cypher": "match (:ENTITY{name:'11\u00b723 Guangdong Guangzhou Zhujiang New City Fire'}) --(p) with p order by p.name return p.name limit 5"}, {"query": "Do you know what the other name of The First Kid to Learn English from Mexico is?", "cypher": "match (:ENTITY{name:'The First Kid to Learn English from Mexico'}) <- [:Relationship{name:'other translations of names'}]- (n) return n.name"}, {"query": "Please list the main awards received in the 11th Inning.", "cypher": "match (:ENTITY{name:'Inner City XI'}) - [:Relationship{name:'Main award'}]-> (p) return p.name order by p.name"}, {"query": "Can you find the top 5 most iconic L.U.B. works?", "cypher": "match (:ENTITY{name:'L.U.B'}) - [:Relationship{name:'represents work'}]-> (x) return x.name order by x.name limit 5"}, {"query": "Can you name five of the campaigns that have been running since 1999?", "cypher": "match (:ENTITY{name:'1999'}) <- [:Relationship{name:' start time'}]- (n) return n.name limit 5"}, {"query": "What are the most representative works of people born in December 1966?", "cypher": "match (:ENTITY{name:'December 1966'}) <- [:Relationship{name:'date of birth'}]- ((m) - [:Relationship{name:'representative work'}]->(q) return distinct m.name"}, {"query": "What chemicals are extracted from the thyroid derivatives?", "cypher": "Match (:ENTITY{name:'thrust-containing thyroid derivatives'}) <- [:Relationship{name:'biology'}]- (m) return m.name"}, {"query": "Can you give us a detailed description of the five-layer relationship between the military carrier T-15 heavy infantry fighting vehicle and the T-15 heavy infantry fighting vehicle?", "cypher": "match (n:ENTITY{name:'T-15 heavy infantry fighting vehicle'}) - [*1..5]->(x) where x.name <> 'military' return distinct x.name"}, {"query": "Help me find a fish in the family of the spiny-tailed cuttlefish.", "cypher": "match (:ENTITY{name:'sparrow'}) <- [:Relationship{name:'sparrow'}]-(m), (m) - [:Relationship{name:'family'}]->(n) where n.name='species' return distinct m.name limit 1"}, {"query": "Can you tell me three things about Angela Curran?", "cypher": "match (m:ENTITY{name:'Angela Curran'}) --(x) return distinct x.name limit 3"}, {"query": "Does anyone know what Pan's major achievements are?", "cypher": "match (q:ENTITY{name:'Pan Mi-Gong, graduated from Carnegie Mellon University, Pennsylvania, USA, Vanderbilt University, Tennessee, Chongqing, China, Fujian) Ltd. Executive Vice Chairman, President of Eastern Golf International Group, Special Vice Chairman and Chairman of the Chinese Golf Association, and founder of the Chinese Golf Chain Operations."}, {"query": "I'm not sure if I should be doing this, but I'm not sure I should be doing this.", "cypher": "match (:ENTITY{name:'January cover'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "I accidentally learned about Zhang Lianying's ball-throwing incident at the World Table Tennis Championships in Yokohama, and in order to make the game more enjoyable, you can give me three more details about it.", "cypher": "match (n:ENTITY{name:'Chang Liening's ball incident'}) -->(h) with h order by h.name where h.name <> 'Yokohama World Table Tennis Championships' and h.name <> 'In order to make the match more spectacular' return h.name limit 3"}, {"query": "How many points of interest do the data show for the substitute?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "Can you tell me about the software in the 4-layer relationship related to the DMG file format software LRTimelapse?", "cypher": "match (n:ENTITY{name:'LRTimelapse'}) - [*1..4]->(x) where x.name <>'DMG' return distinct x.name"}, {"query": "Which academic conference is hosted by Sichuan University Hong Kong Tech University?", "cypher": "match (p:ENTITY{name:' Sichuan University of Hong Kong University of Technology'}) <- [:Relationship{name:' Hosted Unit'}]- (h) return distinct h.name"}, {"query": "Help me find a Japanese painter.", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='painter' return distinct m.name limit 1"}, {"query": "What is the XSLT when element?", "cypher": "match (:ENTITY{name:'XSLT when element'}) --(p) with p order by p.name return p.name limit 3"}, {"query": "The author of the poem, who wrote the book, wrote the poem in a way that was very interesting and interesting.", "cypher": "match (n:ENTITY{name:'return to the original directory table'}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "Can you list some of the main works of SNH48?", "cypher": "match (:ENTITY{name:'SNH48'}) <- [:Relationship{name:' group'}]- ((q) - [:Relationship{name:' main work'}]->(m) return distinct q.name"}, {"query": "I need to know the details of five 1.85m tall Aszberg Heinz?", "cypher": "match (n:ENTITY{name:'Asberg Heinz'}) - [*]->(x) where x.name <>'1.85 m' return distinct x.name limit 5"}, {"query": "What about the work of five women?", "cypher": "match (:ENTITY{name:' female'}) <- [:Relationship{name:' gender'}]-(n),(n) - [:Relationship{name:' representing work'}]->(q) return q.name order by q.name limit 5"}, {"query": "What happened on December 15, 2014 in the world?", "cypher": "match (p:ENTITY{name:'December 15, 2014'}) <- [:Relationship{name:'time'}]- (x) return distinct x.name"}, {"query": "I wonder what kind of jobs people weighing 70kg would choose?", "cypher": "match (:ENTITY{name:'70kg'}) <- [:Relationship{name:'weight'}]-(p) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 5"}, {"query": "The following is a list of 5 profiles of Bilro, born in Borba.", "cypher": "match (n:ENTITY{name:'Bilro'}) -[:Relationship*]->(x) where x.name<>'Borba' return distinct x.name limit 5"}, {"query": "Can you explain the top ten brand attributes of the 2006 Pepsi brand list?", "cypher": "match (:ENTITY{name:'2006 Hocus Pocus brands'}) - [:Tag{name:'tags'}]-> (m) with m order by m.name return m.name limit 10"}, {"query": "Help me find three films by director Wouter.", "cypher": "match (:ENTITY{name:'Wo\u4ed5'}) <- [:Relationship{name:'director'}]-(m) return distinct m.name limit 3"}, {"query": "Do you know when Chen Da Kai was founded?", "cypher": "match (p:ENTITY{name:'Chen Da Ka Company'}) return p.time The match is a match between two matches."}, {"query": "The date of birth and nationality of Wang Rin Sung.", "cypher": "match (x:ENTITY{name:'\u738b\u4ec1\u5b97'}),(x) - [:Relationship{name:' date of birth'}]-> (m), (x) - [:Relationship{name:' ethnicity'}]->(n) return m.name, n.name"}, {"query": "Please tell me what games are available in Chinese for the game language?", "cypher": "match (:ENTITY{name:' in Chinese'}) <- [:Relationship{name:' game language'}]-(m) - [:Tag{name:' tag'}]->(n) return distinct n.name limit 1"}, {"query": "Tell me the name of someone born in 1898?", "cypher": "match (:ENTITY{name:'1898'}) <- [:Relationship{name:'date of birth'}]-(p),(p) - [:Relationship{name:'alias'}]->(h) return distinct h.name limit 1"}, {"query": "I want to know about the next rebirth novel, \"Jumen Yang Killing Two\".", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'rebirth' return distinct x.name"}, {"query": "Do you remember the 10/29 Lanzhou railway overturn, when exactly it happened?", "cypher": "match ((:ENTITY{name:'10\u00b729 Lanang Railway rollover accident'}) - [:Relationship{name:'time of occurrence'}]-> (p) return p.name"}, {"query": "Do you have any information about Hauman Petrus, who is not in more than three relationships and has South African nationality?", "cypher": "match (n:ENTITY{name:'Hauman Petrus'}) - [*1..3]->(x) where x.name<>'South Africa' return distinct x.name"}, {"query": "Help me find five plants that are in the seed-plant-gate-twin-leaf-plant schedule.", "cypher": "match (:ENTITY{name:'seed plant gate'}) <- [:Relationship{name:'gate'}]-(m), (m) - [:Relationship{name:'gram'}]->(n) where n.name='twin leaf plant gate' return m.name limit 5"}, {"query": "I need the first three.", "cypher": "match (:ENTITY{name:'Andrew Osborn'}) --(h) return h.name order by h.name limit 3"}, {"query": "Can you tell me five of them?", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnicity'}]- ((h) - [:Relationship{name:'profession'}]->(m) return m.name skip 2 limit 5"}, {"query": "Can you find me two books published in 1989?", "cypher": "match (:ENTITY{name:'1989'}) <- [:Relationship{name:' time of publication'}]- ((x),(x) - [:Relationship{name:' book name'}]->(q) return distinct q.name limit 2"}, {"query": "Do you know which statistics show that road freight in Jinzhou is 173.98 million tons?", "cypher": "match (:ENTITY{name:'17398 million tons'}) <- [:Relationship{name:'road freight'}]- (x) return distinct x.name"}, {"query": "What are the works that these people have been involved in creating?", "cypher": "match (:ENTITY{name:'??'}) <--(n) return n.name The name of the match is"}, {"query": "What novels are published on Jinjiang Literary Network?", "cypher": "match (p:ENTITY{name:'novel'}) <--(x) --> ((q:ENTITY{name:'Jingjiang Literary Network'}) return x.name"}, {"query": "What chemical is the molecular formula HOCH2CHCHCH2OH?", "cypher": "match (:ENTITY{name:'HOCH2CHCHCHCH2OH'}) <- [:Relationship{name:'molecular'}]- (n) return distinct n.name"}, {"query": "Please tell me what chemical CAS NO is: 81-55-0?", "cypher": "The following is a list of the most commonly used and used codes for the C++ programming language."}, {"query": "The first three messages from the administration of calm please tell us.", "cypher": "match (:ENTITY{name:'consolidated'}) --(n) return n.name order by n.name limit 3"}, {"query": "Do you know what metal hardness is the delivery hardness?", "cypher": "match (:ENTITY{name:' delivery hardness'}) <- [:Relationship{name:' hardness'}]- (q) return distinct q.name"}, {"query": "What is the job of a person who believes in the Chinese Communist Party?", "cypher": "match (n:ENTITY{name:'CPC'}) <- [:Relationship{name:'faith'}]-(h),(h) - [:Relationship{name:'profession'}]->(m) return m.name skip 2 limit 5"}, {"query": "What are some of the articles in the book Chinese Discipline - The World of Ink Painting?", "cypher": "match (:ENTITY{name:'China's discipline - the world of ink painting'}) - [:Relationship{name:'the book collection'}]-> (h) return distinct h.name"}, {"query": "Do you remember the name of the novel called \"The One-Paper Plush\"?", "cypher": "match (:ENTITY{name:' a paper full of stuff'}) <- [:Relationship{name:' a book full of stuff'}]- (h) return distinct h.name"}, {"query": "Do you know about the water dragon character Baek Seong? What other information is there besides the 106th General of Liangsan, please find the other 10 information in the 2nd layer", "cypher": "match (:ENTITY{name:'white'}) - [:Relationship*1..2]->(p) where p.name <> '106' return p.name limit 10"}, {"query": "Look at the publication Engine of the Modern World - Industrial Revolution/World History through the Look at all the relevant information?", "cypher": "match (n:ENTITY{name:' The engine of the modern world - Industrial Revolution/World History Overview'}) - [:Relationship*]->(x) where x.name <> 'publication' return distinct x.name"}, {"query": "I want to publish the other 6 pieces of information in the third layer of this 2008 IMS book based on cellular systems.", "cypher": "match (:ENTITY{name:'IMS based on cellular system'}) - [*1..3]-(p) where p.name <> '2008/9/1' return distinct p.name limit 6"}, {"query": "I was focusing on the 10th Shenzhen Mobile World Congress 2010 but forgot the exact launch date, you know?", "cypher": "match ((:ENTITY{name:'2010 Tenth Shenzhen International Mobile Phone Industry Expo's workshop on the subject of the phone}) - [:Relationship{name:'Demonstration time'}]-> (x) return x.name"}, {"query": "What else do you know about the alliance besides the fact that it is designed to meet the needs of investment financing?", "cypher": "match (:ENTITY{name:'investment alliance'}) -[*1..2]-(p) where p.name <> ' satisfies the investment financing needs of the implementation,' return distinct p.name limit 5"}, {"query": "Can you tell me which of these works are representative of this male celebrity? Can you give me 10?", "cypher": "match (q:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(n) - [:Relationship{name:'representing work'}]->(h) return h.name order by h.name limit 10"}, {"query": "Find information on the two-tier relationship between Chinese painting in simplified Chinese/Chinese art in classified Chinese?", "cypher": "match (n:ENTITY{name:'Chinese painting full collection/Chinese art classification full collection'}) - [:Relationship*1..2]->(x) where x.name <>'simplified Chinese' return distinct x.name"}, {"query": "What is the genre of the Stone Age novel and how is it connected now, please tell me?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'type'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'connected state'}]->(m) return m.name as name"}, {"query": "What is the name of the variable set that can be used in the entire scope of a PHP script?", "cypher": "match (:ENTITY{name:' in the full scope of a PHP script'}) <- [:Relationship{name:' adaptation conditions'}]- (m) return m.name"}, {"query": "What does the nickname read? What does it mean?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)."}, {"query": "Besides the name of an ingredient, can you tell me five things you know about the Chendol 2 layer?", "cypher": "match (:ENTITY{name:'Chendol'}) - [*1..2]->(p) where p.name <> ' a name of an ingredient' return distinct p.name limit 5"}, {"query": "In addition to Bruno Bertoldo, the director of this great historical animation, please find 6 messages in the 3 layers of this animated short film.", "cypher": "match (:ENTITY{name:'great historical animation'}) - [*1..3]-(p) where p.name <> 'Bruno Bertsdor' return distinct p.name limit 6"}, {"query": "What do the Turks have in common? What do you know about their religion?", "cypher": "match (:ENTITY{name:'Turkish people'}) <- [:Relationship{name:'ethnicity'}]-(h),(h) - [:Relationship{name:'faith'}]->(q) return distinct h.name,q.name"}, {"query": "What are the matches that are held at the same time as the Andalusian Football Super League? What are the respective labels of these matches? Please sort by the number of labels of each match from small to large.", "cypher": "match (n:ENTITY{name:'Andalusian Football Super League'}) - [:Relationship{name:'time of holding'}]->(:ENTITY) <- [:Relationship{name:'time of holding'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Give me an example of one of Ted Elliott's most iconic works besides Pirates of the Caribbean 2: The Soul Reaper and The Golden Gate Bridge.", "cypher": "match (n:ENTITY{name:'Ted Elliott'}) - [:Relationship{name:'representative work'}]->(h) where h.name <> 'Pirates of the Caribbean 2: Ark of the Covenant' and h.name <> 'The Golden City of the Brave' return distinct h.name limit 1"}, {"query": "I know about Chinese national cultural tourism in Hengmun Town, Ancon, Xinjiang Province, which is part of the North Asian tropical continental monsoon climate, please tell me four more details about it.", "cypher": "match (n:ENTITY{name:'Chinese National Cultural Park'}) -->(h) with h order by h.name where h.name <> 'Henggong Township, Ancon City, Shanxi Province' and h.name <> 'North Asia Tropical Continental Monsoon Climate' return h.name limit 4"}, {"query": "What is the shortest path between Alganon and the crater within the two layers?", "cypher": "The following is a list of all the different ways A:P (Relationship) is credited in the database:"}, {"query": "Please tell me the name of a person born in Jiangsu and his main achievements.", "cypher": "match (:ENTITY{name:'Jiangsu Yanzhou'}) <- [:Relationship{name:'place of birth'}]-(h) - [:Relationship{name:'main achievements'}]->(n) return h.name,n.name skip 3 limit 1"}, {"query": "I want to know what conflict has caused 34 deaths?", "cypher": "match (:ENTITY{name:'34 people killed'}) <- [:Relationship{name:'personally injured'}]- (p) return distinct p.name"}, {"query": "What is the slogan of the 1688 Logistics Network?", "cypher": "match ((:ENTITY{name:'1688 logistics network'}) - [:Relationship{name:'password'}]-> (n) return n.name"}, {"query": "The author, who was born in Ichuan City, Helorong Province, is a representative of the EDA Technology Coordinator, and what other works does he have?", "cypher": "match (:ENTITY{name:'Ichun City, Helanggang Province'}) <- [:Relationship{name:'Birthplace'}]-(h),(h) - [:Relationship{name:'Representing work'}]->(q) where q.name <> 'EDA technology pump' return distinct q.name limit 5"}, {"query": "I want to ask you, which school is Huang Qing a famous alumnus of?", "cypher": "match (:ENTITY{name:'Huang Qing'}) <- [:Relationship{name:'known alumni'}]- (m) return m.name order by m.name"}, {"query": "Can you tell me about the iconic work of Phil Lewis?", "cypher": "match (:ENTITY{name:'Phil Lewis'}) - [:Relationship{name:'represents work'}]-> (x) return x.name order by x.name"}, {"query": "Who can tell me that the pump is a 1000 MW super super-critical fire engine-grade construction project?", "cypher": "match (:ENTITY{name:'1000MW super supercritical fire engine level construction heat control engineering construction'}) --(n) with n order by n.name return n.name"}, {"query": "Did you have trouble listing the five most representative works of art in the city?", "cypher": "match (:ENTITY{name:'Yung Liang'}) <- [:Relationship{name:'Chinese name'}]-(h) - [:Relationship{name:'representing work'}]->(x) return distinct x.name limit 5"}, {"query": "List the personal profiles of no less than three people who have a relationship with the basketball player Morency Jean-Fr\u00e9d\u00e9ric?", "cypher": "match (n:ENTITY{name:'Morency Jean-Fr\u00e9d\u00e9ric'}) - [*1..3]->(x) where x.name<> 'basketball' return distinct x.name"}, {"query": "What are the characteristics of the APS-C specification digital microelectronics?", "cypher": "The following is a list of the most commonly used tags in the APS-C specification:"}, {"query": "Can you tell me the main award that Desperate Housewives MP4 Season 1-4 has won?", "cypher": "Match (:ENTITY{name:' Desperate Housewives' season1-4 MP4}) - [:Relationship{name:'main award'}]-> (m) return distinct m.name"}, {"query": "I heard that 18 Rewards Network has a communications label, so is there another label?", "cypher": "match (:ENTITY{name:'18 rebate net'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'propagation' return h.name"}, {"query": "He has worked as an actor/singer/dance teacher and represented his other five works as a rising star.", "cypher": "match (:ENTITY{name:' actor/singer/dance teacher'}) <- [:Relationship{name:' profession'}]-(n) - [:Relationship{name:' representing work'}]->(q) where q.name <> 'starry dream' return distinct q.name limit 5"}, {"query": "Can you list 11 areas with an area of 1.3 square kilometers?", "cypher": "match (:ENTITY{name:'1.3 square kilometers'}) <- [:Relationship{name:' occupies area'}]- (q) return q.name limit 11"}, {"query": "Besides being inorganic salts, can you tell me 6 things you know about the chloride of titanium in the 2nd layer?", "cypher": "match (:ENTITY{name:'chloride chloride'}) - [:Relationship*1..2]->(p) where p.name <> 'inorganic salt' return p.name limit 6"}, {"query": "Who is the person who has won a special award, three national first prize and several provincial awards?", "cypher": "match (:ENTITY{name:'One special award, three national first class awards, several provincial awards'}) --(x) return distinct x.name"}, {"query": "Please help me find 5 books for $13 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'13.00\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Can anyone list 20 of the revolutionary fighters in China?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Rela"}, {"query": "Please find me two songs with perfume lyrics, which album are they from?", "cypher": "match (:ENTITY{name:'sweet'}) <- [*]-(m), (m) - [:Relationship{name:' belongs to album'}]->(n) return m.name, n.name limit 2"}, {"query": "Please show me a picture of a stamp from Science Publications that describes the relationship between canoes and aircraft carriers.", "cypher": "match (n:ENTITY{name:'stamp art says from canoe to aircraft carrier'}) - [:Relationship*1..2]->(x) where x.name <> 'Scientific dissemination publisher' return distinct x.name"}, {"query": "Can you find me five varieties with microbial labels?", "cypher": "The name of the microbe is the same as the name of the microbe."}, {"query": "The subject is \"Does any animal in Armenia have a snout?\" Can you list 13?", "cypher": "match (:ENTITY{name:'Relationship{name:'Yemen'}}) - (q) return q.name limit 13"}, {"query": "Please tell me about the main department of the School of Architecture and Construction in Zhuzhou District, Taizhou City.", "cypher": "match (:ENTITY{name:'District of Zhengzhou's Construction Training School in Zhengzhou, Zhejiang City'}) - [:Relationship{name:'Major Faculty'}]-> (x) return distinct x.name limit 3"}, {"query": "Can you describe in detail the man who is the father of the Buddha?", "cypher": "match (:ENTITY{name:'Boe Aetius, late Roman philosopher, politician\u3002'}) <-[:Describe{name:'describe'}]-(n) return distinct n.name limit 1"}, {"query": "What kind of relationship is involved in the two levels of Yangzhou Yongsheng?", "cypher": "The following pages link to The Unknown:"}, {"query": "The school has been awarded the national top ten modern schools in Xilong, please tell me which 10 other awards he has received.", "cypher": "match (:ENTITY{name:'Six Way River Secondary School'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'Main award'}]->(h) where h.name <> 'National top ten modern school' return distinct h.name limit 10"}, {"query": "Please help me find 5 places with subtropical monsoon climate, where are they located?", "cypher": "match (:ENTITY{name:'subtropical monsoon climate'}) <- [*]-(m),(m) - [:Relationship{name:'geographical location'}]->(n) return m.name,n.name limit 5"}, {"query": "What awards have been won by the school at the Yuming Missionary Base in Kunming City, Yunnan Province?", "cypher": "match (:ENTITY{name:'Yunming City, Kunming, Yunnan Province, Yueqing's teaching base'}) <- [:Relationship{name:'School address'}]- ((m) - [:Relationship{name:'Major award'}]->(h) return distinct h.name"}, {"query": "Can you tell me what this Chinese person does for a living?", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnic'}]-(q),(q) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 10"}, {"query": "Help me find 10 national key cultural relics protection units", "cypher": "match (:ENTITY{name:'National key cultural relics protection unit'}) --(x) return distinct x.name limit 10"}, {"query": "Help me find the three up-and-down letters.", "cypher": "match (:ENTITY{name:'up and down structure'}) <- [:Relationship{name:'structure'}]-(m), (m) - [:Relationship{name:'spelling'}]->(n) where n.name='b\u00ec' return distinct m.name limit 3"}, {"query": "Besides the location in Beijing's West Gate, can you tell me six things you know about the blood feud in the second floor of the Chen family?", "cypher": "match (:ENTITY{name:'Blood War Chen Family'}) - [:Relationship*1..2]->(p) where p.name <> 'Humzhou City's lower Yangtze River (now Beijing West Gate) ' return p.name limit 6"}, {"query": "Can you recommend a client that is 132MB?", "cypher": "The name of the client is the same as the name of the client."}, {"query": "The shortest name for content with a cultural label is?", "cypher": "The following is a list of the most commonly used tags in the world:"}, {"query": "I want 5 social events 5-1 Link to the incident at the Windsor Amusement Park high-flying accident?", "cypher": "match (n:ENTITY{name:'5\u00b71 Windsor Park high-flying accident'}) - [*]->(x) where x.name <> 'social event' return distinct x.name limit 5"}, {"query": "Do you know how much hard drive capacity NAS network memory has?", "cypher": "match (:ENTITY{name:'NAS network storage'}) <- [:Relationship{name:' product type'}]-(x) - [:Relationship{name:' hard drive capacity'}]->(q) return distinct q.name"}, {"query": "What is the concentration of 4-trimethan-3-methylamide?", "cypher": "match ((:ENTITY{name:'4-triethyl methacrylate-3-methylamide'}) - [:Relationship{name:'focal point'}]-> (n) return n.name"}, {"query": "I would like to know the details of the relationship between the math teacher and the 4th level?", "cypher": "match (n:ENTITY{name:'Yun's'}) - [*1..4]->(x) where x.name<> 'Yun's, math teacher, graduated from Beijing Teachers' University\u3002' return distinct x.name"}, {"query": "I want to know 5 things about a person named Paduretu Lezwan in Chinese, in a two-tier relationship?", "cypher": "match (n:ENTITY{name:'Paduto Lezwan'}) - [*]->(x) where x.name <>'Paduto Lezwan' return distinct x.name limit 5"}, {"query": "Roo lists 5 game rooms to find out the details of the different 6 levels of relationships.", "cypher": "match (n:ENTITY{name:'Look for different in the living room'}) - [*1..6]->(x) where x.name<>'game' return distinct x.name limit 5"}, {"query": "What are the main works and achievements of Li Si Lun?", "cypher": "match (:ENTITY{name:' Lee Si Moon'}) - [:Relationship{name:' major works'}]->(n) return n.name as name union all match (:ENTITY{name:' Lee Si Moon'}) - [:Relationship{name:' major achievements'}]->(m) return m.name as name"}, {"query": "The Buddenbrooks are a group of young musicians who have been working together for over a decade.", "cypher": "match (:ENTITY{name:'The Buddenbrooks'}) <- [:Relationship{name:'represents work'}]- (p) return p.name order by p.name limit 3"}, {"query": "I want to know what the two layers of the relationship are that the Jodo family is involved in?", "cypher": "The following is a list of all the different ways The Wire is credited in the database:"}, {"query": "Do you know what Kim Jong-un's main achievements are?", "cypher": "match (:ENTITY{name:'Kim Yuhun, Party member of Zhejiang District Planning Bureau of Chongqing City, Deputy Director: Department of Law Enforcement Supervision, Law and Order Publicity, Planning Implementation Supervision, Inspection, Administrative and Criminal Proceedings, Liability, Interview Stability, Security Defence work.))"}, {"query": "Tell me about the 5 things Spiteri Kenneth, who plays football in a 1-4 relationship, told me.", "cypher": "match (n:ENTITY{name:'Spiteri Kenneth'}) - [*1..4]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "I'm looking for a book that can help me find all the information about the publication 04:32 Primary Maths.", "cypher": "match (:ENTITY{name:'04 three-point primary math'}) --(x) with x order by x.name where x.name <> 'publication' return x.name"}, {"query": "What other accomplishments did the person who died on August 14, 2000 have besides being the commander of the Eastern Camp Municipal Military District?", "cypher": "match (:ENTITY{name:'August 14, 2000'}) <- [:Relationship{name:'date of death'}]-(x),(x) - [:Relationship{name:'main achievements'}]->(h) where h.name <> 'Commander of the Eastern Camp District' return distinct h.name limit 3"}, {"query": "Please tell me 5 things about Jaulhac Adam.", "cypher": "match (n:ENTITY{name:'Jaulhac Adam'}) - [*]->(x) where x.name<>'person' return distinct x.name limit 5"}, {"query": "What are the attributes of the tags that can be associated with the .NET Framework eCommerce Site Builder Guide?", "cypher": "match (:ENTITY{name: .NET Framework for building e-commerce sites'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "What are the positions of people who are employed at the Northern National University?", "cypher": "match (m:ENTITY{name:'Northern National University'}) <- [:Relationship{name:'regularity'}]-(h),(h) - [:Relationship{name:'position'}]->(q) return distinct q.name"}, {"query": "The Chinese National Standards Management Committee has developed a two-tiered inspection protocol for import and export of instant coffee.", "cypher": "match (n:ENTITY{name:'Inport and export instant coffee inspection protocols'}) - [:Relationship*1..2]->(x) where x.name <> 'China National Standards Management Committee' return distinct x.name"}, {"query": "Can you find me the time of publication of the books by the Chinese Audio Video Publishers?", "cypher": "match (:ENTITY{name:'China recording video'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'publication time'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "Two sentences that sum up the combination of 1 + 3?", "cypher": "match (:ENTITY{name:'1+3 combinations'}) --(p) with p order by p.name return distinct p.name skip 1 limit 2"}]