[{"query": "List the company profiles within the three-tier relationship of Karbo Precision Machinery Limited, a Suzhou industrial park founded in 2007?", "cypher": "match (n:ENTITY{name:'Karabo Precision Machinery Limited, Suzhou Industrial Park'}) - [:Relationship*1..3]->(x) where x.name <>'2007' return distinct x.name"}, {"query": "In addition to being the director of the Microbiology Department, what are the three different jobs that he has?", "cypher": "match (:ENTITY{name:'Penchen, male, 1984 graduated from Henan Agricultural University, obtained Bachelor of Agriculture\u3002'}) <- [:Describe{name:'description'}]-(m),(m) - [:Relationship{name:'profession'}]->(p) where p.name <> 'Director of the Microbiology Department' return distinct p.name limit 3"}, {"query": "Can you recommend my novel with a total of 1737370 words?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "There is a series of topics on the topic of home appliances in rural areas, the topic name is \"What's up?\"", "cypher": "match (:ENTITY{name:' home appliance downtown'}) <- [:Relationship{name:' subject'}]- (p) return p.name"}, {"query": "I wonder what the five rifts are?", "cypher": "match (:ENTITY{name:'five cracks'}) --(h) return h.name skip 3"}, {"query": "The book is published by the publishers of the books by Zhang Zhiyuan.", "cypher": "match (:ENTITY{name:'Zhang'}) <- [:Relationship{name:'author'}]-(x),(x) - [:Relationship{name:'publisher'}]->(q) return distinct q.name"}, {"query": "Do you know what chemical is C14H28?", "cypher": "match (:ENTITY{name:'C14H28'}) <- [:Relationship{name:'molecular'}]- (m) return distinct m.name"}, {"query": "Do you know what is the relationship between the 2nd tier label and the 8th tier label?", "cypher": "match (n) <- [:Tag*2{name:'tag'}]- ((p:ENTITY{name:'\u6b66\u4faf\u516b\u9635'}) return distinct n.name"}, {"query": "The main achievement of the romance novel is mentioned, apart from the first place in the 17k novel network of Throne and the member of the NGU.", "cypher": "match (n:ENTITY{name:'love booklet'}) - [:Relationship{name:'main achievement'}]->(h) where h.name <> 'topped the 17k novel network' and h.name <> 'ngu member' return distinct h.name limit 1"}, {"query": "What are the main awards of the Department of Foreign Languages?", "cypher": "match (:ENTITY{name:'foreign language'}) <- [:Relationship{name:' short form'}]-(p) - [:Relationship{name:' main award'}]->(m) return distinct m.name limit 5"}, {"query": "Can you find me three Korean actors and introduce them?", "cypher": "Match (:ENTITY{name:'Korean actor'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return m.name,n.name limit 3"}, {"query": "Find the movie starring Thomas Jane.", "cypher": "match (:ENTITY{name:'Thomas Jane'}) <- [:Relationship{name:'star'}]- (mn) return mn.name limit 10"}, {"query": "I'm going to start with the title of the post, and the main works.", "cypher": "match (:ENTITY{name:'Shakespeare'}) - [:Relationship{name:'Shakespeare'}]->(n) return n.name as name union all match (:ENTITY{name:'Shakespeare'}) - [:Relationship{name:'Major work'}]->(m) return m.name as name"}, {"query": "Can you tell me about two of the best places to visit in the spring and fall for two or three days?", "cypher": "match (:ENTITY{name:' Four seasons, spring and autumn are good'}) <- [:Relationship{name:' Suitable for playing season'}]-(m), (m) - [:Relationship{name:' Recommended playing time'}->(n) where n.name='2-3 days' return m.name limit 2"}, {"query": "The author provided me with the other 5 pieces of information in the second layer of this book, Telayan's Integrated Electronic Design and Practice.", "cypher": "match (:ENTITY{name:' Integrated electronic design and practice'}) - [*1..2]-(p) where p.name <> 'Telangana' return distinct p.name limit 5"}, {"query": "Tell me what folk festivals are there in China? Help me find five, what festivals are they?", "cypher": "match (:ENTITY{name:'folklore'}) <--(m), (m) - [:Relationship{name:'festival'}]->(n) return m.name, n.name limit 5"}, {"query": "Can you find the Chinese name for the river?", "cypher": "match (:ENTITY{name:'Beyond the Sea'}) - [:Relationship{name:'Chinese name'}]-> (x) with x order by x.name return distinct x.name"}, {"query": "What chemical has the CAS number 27625-35-0?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Please tell me what other representative works are there for the second deputy director of the Public Security Bureau of the city of Suzhou?", "cypher": "match (:ENTITY{name:'Deputy Director of the Second Guard Office of the Jinjiang City Public Security Bureau'}) <-[:Relationship{name:'profession'}]-(n),(n) -[:Relationship{name:'representative work'}->(m) return m.name order by m.name limit 3"}, {"query": "Can you tell me which publisher published it?", "cypher": "match (:ENTITY{name:'\u5f20\u4f2f\u7aef'}) <- [:Relationship{name:' author'}]-(h),(h) - [:Relationship{name:' publisher'}]->(q) return distinct h.name,q.name"}, {"query": "Can you please explain the software within the 5 layers of the Nearby Live relationship?", "cypher": "match (n:ENTITY{name:'Nearby Live'}) - [*1..5]->(x) where x.name <> 'English' return distinct x.name"}, {"query": "Do you know any cultural terms related to Japan?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'Country'}]- (h) return distinct h.name"}, {"query": "Do you know the time of the 2013 Health Expo, can you tell me?", "cypher": "match ((h:ENTITY{name:'2013 Healthcare Exhibition'}) - [:Relationship{name:' time'}]-> (x) return x.name"}, {"query": "Can you tell me who has been a singer? and where he graduated from?", "cypher": "match (:ENTITY{name:' singer'}) <- [:Relationship{name:' profession'}]-(h),(h) - [:Relationship{name:' graduate school'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Please help me find the other 7 information in Teacher Renzong Liang 3 layer.", "cypher": "match (:ENTITY{name:'sweet'}) - [:Relationship*1..3]-(p) where p.name <> 'teacher' return p.name limit 7"}, {"query": "Which metal product has the US code 316?", "cypher": "match (:ENTITY{name:'316'}) <- [:Relationship{name:'corresponds to US trademark'}]- (p) return p.name"}, {"query": "The first is the 1060-ton alloy, which is only labeled with three or fewer.", "cypher": "match (:ENTITY{name:'1060 aluminium alloy'}) - [:Tag{name:'label'}]-> (x) with x order by x.name return x.name limit 3"}, {"query": "Can you name three male voice actors?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(q) - [:Relationship{name:'sounding'}]->(n) return distinct n.name limit 3"}, {"query": "I'm looking for three cellists, which country?", "cypher": "match (:ENTITY{name:'cello player'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'nationality'}]->(n) return m.name,n.name limit 3"}, {"query": "Please help me find three hospitals, where are they all located?", "cypher": "match (:ENTITY{name:' hospital'}) <- [*]-(m), (m) - [:Relationship{name:' geographical location'}]->(n) return m.name, n.name limit 3"}, {"query": "The book is a collection of short stories, including a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a novel, a book, a book, a, a book, a, a book, a, a book, a, a, a book, a, a, a, a book, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a, a,", "cypher": "match (n:ENTITY{name:' suburbia lyric; Taijing Palace orchestra; true and '}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "The interface is designed to be compatible with 20 pin main power supplies.", "cypher": "match (:ENTITY{name:'interface compatible with 20 pin main power supply'}) <- [:Relationship{name:'feature'}]- (m) return m.name"}, {"query": "What is the content of the next project in the relationship between the 10th and 2nd levels of the Nanchang Mountain?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'\u4ef2\u582a' return distinct x.name"}, {"query": "What is the shortest relationship path between the flesh and the dried fruit in the two layers?", "cypher": "The following is a list of all the different ways A:P (Relationship) is credited in the database:"}, {"query": "Can you tell me about the two-layered relationship involved in the long-term relationship?", "cypher": "The following is a list of all the links in the link:"}, {"query": "How about 10 words to describe 15:23?", "cypher": "match (:ENTITY{name:'15:23'}) --(p) with p order by p.name return distinct p.name skip 1 limit 10"}, {"query": "I am a good English reader and I am a travel marketer, what is the shortest path between the three levels?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'I am the English language shortest path'}) - [*..3]-(b:ENTITY{name:'Tourism market segment'})) return count ((p)"}, {"query": "I'm not sure which ranking list is targeted at obese people.", "cypher": "match (h:ENTITY{name:'fat'}) <-[:Relationship{name:'object'}]- (x) return distinct x.name"}, {"query": "What other labels do you have for the number 14 besides cultural labels?", "cypher": "match (:ENTITY{name:'14'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'culture' return q.name"}, {"query": "Please tell me which exhibitions are on display at the Shanghai New International Expo Center?", "cypher": "match (:ENTITY{name:'Shanghai New International Expo Center'}) <- [:Relationship{name:'Exhibition venue'}]- (p) return p.name limit 2 The name of the exhibition is not available in English"}, {"query": "What is the name of a book adapted from the works of Li Xiaoyang?", "cypher": "Match (:ENTITY{name:'Lee Shin-shing'}) <- [:Relationship{name:'adapted'}]- (m) return m.name"}, {"query": "Can you help me find 10 non-fiction books published by a popular literature publisher?", "cypher": "match (:ENTITY{name:'People's Literature Publishers'}) <--(m), (m) >--(n) where n.name <> 'fantasy' return distinct m.name limit 10"}, {"query": "Tell me about the Estonian Saviauk Erko's profile in the 5 levels of relationships?", "cypher": "match (n:ENTITY{name:'Saviauk Erko'}) - [*1..5]->(x) where x.name<>'Estonia' return distinct x.name limit 5"}, {"query": "A friend told me that Asteroid 8216 was discovered on March 27, 1995 by the space surveillance system, do you know any other information?", "cypher": "match (n:ENTITY{name:' asteroid 8216'}) -->(h) with h order by h.name where h.name <> 'space surveillance' and h.name <> '1995/3/27' return h.name limit 6"}, {"query": "Can you tell me about the three levels of relationships involved in the dark night of the soul?", "cypher": "The following pages link to The Unknown:"}, {"query": "Please provide three summaries of the English dictionary for the fourth level of the university for 10 days.", "cypher": "match (:ENTITY{name:'10 days back in college English fourth level vocabulary'}) --(p) with p order by p.name return p.name limit 3"}, {"query": "Tell me about the relationship between the 6 layers of life, in a little bit of knowledge, in a hot and clear mood.", "cypher": "match (n:ENTITY{name:'drinking in a hot tub'}) - [*1..6]->(x) where x.name <>'life' return distinct x.name limit 5"}, {"query": "Give me two World War II battles, where are the sides?", "cypher": "match (:ENTITY{name:'World War II'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:'participant'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "The first is that the weapons are designed to be used in a way that is not harmful to the environment.", "cypher": "match (n:ENTITY{name:'rectangular-shaped explosive'}) - [:Relationship*1..2]->(x) where x.name <> 'weapons equipment' return distinct x.name"}, {"query": "Can you name three Germans who are professors?", "cypher": "match (:ENTITY{name:'professor'}) <- [:Relationship{name:'degree'}]-(m), (m) - [:Relationship{name:'nationality'}]->(n) where n.name='Germany' return m.name limit 3"}, {"query": "I bet you don't know what the 137 Learning Methods are labeled?", "cypher": "match (:ENTITY{name:'137 learning method'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "What are the major departments of the higher education institutions where Su Rui-ho is the dean?", "cypher": "match (:ENTITY{name:'Sou\u6811\u539a'}) <- [:Relationship{name:'Dean'}]- ((n) - [:Relationship{name:'Main Faculty'}]->(q) return distinct q.name"}, {"query": "I would like to know which works are representative of Chinese citizenship?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(h),(h) - [:Relationship{name:'representative work'}]->(q) return distinct q.name limit 5"}, {"query": "What is the maximum width of the blade used in the FA-MAS rifle knife used in the army?", "cypher": "match ((:ENTITY{name:'FA-MAS rifle sharpshooter'}) - [:Relationship{name:'maximum width of the blade'}]-> (x) return x.name"}, {"query": "Tell me about the five details of the Baohyun Temple in Sichuan.", "cypher": "match (n:ENTITY{name:'Bohumans'}) - [*]->(x) where x.name<>'Bohumans' return distinct x.name limit 5"}, {"query": "What other characteristics of 11 degrees youth apart from entertainment work do you have, tell me one?", "cypher": "match (x:ENTITY{name:'11 degree of youthful delight'}) --(n) with n order by n.name where n.name <> 'entertainment work' return n.name limit 1"}, {"query": "What is the shortest relationship between the two levels of the NEC and the Leipzig match?", "cypher": "Match p=allshortestpaths (((a:ENTITY{name:'Crazy will be fighting'}) - [:Relationship*..2]-(b:ENTITY{name:'Leipzig will be fighting'})) return count ((p)"}, {"query": "What are the signature sites built in the Qing Dynasty?", "cypher": "match (:ENTITY{name:'Ching-Tong's period'}) <- [:Relationship{name:'year of construction'}]- ((p) - [:Relationship{name:'famous attractions'}]->(n) return distinct n.name"}, {"query": "Do you know which villages are located at an altitude of 1620 meters?", "cypher": "match (:ENTITY{name:'1620 m'}) <- [:Relationship{name:'elevation'}]- (n) return n.name limit 5 The name of the match is not known."}, {"query": "Can you give me five words about this guy Kurak Ali?", "cypher": "match (n:ENTITY{name:' in Kurak Ali'}) - [*]->(x) where x.name <> 'person' return distinct x.name limit 5"}, {"query": "Can you tell me if one place has a third tier relationship with China's Huangdong?", "cypher": "match (n) - [:Relationship*3{name:' the region'}]->(p:ENTITY{name:' China, China'}) RETURN distinct n.name limit 1"}, {"query": "Have you heard of this work?", "cypher": "match (n:ENTITY{name:'faithful'}) where n is not null return 1"}, {"query": "One of the news clients was an 18-year-old high school student, what's the story?", "cypher": "match (:ENTITY{name:'an 18-year-old female high school student'}) <- [:Relationship{name:'party'}]- (n) return n.name"}, {"query": "Can you recommend five novels that are currently being serialized?", "cypher": "match (:ENTITY{name:'linked'}) <- [:Relationship{name:'category'}]- (n) return n.name limit 5"}, {"query": "Can you list three works that are about the two-tier relationship of romance and hero?", "cypher": "The following pages link to The Unknown:"}, {"query": "Can you find me a professor of automation at Southwestern University of Technology and his graduate school?", "cypher": "match (:ENTITY{name:'Professor of Automation at Southwestern University of Technology'}) <- [:Relationship{name:'profession'}]-(h),(h) - [:Relationship{name:'graduate school'}]->(q) return distinct h.name,q.name"}, {"query": "What traffic accident happened on November 27, 2010?", "cypher": "match (:ENTITY{name:'November 27, 2010'}) <- [:Relationship{name:'time of event'}]- (p) return p.name"}, {"query": "I'm looking for 10 state-owned companies, where are they all?", "cypher": "match (:ENTITY{name:'state owned enterprise'}) <- [*]-(m), (m) - [:Relationship{name:'headquarters location'}]->(n) return distinct m.name,n.name limit 10"}, {"query": "Please tell me about the software in the filesoft4 layer relationship in English language.", "cypher": "match (n:ENTITY{name:'filesoft'}) - [*1..4]->(x) where x.name <> 'English' return distinct x.name"}, {"query": "Chat Chat Chuang is not counting the other ten achievements, including the avocado garden, the spring flower, the rose, the star, the little lady.", "cypher": "match (:ENTITY{name:'Chang Chu'}) <- [:Relationship{name:'Chinese name'}]- ((n) - [:Relationship{name:'main achievement'}]->(p) where p.name <> 'Avoid garden spring lily flower star-shaped little lady' return distinct p.name limit 10"}, {"query": "Do you know what the web time protocol works like?", "cypher": "match (:ENTITY{name:'network time protocol'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'principle'}]->(n) return distinct n.name"}, {"query": "The following political figures are in the top 5 of the four-tiered relationships of Zhou Zhou:", "cypher": "match (n:ENTITY{name:'square'}) - [*1..4]->(x) where x.name<>'political figure' return distinct x.name limit 5"}, {"query": "What do i and s represent in the magnetic moment formula?", "cypher": "The name of the function is the name of the function itself."}, {"query": "Can you name some of the marathons?", "cypher": "match (:ENTITY{name:'Marathon'}) <- [:Relationship{name:'event type'}]- (n) return distinct n.name"}, {"query": "Is there a film by Min Lee in the foreign language called Yang? Is his gender male or female?", "cypher": "match (:ENTITY{name:'windy'}) - [:Relationship{name:'foreign name'}]->(n) return n.name as name union all match (:ENTITY{name:'windy'}) - [:Relationship{name:'on-site work'}]->(m) return m.name as name union all match (:ENTITY{name:'windy'}) - [:Relationship{name:'gender'}]-(r>) return r.name as name"}, {"query": "What happened on May 27th? Can you list seven?", "cypher": "match (:ENTITY{name:'May 27'}) <- [:Relationship{name:'time'}]- (n) return n.name limit 7"}, {"query": "I watched the 2011 MTV Music Television Awards, and how many times have you seen the awards?", "cypher": "Match ((:ENTITY{name:'2011 MTV Music Television Awards award ceremony'}) - [:Relationship{name:'number of times'}]-> (q) return q.name"}, {"query": "What are the types of relationships that are in the three layers of Inzaghi?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you tell me what kind of relationship is involved in the two layers of the rabia?", "cypher": "The following is a list of links to links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in the list of links in this list."}, {"query": "Can you list a representative work written by a Sagittarius author?", "cypher": "match (:ENTITY{name:'Shooting'}) <- [:Relationship{name:'Stopping'}]-(m),(m) - [:Relationship{name:'Representing work'}]->(n) return distinct n.name limit 1"}, {"query": "Friendship is Magic is an English song, translated from Chinese as Friendship is Magic, and tell me 3 of its related information.", "cypher": "match (n:ENTITY{name:'friendship is magic'}) -->(h) with h order by h.name where h.name <> 'friendship is magic' and h.name <> 'English' return h.name limit 3"}, {"query": "The film is based on the life of a young girl named Shia LaBeouf who was killed in a car accident in the early 2000s.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'seven absolute' return distinct x.name"}, {"query": "What other tags do the social networks have besides the social tags, say three?", "cypher": "match (:ENTITY{name:'01 group shopping'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'social' return x.name limit 3"}, {"query": "What is the point of having a delicious meal made with chicken and pork?", "cypher": "match (:ENTITY{name:'Chicken, pork'}) --(x) return distinct x.name"}, {"query": "What are the characteristics of the label in the B-level?", "cypher": "match (:ENTITY{name:'B-level'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "Can you find me three books published by Shanghai University Press?", "cypher": "The name of the game is \"Shanghai University Press\" (Shanghai University Press) and the name of the game is \"Shanghai University Press\" (Shanghai University Press)."}, {"query": "Is there a tag for August 2, 1914? (give three)", "cypher": "match (:ENTITY{name:'August 2, 1914'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "I wonder what kind of novel is Sword and Destiny?", "cypher": "match ((:ENTITY{name:' sword, turn of fate'}) - [:Relationship{name:' type'}]-> (x) return x.name"}, {"query": "I would like to know which books are related to the third level of the label? can you give me four?", "cypher": "The name of the game is \"Skype\" (Skype) and the name of the game is \"Skype\" (Skype)"}, {"query": "What are the words associated with Southampton Football Club?", "cypher": "match (:ENTITY{name:'Southampton Football Club'}) <--(n) return n.name The match was played at the Southampton Stadium in Southampton, England."}, {"query": "The company known as Family Friend was founded in what year?", "cypher": "match (p:ENTITY{name:'Friendly Company'}) return p.time"}, {"query": "What other works does Anunula Sapna sing besides Love on the Road?", "cypher": "match (:ENTITY{name:'Anslav Sappan'}) - [:Relationship{name:'representative work'}]->(m) where m.name <>'love on the way' return distinct m.name"}, {"query": "Is the 1-aceto-4-hydroxybenzoate you often need a prescription for?", "cypher": "match ((:ENTITY{name:'1-ethylbenzyl-4-butadiene'}) - [:Relationship{name:'is it a prescription drug'}]-> (h) return h.name"}, {"query": "The ten tags that make me understand.com?", "cypher": "match (:ENTITY{name:'.com'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 10"}, {"query": "Can you recommend three movies that were released on January 1, 1999?", "cypher": "The game is played in a single game, with the player's name and the game's name being the same."}, {"query": "What is the shortest relationship path between the two layers of wheat seed 918 and 920?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortest paths'}) - [*..2]-(b:ENTITY{name:'shortest paths'})) return count ((p))"}, {"query": "What are the main achievements of CRITTY besides winning the third prize in the 16th annual growth event of the X-Men franchise?", "cypher": "match (:ENTITY{name:'CRITTY'}) - [:Relationship{name:'main achievement'}]-> (m) with m order by m.name where m.name <> 'Relationship's 16th year of growth awarded 'Return m.name'"}, {"query": "I want to know about the three professions of people who are producers, do you have this information?", "cypher": "match (q:ENTITY{name:' producer'}) <- [:Relationship{name:' profession'}]- (h) return distinct h.name limit 3"}, {"query": "I'm going to put a label on this book for the 100 Cent boutique.", "cypher": "match (:ENTITY{name:'100-point essay boutique house'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'books' return p.name"}, {"query": "Can you help me find five Yellow House paintings?", "cypher": "match (:ENTITY{name:'white family'}) <-[:Relationship{name:'fillword'}]-(h) return h.name limit 5"}, {"query": "Do you know who is the third person to be named in the 2013 list of stupid charities?", "cypher": "Match ((:ENTITY{name:'2013 Foolish Charity List'}) - [:Relationship{name:'third name'}]-> (p) return p.name"}, {"query": "In which state are the Gilbert Islands located?", "cypher": "match (:ENTITY{name:'Gilbert Islands'}) - [:Relationship{name:'geographical location'}]->(n) return n.name"}, {"query": "Can you tell us about the types of relationships that are involved in the two layers of the royal family?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'the crown'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you tell me which works have a third-tier label relationship to Chinese literature?", "cypher": "The name of the game is \"The Legend of Zelda: Breath of the Wild\" (Spanish for \"The Legend of Zelda\")"}, {"query": "Can you tell me who Duo Swan is?", "cypher": "match (:ENTITY{name:'Du Swan'}) --(m) return m.name skip 1 The name of the game is the same as the name of the game"}, {"query": "What kind of fish are used for the three fresh de-boned fish?", "cypher": "match (:ENTITY{name:'three fresh de-boned fish'}) - [:Relationship{name:'main ingredient'}]-> (m) return distinct m.name"}, {"query": "I want to find six books on management, who are the authors?", "cypher": "match (:ENTITY{name:'Manage books'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'author'}]->(n) return m.name, n.name limit 6"}, {"query": "How do you find out the name and surname of a Ming Dynasty person?", "cypher": "match (m:ENTITY{name:'min'}) <- [:Relationship{name:'at the time'}]-(n),(n) - [:Relationship{name:'word'}]->(q) return n.name order by n.name,q.name limit 1"}, {"query": "Please find the Hangzhou City Health Unit and list the top 5 articles.", "cypher": "match (:ENTITY{name:'Hangzhou city health unit'}) --(q) return q.name order by q.name limit 5"}, {"query": "Please list the names of the 10 conferences that will be held in a year cycle.", "cypher": "match (:ENTITY{name:' year one'}) <- [:Relationship{name:' cycle'}]- (q) return q.name limit 10"}, {"query": "Can you help me find three Taiwanese singers?", "cypher": "match (:ENTITY{name:'Taiwan'}) <- [:Relationship{name:'place of birth'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='singer' return m.name limit 3"}, {"query": "The following is a list of the three Italian football leagues that exist in the top tier of Italian football, but are not social and sporting.", "cypher": "match (n:ENTITY{name:'Italian Football League'}) - [:Tag{name:'tag'}]->(h) with h order by h.name where h.name <> 'society' and h.name <> 'sport' return h.name limit 3"}, {"query": "Find out what the two alumni of the Siang Cheng Middle School have achieved most.", "cypher": "match (:ENTITY{name:'Shanghai Central High School'}) <- [*]-(m), (m) - [:Relationship{name:'main achievements'}]->(n) return m.name, n.name limit 2"}, {"query": "What is the species of Pan-Clown Turtle and where is it distributed?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'category'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'distribution area'}]->(m) return m.name as name"}, {"query": "The following information is available in the publication Valen Economic Zone Yearbook 2005 No. 17 with no more than three levels of relationships:", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <>'publication' return distinct x.name"}, {"query": "I wonder when 007 and the Little Nurse will be released?", "cypher": "match ((:ENTITY{name:'007 with a little nurse'}) - [:Relationship{name:'date'}]-> (m) return m.name"}, {"query": "Can you tell me where Shandong Airlines is headquartered?", "cypher": "match ((:ENTITY{name:'Santon Airlines'}) - [:Relationship{name:'HQ location'}]-> (n) return n.name"}, {"query": "Please list the following relevant introduction to the four-tier relationship of Monday Osborne?", "cypher": "match (n:ENTITY{name:'Monday Osborne'}) - [*1..4]->(x) where x.name <> 'foreign name' return distinct x.name limit 5"}, {"query": "What is the difference between the adjective and the adverb for full-face wind?", "cypher": "match (:ENTITY{name:'fullface springwind'}) - [:Relationship{name:'near term'}]->(n) return n.name as name union all match (:ENTITY{name:'fullface springwind'}) - [:Relationship{name:'fullface springwind'}]->(m) return m.name as name"}, {"query": "Do you know what chemical has the CAS number 64419-24-5?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "I'm going to show you a little bit of my work, and I'll show you a little bit of my work.", "cypher": "match (n:ENTITY{name:'see the external object of the poem, because it shows this'}) - [:Relationship*1..3]->(x) where x.name<>'Weichen' return distinct x.name"}, {"query": "Can you give me 5 lines of information? I'm looking for a personal profile in a three-tier relationship related to sports personality Chibelli Enrico.", "cypher": "match (n:ENTITY{name:'Chibelli Enrico'}) - [*1..4]->(x) where x.name <> 'sportsman' return distinct x.name limit 5"}, {"query": "The following is a list of characters who are represented by Lucius Fauci:", "cypher": "match (:ENTITY{name:'Relationship{name:'represents work'}]- (x) return x.name order by x.name"}, {"query": "Can you find two other relevant references in the world besides the comics?", "cypher": "match (:ENTITY{name:' in this world there is no one else but you'}) --(m) with m order by m.name where m.name <> 'comic book' return distinct m.name limit 2"}, {"query": "Where is Sanjay Temple located?", "cypher": "match (:ENTITY{name:'San'ye Temple'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'geographical location'}]->(n) return distinct n.name limit 1"}, {"query": "Do you know where the accident happened in the Meru Mountain Industrial Park?", "cypher": "match (:ENTITY{name:' that is, the Mekong Industrial Park'}) <- [:Relationship{name:'the place of the incident'}]- (q) return q.name"}, {"query": "Do you know about the chemical substance acetate of sodium? What other information besides the chemical formula is Ca ((CH3COO) 2) please find the other 7 information within the 2 layers", "cypher": "match (:ENTITY{name:'acetyl acetate'}) - [:Relationship*1..2]->(p) where p.name <> 'Ca(CH3COO) 2 or ((CH3COO) 2Ca' return p.name limit 7"}]