[{"query": "Can you name one of the aliases of Ruxin?", "cypher": "match (:ENTITY{name:'Luxin'}) <--(h) -[:Relationship{name:'also known as '}]->(q) return distinct q.name limit 1"}, {"query": "Do you know what the hardness difference is for the most commonly used 301-SH stainless steel tape?", "cypher": "match ((p:ENTITY{name:'301SH stainless steel band'}) - [:Relationship{name:'hardness coefficient'}]-> (q) return q.name"}, {"query": "How many people can you find in multiplayer online games?", "cypher": "match (:ENTITY{name:'many people'}) <- [:Relationship{name:'number of players'}]- (mn) - [:Tag{name:'tag'}]->(n:ENTITY{name:'network game'}) return mn.name"}, {"query": "Tell me what film is produced in mainland China?", "cypher": "match (:ENTITY{name:'Mainland China'}) <- [:Relationship{name:'Place of manufacture'}]- (x) return distinct x.name limit 5"}, {"query": "What are the names of the three-lined whale?", "cypher": "match (:ENTITY{name:' three-line waveship'}) <- [:Relationship{name:' species'}]- (p) return p.name"}, {"query": "Do you know who is the person who has been doing the most to build a safe culture of demonstration in the city and create a workplace for advanced personal branding?", "cypher": "match (q:ENTITY{name:'conforming to the city hall's safety culture building demonstration creating work advanced personal shade'})"}, {"query": "And when was he born, and when did he die?", "cypher": "The name of the country is the same as the name of the country of origin of the person. The name of the country of origin is the same as the name of the country of origin of the person."}, {"query": "Can you give a list of 10 things that this person who graduated from Zhejiang University has achieved?", "cypher": "match (:ENTITY{name:'Zhejiang University'}) <- [:Relationship{name:'Graduate School'}]-(q),(q) - [:Relationship{name:'Main achievement'}]->(x) return x.name skip 1 limit 10"}, {"query": "Do you know which novel has a song in it, \"Pluto\"?", "cypher": "Match (:ENTITY{name:'night song, twilight dust'}) <- [:Relationship{name:' supporting role'}]- (m) return m.name"}, {"query": "Do you know which printing press was the predecessor of the printing press of the Apple Store Communications Department?", "cypher": "match (:ENTITY{name:'Relationship's printed copy of the store's communications'}) <- [Relationship{name:'s predecessor'}]- (n) return distinct n.name"}, {"query": "The following is a list of 5 foreign language personal information about a person named Nynkeu Nicolas.", "cypher": "match (n:ENTITY{name:'Nynkeu Nicolas'}) - [*1..5]->(x) where x.name <> 'foreign name' return distinct x.name limit 5"}, {"query": "Can you list the games included in the Nintendo N64 platform?", "cypher": "The game is also available in the form of a free-to-play game, called \"Relationship\" (Relationship)."}, {"query": "What other labels are there for the book 100 Ideas that Changed Fashion?", "cypher": "match (:ENTITY{name:'100 Ideas that Changed Fashion'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'books' return q.name"}, {"query": "I'm not sure if you can give me a major American work.", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(q),(q) - [:Relationship{name:'main works'}]->(m) return distinct m.name limit 1"}, {"query": "Do you know which is Zhang's main work?", "cypher": "match (:ENTITY{name:'\u5f20\u827a, born 9 January 1985 in Dongguan, Shandong, Mainland China\u3002'}) <- [:Describe{name:'description'}]-(p) - [:Relationship{name:'main works'}]->(n) return distinct n.name limit 1"}, {"query": "Do you know where he is at the University of Nankai's Fuhai College?", "cypher": "match (:ENTITY{name:'Nanking University Fuhai College'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'area'}]->(n) return distinct n.name"}, {"query": "What are the results of three social events?", "cypher": "match (:ENTITY{name:'social event'}) <--(m), (m) - [:Relationship{name:'result'}]->(n) return m.name, n.name limit 3"}, {"query": "I have four engineers, and they have given me their graduation schools.", "cypher": "match (:ENTITY{name:' engineer'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' graduate school'}]->(n) return m.name,n.name limit 4"}, {"query": "Can you tell me about Jiangxi Chinco New Building Materials Limited, other than the fact that it is registered with the Nanchang City Market and Quality Supervision Administration?", "cypher": "match (:ENTITY{name:'Jiangxi Chinko New Building Materials Limited'}) --(m) with m order by m.name where m.name <> 'Nanchang City Market and Quality Supervision Administration' return distinct m.name limit 2"}, {"query": "What books are priced at $10? Can you help me find two?", "cypher": "match (:ENTITY{name:'10.00\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' book name'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "Can you tell whose main award is the FIFA Medal of Honor?", "cypher": "match (:ENTITY{name:' FIFA Medal of Honor'}) <- [:Relationship{name:' Major award'}]- (h) return distinct h.name limit 10"}, {"query": "Do you know whose song is The Door of Time? Please tell me one.", "cypher": "match (:ENTITY{name:' the door of time'}) --(p) return distinct p.name limit 1"}, {"query": "What chemical is 6\u00b0C?", "cypher": "match (:ENTITY{name:'6\u00b0C'}) <- [:Relationship{name:'focal point'}]- (q) return distinct q.name"}, {"query": "What is the information about plants in the four-layer relationship between the plant subfamily and the genus Rosea?", "cypher": "match (n:ENTITY{name:'Jiao Li'}) - [*1..4]->(x) where x.name<>'Jiaoliaceae' return distinct x.name"}, {"query": "I'm going to give you four actors from the 80s, and tell me about their representative work.", "cypher": "match (:ENTITY{name:'80s actor'}) <--(m), (m) - [:Relationship{name:'represents work'}]->(n) return m.name, n.name limit 4"}, {"query": "The following are the 5 questions for Serika Alexander, who is 1.87m tall.", "cypher": "match (n:ENTITY{name:'Serika Alexander'}) - [*]->(x) where x.name <>'1.87 m' return distinct x.name limit 5"}, {"query": "Please tell me what the name of the exhibition on November 18-19, 2012 is?", "cypher": "Match (:ENTITY{name:'November 18, 2012 - 19th'}) <- [:Relationship{name:'Relationship'}]- (m) return m.name"}, {"query": "Who is the original singer of the song?", "cypher": "match (:ENTITY{name:'Relationship{name:'song originally sung'}]-> (m) return distinct m.name"}, {"query": "What is the name of the accident that happened on July 5, 2016 at 23:16?", "cypher": "match (:ENTITY{name:'5 July 2016 at 23:16'}) <- [:Relationship{name:'time'}]- (x) return distinct x.name"}, {"query": "The three Dennis Trillos representing the country?", "cypher": "match (:ENTITY{name:'Dennis Trillo'}) - [:Relationship{name:'represents work'}]-> (q) with q order by q.name return q.name limit 3"}, {"query": "What kind of book is this 10/0.4kV power distribution practical training manual?", "cypher": "match (:ENTITY{name:'10/0.4kV power distribution practical technical training tutorial'}) --(p) with p order by p.name where p.name <> 'books' return p.name"}, {"query": "I met my mother at the 2011 Guangzhou International Energy Saving and Environmental Technology Exhibition, do you know where the exhibition is?", "cypher": "match ((:ENTITY{name:'2011 Guangzhou International Energy Saving and Environmental Technology Exhibition'}) - [:Relationship{name:'exhibition location'}]-> (n) return n.name"}, {"query": "The first is that the government has been able to provide a free access to the internet for the people of the country.", "cypher": "match (n:ENTITY{name:'free paper'}) - [:Relationship*1..2]->(x) where x.name<>'life supplies' return distinct x.name"}, {"query": "What are the species of the genus Culicoides?", "cypher": "match (:ENTITY{name:'sub-species'}) <- [:Relationship{name:'sub-species'}]- (m) return m.name limit 6 This is a list of the most commonly used and used names in the world."}, {"query": "Can you name a global competition?", "cypher": "match (:ENTITY{name:'global'}) <- [:Relationship{name:'event type'}]- (m) return m.name"}, {"query": "What is the static load of the 1301TN bearing we use?", "cypher": "match ((:ENTITY{name:'1301TN bearing'}) - [:Relationship{name:'stationary load'}]-> (h) return h.name"}, {"query": "I would like to know which places in the world are associated with the second tier of the label? Can you list five?", "cypher": "The name of the game is \"Skype\" (Skype) and the name of the game is \"Skype\" (Skype)."}, {"query": "I would like to know about the two-tier relationship between the two works of Jade's listening?", "cypher": "match (n:ENTITY{name:' listen to you'}) - [:Relationship*1..2]->(x) where x.name <> 'can' return distinct x.name"}, {"query": "What are the subfamilies of the Danish flying squirrel?", "cypher": "match (:ENTITY{name:'\u821e\u79d1'}) <- [:Relationship{name:'\u79d1'}]-(h),(h) - [:Relationship{name:'sub-category'}]->(q) return distinct h.name,q.name"}, {"query": "You know, the six-year-old who's the smartest, the sweetest, the smartest person in the world, who wrote the Encyclopedia?", "cypher": "match (h:ENTITY{name:'0 6 years old smart baby's intellectual development encyclopedia'}) --(x) with x order by x.name where x.name <> ' publications' return x.name"}, {"query": "Can you name three other labels that the Parenting Manual for 0-1 year olds completely removed from the data?", "cypher": "match (:ENTITY{name:'0-1 years old full parenting manual'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'books' return n.name limit 3"}, {"query": "Can you list five songs with Nalan Yanran's voice?", "cypher": "match (:ENTITY{name:'Nalan Yanran'}) <- [:Relationship{name:' foreign language name'}]-(m),(m) - [:Relationship{name:' voiceover'}]->(q) return distinct q.name limit 5"}, {"query": "So what do you call a sequence that has 5 bits per second?", "cypher": "match (:ENTITY{name:'5bp'}) <- [:Relationship{name:'contains'}]- (n) return n.name"}, {"query": "What are the investment institutions in the US?", "cypher": "match (p:ENTITY{name:' US investment agency\u3002'}) <--(x) return x.name"}, {"query": "You know what kind of historical fiction is?", "cypher": "match (:ENTITY{name:'historical evolution'}) <- [:Relationship{name:'novel type'}]- (n) return distinct n.name"}, {"query": "I'm not sure if I'm getting the 1% chance of understanding this Korean drama in 10 words or less.", "cypher": "match (:ENTITY{name:'1% chance [2003 Korean TV series]'}) --(h) with h order by h.name return h.name limit 10"}, {"query": "Can you find the five singers? Where is their band?", "cypher": "match (:ENTITY{name:' singer'}) <--(m), (m) - [:Relationship{name:' band'}]->(n) return m.name, n.name limit 5"}, {"query": "The following is a list of works that are related to the three levels of the post-war relationship between the two countries.", "cypher": "match (n:ENTITY{name:'send a deer to the door'}) - [:Relationship*1..3]->(x) where x.name <>'reason' return distinct x.name"}, {"query": "How many businesses have been opened in Wuhan?", "cypher": "match (p:ENTITY{location:'Wuhan'}) return count ((p)"}, {"query": "Can you recommend a system that supports Android 2.3 or iOS 6.0 or higher?", "cypher": "match (:ENTITY{name:'Android 2.3\u3001ios 6.0 or higher'}) <- [:Relationship{name:'System supported'}]- (m) return m.name"}, {"query": "Do you have any information about Zhou's representative works?", "cypher": "match (:ENTITY{name:'Zhou Yuano'}) - [:Relationship{name:'represents work'}]-> (p) return p.name order by p.name limit 5"}, {"query": "Do you know what types of relationships Joel Richards is involved in in the four layers?", "cypher": "The following is a list of the most commonly used URLs for the URLs listed in this section:"}, {"query": "Did you know that the year is called the Decade of Eternal Happiness?", "cypher": "match (:ENTITY{name:'Yongle decade'}) <- [:Relationship{name:'Mingde era'}]- (m) return m.name"}, {"query": "Can you list the five main works of the people who graduated from the School of Communication Arts of the International Department of Chulalongkorn University?", "cypher": "match (:ENTITY{name:'Champion's College of Communication Arts'}) <- [Relationship{name:'Graduate School'}]- ((n) - [Relationship{name:'Major work'}]->(m) return distinct m.name limit 5"}, {"query": "Tell me about the main award that ballet dancing boys have won, the top 10 lines?", "cypher": "match (:ENTITY{name:'the boy who danced the ballet'}) - [:Relationship{name:'the main prize'}]-> (q) return q.name order by q.name limit 10"}, {"query": "What are the most representative works of the writer born on July 6, 1975? Can you name three?", "cypher": "match (:ENTITY{name:'6 July 1975'}) <- [:Relationship{name:'date of birth'}]-(m),(m) - [:Relationship{name:'represents work'}]->(h) return distinct h.name limit 3"}, {"query": "Could you please provide me with a software that can do this for me?", "cypher": "match (:ENTITY{name:'Weekmail article embellishment'}) <- [:Relationship{name:' tool role'}]- (q) return distinct q.name"}, {"query": "The bombing in which 30 people were killed and 70 injured?", "cypher": "match (:ENTITY{name:'30 dead, 70 wounded'}) <- [:Relationship{name:'number of wounded'}]- (p) return distinct p.name"}, {"query": "What is the north-east of the village of East Shore in the northern part of the village of East Shore in the province of T\u014dky\u014d?", "cypher": "match (:ENTITY{name:'Nord-de-Kontor in the eastern part of the county of Fukuoka'}) <--(n) return n.name"}, {"query": "Where is the region of Baing Guo Zhou, the Mongolian Autonomous Region?", "cypher": "match (:ENTITY{name:'Baing Guoyang Mongolian Autonomous Region'}) - [:Relationship{name:'the region'}]-> (m) return distinct m.name"}, {"query": "Can you tell me what the three German-made weapons are?", "cypher": "match (:ENTITY{name:' Germany'}) <- [:Relationship{name:' country of manufacture'}]- ((n) - [:Relationship{name:' Chinese name'}]->(q) return distinct q.name limit 3"}, {"query": "Do you know which games are in the hobby and which platforms they play on? Can you tell me about five?", "cypher": "match (:ENTITY{name:'recreational'}) <- [:Relationship{name:'game type'}]-(h),(h) - [:Relationship{name:'game platform'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "What do you think of the mobile game 101 Paratroopers?", "cypher": "match (:ENTITY{name:'101 airborne'}) --(n) with n order by n.name where n.name <> 'mobile game' return n.name"}, {"query": "What are the most representative works of Marcia Strassman? Can you tell me the top 10?", "cypher": "match (:ENTITY{name:'Marcia Strassman'}) - [:Relationship{name:'represents work'}]-> (h) return h.name order by h.name limit 10"}, {"query": "What games are the same size as the game The Spider's Escape and what are their individual labels? Order them in order of how many labels they have, from most to least.", "cypher": "match (n:ENTITY{name:'the spider's escape'}) - [:Relationship{name:'game size'}]->(:ENTITY) <-[:Relationship{name:'game size'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) BY ORDER c DESC"}, {"query": "Do you know five things about this Chinese person's career?", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(x),(x) - [:Relationship{name:'profession'}]->(n) return n.name skip 2 limit 5"}, {"query": "The following is a list of the most important Chinese books on the subject of social ecology:", "cypher": "match (n:ENTITY{name:' The local equivalent of the sacrificed chicken: Research on the social and ecological changes in the North of the Yangtze River'}) - [:Relationship*1..2]->(x) where x.name <> 'simplified Chinese' return distinct x.name"}, {"query": "The 16th floor real estate network is a technology product, but does it have any other features?", "cypher": "match (:ENTITY{name:'16th floor real estate network'}) --(p) with p order by p.name where p.name <> 'technology product' return p.name"}, {"query": "What exhibitions are held once a year? Can you list five?", "cypher": "match (x:ENTITY{name:'1 year 1 edition'}) <- [:Relationship{name:'exhibition cycle'}]- (n) return n.name limit 5"}, {"query": "What is the difference between the near and the opposite of the divine axe?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'next term'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'next term'}->(m) return m.name as name"}, {"query": "What are the three principles of political work?", "cypher": "match (:ENTITY{name:'the three principles of political work'}) - [:Tag{name:'tag'}]-> (m) return distinct m.name"}, {"query": "What does Dominic Sherwood do?", "cypher": "match (:ENTITY{name:'Dominic Sherwood')) born 6 February 1990 in Kent, South East England)"}, {"query": "What is the shortest distance between the two levels of the village of Incheon Sheng and the village of Wangjiao?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'\u803b\u51b2\u6751'}) - [*..2]-(b:ENTITY{name:'Wangjia\u51b2\u6751[shortest paths in Shichuan county, Yunnan province]')) return count ((p))"}, {"query": "Can you tell me about the most representative works of Melinda Renna?", "cypher": "match (:ENTITY{name:'Melinda Renna'}) - [:Relationship{name:'represents work'}]-> (p) return p.name order by p.name"}, {"query": "What is the binary number 10001001?", "cypher": "match (:ENTITY{name:'10001001'}) <- [:Relationship{name:' binary'}]- (m) return distinct m.name"}, {"query": "What are the main awards that are given to players who are practicing right footed?", "cypher": "match (:ENTITY{name:'right foot'}) <- [:Relationship{name:'used foot'}]-(h),(h) - [:Relationship{name:'main prize'}]->(m) return distinct m.name limit 1"}, {"query": "Do you want to know more about the work of Yuyuma Yuzun in the 2nd layer relationship?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'' return distinct x.name"}, {"query": "Can you tell me which schools have had notable alumni who have won this major award for being the first church schools founded by the American Church of Christ in China?", "cypher": "match (:ENTITY{name:'The first church schools founded by the American Christian Church in China'}) <- [:Relationship{name:'Major award'}]- ((h) - [:Relationship{name:'Famous alumni'}]->(p) return p.name skip 1 limit 10"}, {"query": "Can you name three professions of this politician?", "cypher": "match (:ENTITY{name:'political figure'}) <- [:Tag{name:'tag'}]-(h) - [:Relationship{name:'profession'}]->(m) return m.name order by m.name limit 3"}, {"query": "What is the Chinese name of the fantasy adventure of Barbie Princess? What is the foreign name? What kind of work is it?", "cypher": "match (:ENTITY{name:'Barbie Princess's Fantasy Adventure'}) - [:Relationship{name:'Barbie Princess's Fantasy Adventure'}]->(n) return n.name as name union all match (:ENTITY{name:'Barbie Princess's Fantasy Adventure'}) - [:Relationship{name:'Barbie Princess's Fantasy Adventure'}->(m) return m.name as name union all match (:ENTITY{name:'Barbie Princess's Fantasy Adventure'}) - [:Relationship{name:'Type'}]->(r) return r.name as name"}, {"query": "Do you know what accident happened on the Taitung pedestrian street in Qingdao?", "cypher": "match (:ENTITY{name:'Taydon Walkway in Qingdao Dressing the World'}) <- [:Relationship{name:'location'}]- (p) return distinct p.name"}, {"query": "Can you name five?", "cypher": "match (p:ENTITY{name:'man'}) <--(x) --> ((q:ENTITY{name:'painter'}) return x.name limit 5"}, {"query": "Which country uses the .hr domain name?", "cypher": "match ((:ENTITY{name: '.hr Domain name'}) - [:Relationship{name:' country'}]-> (q) return q.name"}, {"query": "I'm not sure if I can get a copy of the book, but I'm sure you can find a copy of the book.", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(h),(h) - [:Relationship{name:'profession'}]->(m) return h.name,m.name skip 1 limit 1"}, {"query": "Ro lists five types of subjects in the two-layer relationship of the temple of the battle bird.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'five\u7edd' return distinct x.name"}, {"query": "Find the five Congolese footballers in Makita-Passy Fabry's six-level relationship.", "cypher": "match (n:ENTITY{name:'Makita-Passy Fabry'}) - [*1..6]->(x) where x.name<>'Makita-Passy Fabry, Congolese footballer\u3002' return distinct x.name limit 5"}, {"query": "Can you tell me what the Chinese name of the author of the book A Rainy World is? Can you tell me five?", "cypher": "match (:ENTITY{name:'the world of raindrops'}) <- [:Relationship{name:'author'}]-(x),(x) - [:Relationship{name:'Chinese name'}]->(n) return n.name order by n.name limit 5"}, {"query": "Can you help me check out three related articles about the Class 09 crossover?", "cypher": "match (:ENTITY{name:'09 level crossing'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 3"}, {"query": "What do you know about this book that decides the life of a 6-year-old?", "cypher": "match (:ENTITY{name:'06 years old decides the life of a child'}) --(h) with h order by h.name where h.name <> 'books' return h.name"}, {"query": "Can you name 10 of the games that will be held in Beijing?", "cypher": "match (:ENTITY{name:'Beijing'}) <- [:Relationship{name:'place of the match'}]- (p) return p.name limit 10"}, {"query": "1TYM is the second singer-songwriter group launched by Y.G. When is their debut?", "cypher": "match ((:ENTITY{name:'1tym'}) - [:Relationship{name:'time of exit'}]-> (m) return m.name"}, {"query": "I'm not sure if you know what the third level of labels are related to the term life. Can you name three?", "cypher": "match (n) - [:Tag*3{name:'tag'}]->(p:ENTITY{name:'life term'}) RETURN distinct n.name limit 3"}, {"query": "I asked if I could ask you about the relationship between Chen and Fan Mao.", "cypher": "match (n:ENTITY{name:' and only Van Mao'}) - [:Relationship*1..2]->(x) where x.name<>'Chenyang' return distinct x.name"}, {"query": "The earthquake was at a depth of 11 kilometers and the alarm was coming.", "cypher": "match (p:ENTITY{name:'11 km'}) <- [:Relationship{name:'depth'}]- (n) return n.name"}, {"query": "The police are working hard to solve a case in Shenzhen, which one is it?", "cypher": "match (:ENTITY{name:'The police are working hard on the case'}) <- [:Relationship{name:'Case status'}]- (x) return distinct x.name"}, {"query": "I need 5 messages from Skype for Business with 21MB of software?", "cypher": "match (n:ENTITY{name:'Skype for Business'}) - [*]->(x) where x.name <>'21MB' return distinct x.name limit 5"}, {"query": "I want to get all the information from the Digital Media Department of the Academy of Fine Arts.", "cypher": "match (:ENTITY{name:'Washington University's department of digital media'}) --(m) return m.name order by m.name"}, {"query": "Where is the Yellow River Gorge located?", "cypher": "match (:ENTITY{name:'Relationship{name:' geographical location'}]->(n) return n.name"}, {"query": "Do you know which company has more than 3 million CVs?", "cypher": "Match (:ENTITY{name:'more than 3 million'}) <- [:Relationship{name:'job search resume'}]- (h) return h.name"}, {"query": "In which year was the Vanshan Master's Higher Specialist University founded?", "cypher": "match (:ENTITY{name:'Venusan Teacher's College of Higher and Special Sciences'}) - [:Relationship{name:'time of establishment'}]->(m) return distinct m.name"}, {"query": "The Law on the Acting Officers of the People's Republic of China was passed at which conference and when did it come into effect?", "cypher": "match (:ENTITY{name:'Relationship'}-[:Relationship{name:' by meeting'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}->(m) return m.name as name"}, {"query": "Can you tell me about the five works of Lee Sang-min Shin-lin that show the reluctance to return to the past?", "cypher": "match (n:ENTITY{name:'return to \u674e\u53c3\u653f\u77f3\u6797'}) - [Relationship*]->(x) where x.name <>'\u8f9b\u5f03\u75be' return distinct x.name limit 5"}, {"query": "Can you tell me what Nebi Ros is? Please give me 5 articles.", "cypher": "match (n:ENTITY{name:'Neebee Ross'}) --(x) return distinct x.name limit 5"}, {"query": "Find 12 Monkeys is a movie with no more than five messages?", "cypher": "match (:ENTITY{name:'12 monkeys [American 1996 film directed by Terry Gilliam]'}) --(n) with n order by n.name return n.name limit 5"}, {"query": "I want to know the secrets of the zero-dollar ticket labels?", "cypher": "match (:ENTITY{name:'0-dollar ticket secret'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "You have looked in the Botanical Encyclopedia and found that the varieties of the short-stemmed sparrowflower belong to what group of plants?", "cypher": "match ((:ENTITY{name:'common stem short-distance sparrowflower[variation]'}) - [:Relationship{name:'program'}]-> (x) return x.name"}, {"query": "Can you recommend two fantasy novels?", "cypher": "match (:ENTITY{name:'magic'}) <- [:Relationship{name:'type'}]- (p) return p.name limit 2 The name of the match is not specified"}, {"query": "Can you help me find out where the three species of crustaceans live?", "cypher": "match (:ENTITY{name:'genus'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' distribution area'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Can you tell me if the parent-child program for 0-3 year olds has a rubber label?", "cypher": "match (:ENTITY{name:'0-3 years old parent activity program'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name"}, {"query": "What other information does Sun Shye-rong have besides being a university professor? Please help me find 6 information in 2 layers.", "cypher": "match (:ENTITY{name:'Sun Shuo Rong'}) - [*1..2]-(p) where p.name <> 'University teacher' return p.name limit 6"}, {"query": "What is the attention economy? Who proposed it?", "cypher": "match (:ENTITY{name:'attention economy'}) - [:Describe{name:'tag'}]->(n) return n.name as name union all match (:ENTITY{name:'attention economy'}) - [:Relationship{name:'proponent'}]->(m) return m.name as name"}, {"query": "Do you have a record of the top 10 events in Korea?", "cypher": "match (:ENTITY{name:'Korea'}) <- [:Relationship{name:'place of birth'}]- ((n) - [:Relationship{name:'important event'}]->(x) return distinct x.name limit 10"}, {"query": "Do you know what the exhibition categories of the 2011 Canadian International Plastics Expo are?", "cypher": "match ((:ENTITY{name:'2011 Canadian International Plastics Industry Exhibition'}) - [:Relationship{name:'exhibition category'}]-> (p) return p.name"}, {"query": "How about a description of the following industry figures, and the people in the two-tier relationship that Hu Jiabao has?", "cypher": "match (n:ENTITY{name:'\u8bb8\u5efa'}) - [:Relationship*1..2]->(x) where x.name <> 'industry person' return distinct x.name"}, {"query": "The three lecturers' representations?", "cypher": "match (:ENTITY{name:'lecturer'}) <- [:Relationship{name:'profession'}]-(q),(q) - [:Relationship{name:'representing work'}]->(h) return h.name order by h.name limit 3"}, {"query": "Can you name some of the famous attractions of the Gulf of Aqaba Agricultural Park?", "cypher": "match (:ENTITY{name:'Asian Gulf Agricultural Park'}) - [:Relationship{name:'Famous attractions'}]-> (x) return x.name order by x.name limit 10"}, {"query": "Tell me about the company in the 4th level relationship of the company in the 5th floor of Konron Building, 510 room, opposite the West Road of the Wigan House in the city of Mezansi.", "cypher": "match (n:ENTITY{name:'Kenzaki City New Perception Advertising Decoration Limited Liability Company'}) - [*1..6]->(x) where x.name <>'Kenzaki City Victory West Road across from the Conglomerate Home 5th floor room 510' return distinct x.name"}, {"query": "I'm going to show you 10 of the functions of the KF-3022 apart from the cooling air.", "cypher": "match (m:ENTITY{name:'KF-3022'}) <- [:Relationship{name:'Chinese name'}]-(n) - [:Relationship{name:'Cold wind function'}]->(p) where p.name <> ': support' return distinct p.name limit 10"}, {"query": "The following are five personal questions about Vukovic Nemanja from the Republic of Montenegro:", "cypher": "match (n:ENTITY{name:'Vukovic Nemanja'}) - [:Relationship*]->(x) where x.name <>'Republic of Montenegro' return distinct x.name limit 5"}, {"query": "Please list the personal information of Agayev Kamran, who is a football fan, in the three-tier relationship.", "cypher": "match (n:ENTITY{name:'Agayev Kamran'}) - [*1..3]->(x) where x.name<> 'football' return distinct x.name"}, {"query": "Do you know of anyone who has a third-tier label relationship with engineers?", "cypher": "The following is a list of the most commonly used tags in the search engine."}, {"query": "How do you understand the .pe domain name?", "cypher": "match (:ENTITY{name: '.pe domain name'}) --(p) with p order by p.name where p.name <> 'network dictionary' return p.name"}, {"query": "Can you recommend some love mini-films?", "cypher": "Match (:ENTITY{name:'love microfilm'}) <- [:Relationship{name:'type'}]- (n) return distinct n.name"}, {"query": "The film is about an actor who is searching for a missing skeleton.", "cypher": "match (:ENTITY{name:'spoon'}) --(x) return distinct x.name limit 1"}, {"query": "What kind of medicine is red flower oil and what is its use?", "cypher": "match (:ENTITY{name:' red flower oil'}) - [:Relationship{name:' drug type'}]->(n) return n.name as name union all match (:ENTITY{name:' red flower oil'}) - [:Relationship{name:' use classification'}]->(m) return m.name as name"}, {"query": "Help me find a half-dozen adjectives and adverbs.", "cypher": "match (:ENTITY{name:'a and a half'}) - [:Relationship{name:'a and a half'}]->(n) return n.name as name union all match (:ENTITY{name:'a and a half'}) - [:Relationship{name:'a and a half'}]->(m) return m.name as name"}, {"query": "The novel is called 1/7th Birthday Game, which labels can be noted?", "cypher": "match (:ENTITY{name:'1/7th grade also game'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'novel' return n.name"}, {"query": "Can you tell me what Amanda Wise is representing?", "cypher": "match (:ENTITY{name:'Amanda Weiss'}) <- [:Relationship{name:'Chinese name'}]-(x) - [:Relationship{name:'representing work'}]->(p) return distinct x.name"}, {"query": "Can you find me two doctors from Beijing Hospital and introduce them?", "cypher": "match (:ENTITY{name:'Beijing Hospital'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return m.name,n.name limit 2"}, {"query": "What else is there to know about this funny show? Help me find 6 things in 3 layers.", "cypher": "match (:ENTITY{name:'new smile jungle'}) - [:Relationship*1..3]-(p) where p.name <> 'funny show' return p.name limit 6"}, {"query": "Can you give me 10 things about Huang's career?", "cypher": "match (:ENTITY{name:'\u9ec4\u5c09\u6d2a'}) <--(q) -[:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 10"}, {"query": "The tofu soup is a food made from ingredients such as tofu, tofu and other ingredients.", "cypher": "match (:ENTITY{name:'Cinnamon tofu soup is a food made from ingredients such as cinnamon, tofu and other ingredients.\u3002'}) <- [:Describe{name:'description'}]-(q),(q) - [:Relationship{name:'spices'}]->(m) return distinct m.name"}]