[{"query": "Mad Machine 2: Alien Invasion: What kind of relationships are involved in the three layers?", "cypher": "The following pages link to The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknowns: The Unknown"}, {"query": "Can you please tell me which band's main achievement is the post-punk band The Sound?", "cypher": "match (:ENTITY{name:' post-punk band The Sound'}) <- [:Relationship{name:' major achievements'}]- (p) return p.name order by p.name limit 3"}, {"query": "I would like to know about the Beijing Aviation Tourism Academy.", "cypher": "match (:ENTITY{name:'Beijing Aviation and Tourism Specialist School'}) --(h) return h.name skip 1"}, {"query": "I'm looking for two poems by Byron, what year was it written?", "cypher": "match (:ENTITY{name:'Byron'}) <- [*]-(m), (m) - [:Relationship{name:'date of creation'}]->(n) return m.name, n.name limit 2"}, {"query": "Which hotels and hotels in Tucson are on the 3rd floor of the label relationship can you say?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Tusan Hotel'}) return distinct n.name"}, {"query": "I don't know Casey Robinson, can you introduce me?", "cypher": "match (h:ENTITY{name:'Kassie Robinson'}) --(n) return n.name skip 3 The name of the game is the same as the name of the game"}, {"query": "The technology product 101 anti-fouling oil feature label?", "cypher": "match (:ENTITY{name:'101 anti-fouling oil'}) - [:Tag{name:'label'}]-> (p) with p order by p.name where p.name <> 'technology product' return p.name"}, {"query": "Can you tell me how many companies are located in Shenyang?", "cypher": "match (p:ENTITY{location:' Shenyang'}) return count ((p)"}, {"query": "Can you tell me which website has a user-first service principle?", "cypher": "match (:ENTITY{name:' user to top'}) <- [:Relationship{name:' service principle'}]- (p) return distinct p.name"}, {"query": "Who are the three football stars of Groningen Football Club and from which country?", "cypher": "match (:ENTITY{name:'Football Club Groningen'}) <- [*]-(m), (m) - [:Relationship{name:'nationality'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "I'm looking for a time to find a candy super sweet company.", "cypher": "match (p:ENTITY{name:'Candy Super Sweet Company'}) return p.time The name of the company is not known"}, {"query": "I would like to know what are the representative works of people born on April 4, 1970?", "cypher": "match (:ENTITY{name:'April 4, 1970'}) <- [:Relationship{name:'date of birth'}]- ((q) - [:Relationship{name:'representative work'}]->(h) return distinct h.name"}, {"query": "I'm not sure if you're a native of Beijing, but I'm a native of Beijing, so please help me find 10 of them.", "cypher": "match (:ENTITY{name:'Beijing'}) <- [:Relationship{name:'place of birth'}]-(x),(x) - [:Relationship{name:'representative work'}]->(n) return distinct n.name limit 10"}, {"query": "What are the two main ingredients of the fresh water extract besides flour and violet?", "cypher": "match (n:ENTITY{name:'five-colored three-fresh watercress'}) -[:Relationship{name:'main ingredient'}]->(h) where h.name <> 'flour' and h.name <> 'purple' return distinct h.name limit 2"}, {"query": "Can you name three works that are representative of this Han Chinese person?", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(q) - [:Relationship{name:'representative work'}]->(h) return h.name skip 1 limit 3"}, {"query": "What events are organized by Beijing Avenue Cultural Program Production Co. Ltd.", "cypher": "match (:ENTITY{name:'Beijing Avenue Cultural Program Production Ltd. etc'}) <- [:Relationship{name:'host unit'}]- (q) return q.name"}, {"query": "I can't remember the chemical formula for 2-acetyl-4-methylmercury-5-di-sulfuric acid, can you help me?", "cypher": "match ((:ENTITY{name:'2-ethyl-4-methylmethyl-5-di-sulfuryl sulfate'}) - [:Relationship{name:'chemical formula'}]-> (x) return x.name"}, {"query": "What are the songs in Sango? Can't say five?", "cypher": "match (:ENTITY{name:'slang'}) <-[:Relationship{name:'slang'}]-(h) return h.name limit 5"}, {"query": "Can you recommend a few novels in the genre?", "cypher": "match (n:ENTITY{name:' fictional'}) <- [:Relationship{name:' novel type'}]- ((h) - [:Relationship{name:' Chinese name'}]->(m) return distinct m.name"}, {"query": "Do you know the names of how many car shows? Can you name 20?", "cypher": "match (:ENTITY{name:' car show'}) <- [:Relationship{name:' show type'}]- (x) return x.name limit 20"}, {"query": "Do you know what is the main achievement of Helen?", "cypher": "match (:ENTITY{name:'Haleen'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'main achievement'}]->(n) return distinct n.name"}, {"query": "Can you provide us with five personal details about Finnish footballer Hikira Tapio?", "cypher": "match (n:ENTITY{name:'Hikila Tapio'}) - [*]->(x) where x.name <>'Hikila Tapio, Finnish footballer\u3002' return distinct x.name limit 5"}, {"query": "The following is a list of three works by the Chinese artist, who is known as \"Kang Sam-ji\" in Chinese.", "cypher": "match (:ENTITY{name:'death by suicide'}) --(m) with m order by m.name where m.name <> 'death by suicide' return distinct m.name limit 3"}, {"query": "Can you help me analyze 13 grams?", "cypher": "match (:ENTITY{name:'13\u514b'}) --(h) with h order by h.name return h.name"}, {"query": "The 2012 Shanghai Spring Art Salon, do you know when the time is scheduled?", "cypher": "match ((:ENTITY{name:'2012 Shanghai Spring Art Salon'}) - [:Relationship{name:' time of the event'}]-> (p) return p.name"}, {"query": "What else do you know about Bailing Net besides the commercial website?", "cypher": "match (:ENTITY{name:'Blingnet'}) -[*1..3]-(p) where p.name <> 'commercial website' return distinct p.name limit 5"}, {"query": "What else do you know about comparative research on East Asian fertility culture, other than what is published by China Population Press?", "cypher": "match (:ENTITY{name:' East-West Fertility Comparison Research'}) - [*1..2]-(p) where p.name <> 'China Population Press' return p.name limit 6"}, {"query": "Would you like to see the first three labels of the Dietary Guidelines for Infants 0-3 years old?", "cypher": "match (:ENTITY{name:'0-3 years old baby and toddler food book'}) - [:Tag{name:'label'}]-> (m) with m order by m.name return m.name limit 3"}, {"query": "10 descriptions that identify me as a Type 10411 missile boat?", "cypher": "match (:ENTITY{name:'10411 type missile boat'}) --(x) with x order by x.name return x.name limit 10"}, {"query": "Talk to me about 1H-hydroxy-2-amide in chemistry?", "cypher": "match (:ENTITY{name:'1H-butadiene-2-amide'}) --(q) with q order by q.name where q.name <> 'chemistry' return q.name"}, {"query": "What is the chemical formula for C5H8O2 called hydrogen?", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'alias'}]-(m), (m) - [:Relationship{name:'molecular'}]->(n) where n.name='C5H8O2' return distinct m.name"}, {"query": "I need 6 types of Mr. Small Balls Adventure 2 and other games besides entertainment, can you provide information about them?", "cypher": "match (:ENTITY{name:'Mr. Little Ball Adventure 2'}) --(m) with m order by m.name where m.name <> 'entertainment work' return distinct m.name limit 6"}, {"query": "I'm going to ask you a question, do you know what his symbol is?", "cypher": "match (:ENTITY{name:'\u4e2d'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'represents work'}]->(q) return distinct q.name limit 2"}, {"query": "The first thing I want to say is, what is the meaning of the name of the person or thing?", "cypher": "Match (:ENTITY{name:'Ming'}) <- [:Relationship{name:'age'}]- (h) return h.name limit 5 This is a list of all the different ways H.M.S.H. is credited in the database."}, {"query": "What is the most representative work of Huberlin's father?", "cypher": "match (:ENTITY{name:'\u4faf\u5b9d\u6797'}) <- [:Relationship{name:' father'}]-(q),(q) - [:Relationship{name:' representing work'}]->(h) return distinct h.name limit 3"}, {"query": "Please tell me what kind of relationship information is contained in the three layers of a dark kingdom?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'dark kingdom'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 1 The name of the game is unknown"}, {"query": "I want to go to people, which ticket should the company buy?", "cypher": "match (p:ENTITY{name:'the people company'}) return p.location"}, {"query": "What are the main ingredients of the two bitter dishes?", "cypher": "match (:ENTITY{name:'bitter spices'}) <- [*]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) return m.name, n.name limit 2"}, {"query": "What year was the Audi A4 launched?", "cypher": "match (:ENTITY{name:' Audi A4'}) - [:Relationship{name:' time of listing'}]-> (m) return distinct m.name"}, {"query": "Can you name three representative works of this male celebrity?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(q) - [:Relationship{name:'representing work'}]->(m) return m.name order by m.name limit 3"}, {"query": "The problem is, what do Chinese people do for a living?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(h),(h) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 1"}, {"query": "What are the Chinese names for the arrogant sky?", "cypher": "match (:ENTITY{name:' arrogant heaven'}) - [:Relationship{name:' Chinese name'}]-> (n) with n order by n.name return distinct n.name"}, {"query": "Please tell me which green space is characterized by natural, ecological, park-like green landscapes?", "cypher": "match (:ENTITY{name:'natural, ecological, green landscape in a park'}) <-[:Relationship{name:'feature'}]- (p) return p.name"}, {"query": "The article is about the five graduates of the University of Wei Wei who are in the fourth tier of Kim Bashan's relationship.", "cypher": "match (n:ENTITY{name:'\u91d1\u7384\u5baa'}) - [*1..4]->(x) where x.name <>'Wang Jian University' return distinct x.name limit 5"}, {"query": "Which people were born in the same place as Tatsuya and what labels did they have? List them in order of their respective labels.", "cypher": "match (n:ENTITY{name:'\u6b66\u7530\u5e78\u53f2'}) - [:Relationship{name:'place of birth'}]->(:ENTITY) <- [:Relationship{name:'place of birth'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you tell me where the geographical location of the town is? and how big is it? and how many people live there?", "cypher": "The name of the country is the same as the name of the country of origin of the population of the country."}, {"query": "Can you list the five most representative works of the authors?", "cypher": "match (:ENTITY{name:'writer'}) <- [:Relationship{name:'profession'}]-(m) - [:Relationship{name:'representative work'}]->(n) return distinct n.name limit 5"}, {"query": "What is the name of a contest that is coming up to speed up structural adjustment and transformation upgrades?", "cypher": "match (:ENTITY{name:'Accelerate the advancement of structural adjustments and transformation upgrades'}) <- [:Relationship{name:'purpose'}]- (x) return x.name"}, {"query": "What was the specific situation of enemy casualties in the 1944 Shandong campaign against Japan?", "cypher": "match ((:ENTITY{name:'1944 Shandong Military District against Japan'}) - [:Relationship{name:'Casualty situation'}]-> (x) return x.name"}, {"query": "Can you name the names of the Chinese Academy of Engineering members and their respective achievements?", "cypher": "match (:ENTITY{name:'Academician of the Chinese Academy of Engineering'}) <- [:Relationship{name:'profession'}]- ((q) - [:Relationship{name:'main achievements'}]->(h) return distinct q.name,h.name"}, {"query": "Do you know what kind of relationships are involved in the three layers of Samsung Decorations in Guangzhou?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Guangzhou Samsung Decoration Co. '}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "How is June 20, 1949 in the Chinese calendar?", "cypher": "match ((:ENTITY{name:'20 June 1949'}) - [:Relationship{name:'calendar'}]-> (h) return h.name"}, {"query": "Do you know what is a delicious dish of iron-rich vitamin sesame leaves and pork?", "cypher": "match (:ENTITY{name:'Fine with iron Vitamin-rich sesame leaves with a delicious pork dish...'}) <--(n) return n.name"}, {"query": "Do you know which chemical has the product number P100079?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Can you tell me where the book by author Li Zhi was published?", "cypher": "match (:ENTITY{name:'Lee Min'}) <- [:Relationship{name:'author'}]-(h),(h) - [:Relationship{name:'publisher'}]->(q) return distinct h.name,q.name"}, {"query": "Can you tell me how many wrestlers are 183 cm tall? Can you name 6?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What does it mean to be a rogue?", "cypher": "match (:ENTITY{name:'spoiler'}) - [:Relationship{name:'spoiler'}]-> (m) return distinct m.name"}, {"query": "Who wrote the beer poster?", "cypher": "match (:ENTITY{name:'after the beer'}) <- [:Relationship{name:'representing the work'}]-(m) return distinct m.name"}, {"query": "The chemical 1-hydroxybenzoate is a chemical that is used in the production of polyethylene.", "cypher": "match (:ENTITY{name:'1-nitrate of sodium'}) --(x) with x order by x.name where x.name <> 'chemical' return x.name"}, {"query": "Help me find 10 Chinese dishes.", "cypher": "match (:ENTITY{name:'\u4eac\u83dc'}) <- [:Relationship{name:'category'}]-(m) return distinct m.name limit 10"}, {"query": "Please describe the content of an information piece about Pinghu High School in Yunyang County.", "cypher": "match (x:ENTITY{name:'Ping Lake Secondary School'}) --(h) return distinct h.name limit 1"}, {"query": "What other achievements have people born in Teresos village of Tumba Town, Khandong County, Sichuan, Gansu province, and who have received the National Military Education Advanced Person of Talent achieved?", "cypher": "match (:ENTITY{name:'Toba Kaungso village of Tsupa county, Sichuan, Guangdong Province'}) <- [:Relationship{name:'Born'}]-(x),(x) - [:Relationship{name:'Major achievement'}]->(q) where q.name <> 'Total education at the highest level' return distinct q.name limit 1"}, {"query": "Can you tell me what the relationship is within the three levels of the Nehru Gold Cup?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Nihrukhov Cup'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 2 The name of the game is unknown"}, {"query": "What schools are there in Shanghai, China? Find the names of the top 5 famous alumni", "cypher": "match (:ENTITY{name:'China Shanghai'}) <- [:Relationship{name:'area'}]-(n) - [:Relationship{name:'known alumni'}]->(x) return x.name order by n.name,x.name limit 5"}, {"query": "Can you list the occupations of a junkie for me?", "cypher": "match (:ENTITY{name:'\u541b'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'representative work'}]->(q) return q.name order by q.name limit 1"}, {"query": "What is the name of the work that Alyosha created in 1944-1948?", "cypher": "match (:ENTITY{name:'old\u820d'}) <- [:Relationship{name:'author'}]-(m), (m) - [:Relationship{name:'creation year'}]->(n) where n.name='1944-1948' return m.name"}, {"query": "Can you tell me the name of the 16 international tournaments?", "cypher": "match (:ENTITY{name:'International event'}) <- [:Relationship{name:'event type'}]- (h) return h.name limit 16 The name of the game is not available"}, {"query": "Please help me find three students who graduated from the Beijing Broadcasting Academy.", "cypher": "match (:ENTITY{name:'Beijing Radio Academy'}) <- [:Relationship{name:' Graduate School'}]-(m) return distinct m.name limit 3"}, {"query": "Which crime thriller was released on August 26, 2005?", "cypher": "match (p:ENTITY{name:'August 26, 2005'}) <--(x) -->(q:ENTITY{name:'crime'}) return x.name"}, {"query": "What do you think of 007 - The Seventh Spy?", "cypher": "match (:ENTITY{name:'007 The Sea of Monsters: The Seventh Intelligence'}) --(x) with x order by x.name return x.name"}, {"query": "What is the curriculum at Hebei Sin University?", "cypher": "match (:ENTITY{name:'Hebei Sin Zhen'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'School training'}]->(n) return distinct n.name"}, {"query": "Please list the actors who have small roles.", "cypher": "match (:ENTITY{name:' minor character actor'}) --(m) return m.name order by m.name"}, {"query": "Please tell me what kind of job this Chinese guy does?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(n) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 3"}, {"query": "The story of the rose of the rose that everyone is talking about is published on which platform?", "cypher": "match ((:ENTITY{name:'Relationship{name:'connecting platform'}]-> (n) return n.name"}, {"query": "Can you find me the main achievements of the co-founder and CTO of Desert Vision Technologies?", "cypher": "match (:ENTITY{name:'Wildview Technology Co-founder and CTO'}) <- [:Relationship{name:'Career'}]- ((p),(p) - [:Relationship{name:'Main achievements'}]->(x) return distinct x.name"}, {"query": "When was the Bauhaus formed and when did it disband?", "cypher": "match (:ENTITY{name:'Bauhaus band'}) - [:Relationship{name:'time of formation'}]->(n) return n.name as name union all match (:ENTITY{name:'Bauhaus band'}) - [:Relationship{name:'time of dissolution'}]->(m) return m.name as name"}, {"query": "The software's description says that 360 technicians are on the computer, so what's the software called?", "cypher": "match (:ENTITY{name:'360 computer technician in a computer suit'}) <- [:Relationship{name:'software brief'}]- (p) return p.name"}, {"query": "I wonder which government work report quotes Deng Xiaoping's theory?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Tell me about the two-tier relationship between Hwaseong Biography [Beijing] and Cultural Development Limited.", "cypher": "match (n:ENTITY{name:'Washington [Beijing] Cultural Development Limited'}) - [*1..2]->(x) where x.name<>'Washington [Beijing] Cultural Development Limited' return distinct x.name"}, {"query": "The person who represents the work is DEMO in blue shorts, what other occupations do you have?", "cypher": "match (:ENTITY{name:'DEMO blue shorts'}) <- [:Relationship{name:'represents work'}]-(h),(h) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 3"}, {"query": "What is the shortest path between the two layers of the dome and the dome?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortestpaths'}) - [*..2]-(b:ENTITY{name:'shortestpaths'})) return count ((p)"}, {"query": "Can you tell me what category of city Xuzhou is?", "cypher": "match (:ENTITY{name:'Xuzhou'}) <- [:Relationship{name:'location'}]-(x) - [:Relationship{name:'category'}]->(q) return distinct q.name"}, {"query": "Please tell me which platform is open on 3/15/2017?", "cypher": "match (:ENTITY{name:'March 15, 2017) <- [:Relationship{name:' platform open'}]- (x) return x.name"}, {"query": "Where is the North Sea City Aquarium?", "cypher": "match ((:ENTITY{name:'Hong Kong City Aquatic Exhibition Hall'}) - [:Relationship{name:' located at '}]-> (n) return n.name"}, {"query": "Tell me about 5 information tips for the career of a junior high teacher.", "cypher": "match (n:ENTITY{name:'snowflake'}) - [*]->(x) where x.name <>'snowflake' return distinct x.name limit 5"}, {"query": "What is the name of the cultivated area with an area of 1933 hectares?", "cypher": "match (:ENTITY{name:'1933'}) <- [:Relationship{name:'cultivated area'}]- ((x) - [:Relationship{name:'alias'}]->(p) return distinct p.name limit 1"}, {"query": "Can you print as many labels as possible on 100CR6 bearing steel?", "cypher": "match (:ENTITY{name:'100CR6 bearing steel'}) - [:Tag{name:'label'}]-> (h) with h order by h.name return h.name"}, {"query": "Can you list the personal information of the graduates of the TCU's T2C?", "cypher": "match (n:ENTITY{name:'hardcore'}) - [*1..2]->(x) where x.name <>'Cryptography' return distinct x.name"}, {"query": "Can you recommend 10 songs that are popular and nostalgic?", "cypher": "match (:ENTITY{name:'pop, nostalgic'}) <- [:Relationship{name:' music style'}]- (m) return m.name limit 10"}, {"query": "What are the names of the people who have been professors, principals, and members of the Chinese Printmakers Association at Zhejiang Academy of Fine Arts?", "cypher": "match (:ENTITY{name:'formerly Professor, Head of Department, and Chairman of the Chinese Printmakers Association'}) <- [:Relationship{name:'main achievements'}]-(p),(p) - [:Relationship{name:'alias'}]->(q) return distinct q.name limit 1"}, {"query": "Do you know what time it was open? The house in the mountains where American writer Agnes Keyes lived with her husband and family from 1934 to 1942 is a small house in the mountains.", "cypher": "match (:ENTITY{name:' Between 1934 and 1942, American writer Agnes Keyes lived with her husband and family in this small house in the mountains, a township under a hurricane that made Sabah famous and won her the respect of the people of Sabah. Based on her novel based on her life experiences in Sabah, the story is set in the year 1934."}, {"query": "What's the point of saying that 3 and the prize are the 3rd level of the label relationship?", "cypher": "match (n) - [:Tag*3{name:' tag'}]->(p:ENTITY{name:' award'}) RETURN distinct n.name limit 3"}, {"query": "Please provide me with details of the three-tier relationship regarding the provisional measures of the Standing Committee of the People's Congress of the City of Songkhun regarding incentives and guarantees for the office of the City's representative of the people.", "cypher": "match (n:ENTITY{name:'Standing Committee of the People's Congress of the City of Xinjiang on the Provisional Measures for Incentivising and Securing the Maintaining of the Office of the City Representative'}) - [*1..3]->(x) where x.name<>'Standing Committee of the People's Congress of the City of Xinjiang' return distinct x.name"}, {"query": "Do you know what other nickname is there for this place in the Northwestern District of China?", "cypher": "match (:ENTITY{name:'the Northwestern District of China'}) <- [:Relationship{name:'foreign name'}]-(h) - [:Relationship{name:'alias'}]->(x) return x.name order by x.name limit 1"}, {"query": "What old-time songs did you sing?", "cypher": "match (:ENTITY{name:'Yun Yi Fei'}) <--(m), (m) --(n) where n.name='Gui' return distinct m.name"}, {"query": "What are the occupations of the people in the industry?", "cypher": "match (:ENTITY{name:'person in the industry'}) <- [:Tag{name:'tag'}]-(n) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 10"}, {"query": "Do you know which exhibition has an exhibition area of 10,700 square meters?", "cypher": "match (h:ENTITY{name:'10700 square meters'}) <- [:Relationship{name:'exhibition area'}]- (x) return x.name"}, {"query": "When was the opening of the Anhui Foreign Trade and Trade Vocational School? and do you know the current principal of the school?", "cypher": "match (:ENTITY{name:'Anhui to Foreign Trade Professional College'}) - [:Relationship{name:'Time of foundation'}]->(n) return n.name as name union all match (:ENTITY{name:'Anhui to Foreign Trade Professional College'}) - [:Relationship{name:'Current Rector'}]->(m) return m.name as name"}, {"query": "Excluding the fact that the yellow fever bug is odorless, what else do you know about it?", "cypher": "match (:ENTITY{name:' yellow-butterfly'}) - [*1..2]-(p) where p.name <> 'dry, almost without moisture, without any odor' return p.name limit 5"}, {"query": "How many people are called \u014cta Atsuko?", "cypher": "match (:ENTITY{name:'\u304a\u304a\u305f\u306b\u3042\u3084\u304b'}) <--(n) return n.name The name of the match is"}, {"query": "What are the different leagues that have the same time as the Japan Professional Football League A. They are listed in order of the number of leagues.", "cypher": "match (n:ENTITY{name:'Japan Professional Football A-League'}) - [:Relationship{name:'time of holding'}]->(:ENTITY) <-[:Relationship{name:'time of holding'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "I'm not sure what Taegmin does for a living, but I'm not sure what he does for a living.", "cypher": "match (:ENTITY{name:'\u7530\u5146\u660e'}) <- [:Relationship{name:' Chinese name'}]-(h),(h) - [:Relationship{name:' profession'}]->(x) return distinct x.name"}, {"query": "And what do you know of the place where the cedar-tree sprouts come from?", "cypher": "match (:ENTITY{name:'\u4ed9\u5bd3\u9999\u82bd'}) <- [:Relationship{name:'Chinese name'}]- ((n) - [:Relationship{name:'produced by'}]->(q) return distinct q.name"}, {"query": "What are the symptoms of persistent severe abdominal pain, convulsive seizures, inhalation-free stools, marked bloating, nausea and vomiting?", "cypher": "match (:ENTITY{name:' sudden persistent severe abdominal pain, convulsive cramping, no exhaled stools, obvious bloating, nausea and vomiting'}) <- [Relationship{name:' common symptoms'}]- ((m) return distinct m.name"}, {"query": "What is the representation of the graduates of the Tokyo Tsuji-Baku Early High School?", "cypher": "match (m:ENTITY{name:'Tokyo T\u014dky\u014d Takayama Early High School'}) <- [:Relationship{name:'Graduate School'}]- ((q) - [:Relationship{name:'representing work'}]->(p) return distinct q.name"}, {"query": "Do you know what is the fourth layer of the relationship between the labels and the original desire?", "cypher": "match (n) <- [:Tag*4{name:'tag'}]- ((p:ENTITY{name:'original desire'}) RETURN distinct n.name limit 1"}, {"query": "Please list the main achievements of one party apart from the first prize of the 2006 calligraphy exhibition and the seventh prize of the 2002 book review.", "cypher": "match (n:ENTITY{name:'party\u5b88\u4e00'}) - [:Relationship{name:'main achievement'}]->(h) where h.name <> '06 first prize of the calligraphy fair' and h.name <> '02 book review as level seven' return distinct h.name limit 1"}, {"query": "What are the three layers of relationships that the desire to go home contains?", "cypher": "The following pages link to The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the King: The Return of the Return of the King: The Return of the Return of the King: The Return of the Return of the King: The Return of the Return of the Return of the King: The Return of the Return of the Return of the King: The Return of the Return of the Return of the King: The Return of the Return of the Return of the King: The Return of the Return of the Return of the Return of the King: The Return of the Return of the Return of the Return of the King: The Return of the Return of the Return of the Return of the Return of the King: The Return of the Return of the Return of the Return of the King: The Return of the Return of the Return of"}, {"query": "I'm wondering what port is the RPC (Remote Process Calling) service on?", "cypher": "match (:ENTITY{name:'RPC(called by a remote process) service'}) <- [:Relationship{name:'service'}]- (h) return h.name"}, {"query": "Which games are the same size as Naeli's cute baby games and what are the labels for each of them? Show these games in order of number of labels.", "cypher": "match (n:ENTITY{name:'Niley's cute baby'}) - [:Relationship{name:'game size'}]->(:ENTITY) <-[:Relationship{name:'game size'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you help me find the CAS number for 1-amino cyclohexanate?", "cypher": "match ((:ENTITY{name:'1-amino cycloacetate'}) - [:Relationship{name:'CAS number'}]-> (x) return x.name"}, {"query": "What chemical has a molar volume (m3/mol) of 205.6?", "cypher": "match (:ENTITY{name:'205.6'}) <- [:Relationship{name:'mol volume m3mol'}]- (x) return distinct x.name"}, {"query": "I remember the bugs didn't fill out the words?", "cypher": "match (:ENTITY{name:' bug'}) <- [:Relationship{name:' filler'}]-(m) where m is not null return 1"}, {"query": "The problem is that the public health press has published a two-tiered description of the relationship between the hazards of easily misused food additives and the identification of the work.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <> 'People's Health Publishing' return distinct x.name"}, {"query": "I want to know about the three levels of relationships in the novel.", "cypher": "match (n:ENTITY{name:'not to be confused with '}) - [*..3]->(x) where x.name<>'novel work' return distinct x.name"}, {"query": "How many Mandarin songs do you know?", "cypher": "match (:ENTITY{name:'Mandarin'}) <- [:Relationship{name:'Language of the song'}]- (n) return n.name limit 10"}, {"query": "For the person known as Rosanna, do you have any information about the important events that happened?", "cypher": "match (:ENTITY{name:'Rosanna'}) <- [:Relationship{name:'alias'}]-(n),(n) - [:Relationship{name:'important event'}]->(x) return x.name order by x.name limit 5"}, {"query": "Where are the main coffee machines located? What are the famous brands?", "cypher": "match (:ENTITY{name:' coffee machine'}) - [:Relationship{name:' main region'}]->(n) return n.name as name union all match (:ENTITY{name:' coffee machine'}) - [:Relationship{name:' famous brand'}]->(m) return m.name as name"}]