[{"query": "Which people have the same birthday as L\u00fadv\u00edksson Magn\u00fas M\u00e1r and what tags do they have?", "cypher": "The following is a list of all the different ways L\u00fadv\u00edksson Magn\u00fas M\u00e1r is credited in the database:"}, {"query": "What chemical substance has the molecular formula C6H11O2?", "cypher": "The name of the matching element is \"Relationship\" (Relationship)"}, {"query": "What are the labels of the organizations that offer training courses for software engineers and web marketers?", "cypher": "match (:ENTITY{name:' training class for software engineers and training class for web marketers'}) <- [:Relationship{name:' scope of operations'}]-(q) - [:Tag{name:' tag'}]->(p) return distinct p.name limit 1"}, {"query": "Which park has a bronze statue of King George V and Queen Mary?", "cypher": "match (:ENTITY{name:'Bronze statue of King George V and Queen Mary'}) <--(m), (m) -->(n) where n.name='park' return distinct m.name"}, {"query": "Help me find five dishes made with yogurt.", "cypher": "match (:ENTITY{name:'Key'}) <- [:Relationship{name:'main ingredient'}]-(m) return distinct m.name limit 5"}, {"query": "What is the shortest route between Lipari and Kanoan?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Lipari Island'}) - [*..2]-(b:ENTITY{name:'Canoan Island'})) return count ((p) The name of the island is not known"}, {"query": "Please list the representative works of Fresh Pirates Youth Group.", "cypher": "match (:ENTITY{name:'fresh pirate boys' team'}) - [:Relationship{name:'representative work'}]-> (x) return distinct x.name"}, {"query": "I would like to know the personal profile of Pi\u00f1on Lima, born in Milan, in a three-tier relationship?", "cypher": "match (n:ENTITY{name:'Piponi Lima'}) - [*1..3]->(x) where x.name <>'Milan' return distinct x.name"}, {"query": "Can you help me find 60 black and white science fiction movies?", "cypher": "match (:ENTITY{name:'science fiction film'}) <--(m), (m) --(n) where n.name='black and white' return distinct m.name limit 60"}, {"query": "What is the motive power of the Type 096 ballistic missile nuclear submarine in China?", "cypher": "match ((:ENTITY{name:'096 type ballistic missile nuclear submarine'}) - [:Relationship{name:'power'}]-> (x) return x.name"}, {"query": "What is the exhibition on March 15-18, 2013?", "cypher": "match (:ENTITY{name:'March 15-18, 2013)) <- [:Relationship{name:'season'}]- (p) return distinct p.name"}, {"query": "Can you explain to me the three pieces of information that entertainment initially has, besides the publication?", "cypher": "match (:ENTITY{name:'entertainment'}) --(m) with m order by m.name where m.name <> ' publication' return distinct m.name limit 3"}, {"query": "I wonder who else wrote the script for Death Save the Brethren besides Huang Yilong and Zhou Yue An?", "cypher": "match (n:ENTITY{name:'Relationship{name:'writer'}]->(h) where h.name <> 'Huang Yilong' and h.name <> 'Zhou Xiaoming' return distinct h.name limit 3"}, {"query": "What else do you know about the Suzhou Uni-Fong Wood Industries Limited? Can you help me find out 5 information about the company within the 3 levels?", "cypher": "match (:ENTITY{name:'Suzhou Union Fong Wood Industry Limited'}) - [*1..3]-(p) where p.name <> 'Suzhou city' return distinct p.name limit 5"}, {"query": "Can you provide the full profile of this Chinese person named Yu Yu?", "cypher": "match (n:ENTITY{name:'\u5b87'}) - [*]->(x) where x.name <> '\u5b87' return distinct x.name"}, {"query": "I need information on the two and the fake London 3 tag relationship, do you have it?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'false London'}) return distinct n.name limit 2"}, {"query": "Could you tell me what the chemical is for CAS number 2386-54-1?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What is the shortest connection between the two levels of the Beijing Olympic Water Park and the Beijing Olympic Park?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Beijing Olympic Water Park'}) - [:Relationship*..2]-(b:ENTITY{name:'Beijing Olympic Park'})) return count ((p) This is the list of all the shortest paths in the world."}, {"query": "The company was founded in 1968 can you tell me two things?", "cypher": "match (n:ENTITY{name:'1968'}) <- [:Relationship{name:'time of establishment'}]- (mn) return mn.name limit 2"}, {"query": "What is the shortest relationship between the two layers of tofu and tofu?", "cypher": "Match p=allshortestpaths (((a:ENTITY{name:'sweet tofu'}) - [:Relationship*..2]-(b:ENTITY{name:'sweet tofu'})) return count ((p)"}, {"query": "What about literary works and Zhang Yanqi's introduction to the three layers of the Moon?", "cypher": "match (n:ENTITY{name:' and Zhang Yanyiq Mid-Autumn to Moon'}) - [*1..3]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "Chinese Academy of Sciences software research all the PhDs?", "cypher": "match (:ENTITY{name:'Relationship{name:'Doctorate'}}) ->(n) return n.name as name union all match (:ENTITY{name:'Software Institute of the Chinese Academy of Sciences'}) -[:Relationship{name:'Master's'}]->(m) return m.name as name"}, {"query": "Do you know which works and which chronology of the years of Liu Xiaobo were written by the same publisher? What are the labels of each of these works? Please sort them in order of the number of labels of your brother's works?", "cypher": "match (n:ENTITY{name:'\u5c11\u6e38\u5e74\u8c31\u957f\u7f16'}) - [:Relationship{name:'publisher'}]->(:ENTITY) <- [:Relationship{name:'publisher'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Do you know when the book Teaching Children How to Be Human was printed before they were 10?", "cypher": "match ((:ENTITY{name:'Teach your child how to be a person before he is 10'}) - [:Relationship{name:'print time'}]-> (h) return h.name"}, {"query": "Can you tell me the five professions of actors?", "cypher": "match (:ENTITY{name:' actor'}) <- [:Relationship{name:' profession'}]- (m) return distinct m.name limit 5"}, {"query": "The problem is that you can tell us what kind of relationships are there in the three levels of the international service market?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' International service market'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What else do you know about the second spring of Lao-mo besides the Taiwanese drama?", "cypher": "match (:ENTITY{name:'The second spring of Grandma's'}) - [:Relationship*1..2]-(p) where p.name <> 'Taiwanese film' return p.name limit 10"}, {"query": "The project is a collaboration between the Ministry of Education and the Ministry of Education and the Ministry of Education.", "cypher": "match (n:ENTITY{name:' decoration and decoration project budget homework and training guide'}) - [:Relationship*1..2]->(x) where x.name <>'Yun Wang Junsan' return distinct x.name"}, {"query": "Can you tell me what kind of relationship is involved in the two layers of the relationship?", "cypher": "The following pages link to The Unknown:"}, {"query": "The number of companies in Fujairah is estimated at about 7 million.", "cypher": "match (p:ENTITY{location: Fuji) return count ((p)"}, {"query": "Do you know what year Du Jan was born?", "cypher": "MATCH (n:ENTITY{name:'Du Chan'}) - [:Relationship{name:'date of birth'}]->(m) return substring ((m.name, 0,5))"}, {"query": "Can you give me 3 Space Task Force 5 Moon-backed UFO's besides the cultural activities?", "cypher": "match (:ENTITY{name:'Space Task Force 5\u00b7Lunar-backed giant UFO'}) --(m) with m order by m.name where m.name <> 'cultural activities' return distinct m.name limit 3"}, {"query": "The article is about the most important event in the history of the country.", "cypher": "match (:ENTITY{name:'June 2nd'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name limit 5"}, {"query": "Can you list five personal details of Endzanga Wilfrid, a Congolese national?", "cypher": "match (n:ENTITY{name:'Endzanga Wilfrid'}) - [*]->(x) where x.name<>'Congo' return distinct x.name limit 5"}, {"query": "What is the difference between aspx and asp pages?", "cypher": "match (:ENTITY{name:'aspx web page'}) - [:Describe{name:'describe'}]->(n) return n.name"}, {"query": "Who is the prominent leader of the Kyaw Kyaw Kyaw Mieng people's anti-Qin uprising?", "cypher": "match (:ENTITY{name:'Dark Kyaw Ka-wan, prominent leader of the Miyan people's anti-Chen uprising'}) --(x) return distinct x.name"}, {"query": "Which companies are registered with the CARICOM Market Regulatory Authority?", "cypher": "match (:ENTITY{name:'Relationship{name:'Registration authority'}}) - (h) return h.name limit 5"}, {"query": "Did you know that yoga is a 1+N multi-efficient weight lifting procedure?", "cypher": "match (:ENTITY{name:'1+N multi-efficient heavy surgery'}) --(m) with m order by m.name return m.name"}, {"query": "How many species of ants are there?", "cypher": "The name of the group is the same as the name of the other group. The name of the group is the same as the name of the other group."}, {"query": "Can you describe the EMS enhanced audio text message in no more than five words?", "cypher": "match (:ENTITY{name:'EMS enhanced audio text message'}) --(n) with n order by n.name return n.name limit 5"}, {"query": "Do you know what the name of the drug for the confidence pill is?", "cypher": "match ((:ENTITY{name:'confidence pill'}) - [:Relationship{name:'name of drug'}]-> (q) return q.name"}, {"query": "Do you know the name of the area at an altitude of 1,397.00 meters?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "The contest is being held from August 29 to September 3 and the name of the contest is:", "cypher": "match (:ENTITY{name:'August 29 to September 3'}) <- [:Relationship{name:'time of holding'}]- (x) return distinct x.name"}, {"query": "Tell me about a J.H. Wellman career, but not an actor and a screenwriter?", "cypher": "match (n:ENTITY{name:'J.H. Wheeman'}) -[:Relationship{name:'profession'}]->(h) where h.name <> 'actor' and h.name <> 'writer' return distinct h.name limit 1"}, {"query": "What are the tag features of 10Base-FL?", "cypher": "match (:ENTITY{name:'10Base-FL'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "In which country was Qunu?", "cypher": "Match (:ENTITY{name:'Knu was'}) - [:Relationship{name:'nationality'}]->(n) return n.name"}, {"query": "Did you know that the three types of relationships are contained within the Quanzhou ship?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Kuzunou ship'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "Can you tell me about the top 10 largest car models?", "cypher": "match (:ENTITY{name:'medium-sized'}) <- [:Relationship{name:'car level'}]- (h) return h.name limit 10"}, {"query": "The following companies are listed in alphabetical order by number of labels:", "cypher": "match (n:ENTITY{name:'Lingting Atomic Explosion Engineering Ltd'}) - [:Relationship{name:'time of establishment'}]->(:ENTITY) <- [:Relationship{name:'time of establishment'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Please tell me where the concert is on 2012.7.4?", "cypher": "match (:ENTITY{name:'2012.7.4'}) <- [:Relationship{name:' time of show'}]- (m) return m.name"}, {"query": "What is the shortest relationship path between the Arabian stingray and the elongated conch shark in the two layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Arabian stingray'}) - [:Relationship*..2]-(b:ENTITY{name:'shortest shark'})) return count ((p)"}, {"query": "I have been asked to name four artists and their nationality.", "cypher": "match (:ENTITY{name:'artist'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'nationality'}]->(n) return m.name,n.name limit 4"}, {"query": "How many awards has Guangzhou Chinese Medical University won?", "cypher": "match (:ENTITY{name:' Guangzhou Chinese Medical University'}) - [:Relationship{name:' major award'}]->(n) return count(n)"}, {"query": "Do you know what the research area of immunotoxicology is?", "cypher": "match (:ENTITY{name:'immunotoxicology'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'research area'}]->(n) return distinct n.name"}, {"query": "Have you been to the 2011 China National Electricity Expo in Shanghai, where is it being held in Shanghai?", "cypher": "match ((:ENTITY{name:'2011 China [Shanghai] Home Appliance Expo'}) - [:Relationship{name:' Location'}]-> (q) return q.name"}, {"query": "What are the main achievements and representative works of Tan Taneda?", "cypher": "match (:ENTITY{name:'Karan'}) - [:Relationship{name:'main achievements'}]->(n) return n.name as name union all match (:ENTITY{name:'Karan'}) - [:Relationship{name:'representative work'}]->(m) return m.name as name"}, {"query": "Please tell me what kind of relationship is involved in the two levels of lung cancer?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' town of lung cancer'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you explain to me the term \"1.5-tier city\"?", "cypher": "match (:ENTITY{name:'1.5 line city'}) --(p) with p order by p.name return p.name"}, {"query": "What is the name of the ACG?", "cypher": "match (:ENTITY{name:'ACG'}) <- [:Relationship{name:' abbreviated '}]- (p) return distinct p.name"}, {"query": "Can you tell me what kind of labels two pillows have that don't include nature and culture?", "cypher": "match (n:ENTITY{name:'door pillow'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'nature' and h.name <> 'culture' return distinct h.name limit 2"}, {"query": "What else do you know about the pillar stone other than that it is from Myanmar?", "cypher": "match (:ENTITY{name:'square-column stone'}) - [*1..2]-(p) where p.name <> 'Mongolian state of Myanmar' return p.name limit 10"}, {"query": "Do you have any other labels besides non-sport and personality?", "cypher": "match (n:ENTITY{name:'practice true true'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'non-sport' and h.name <> 'person' return distinct h.name limit 1"}, {"query": "Help me find a soup made from shark.", "cypher": "match (:ENTITY{name:'shrimp'}) <- [:Relationship{name:'main ingredient'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='soup' return distinct m.name limit 1"}, {"query": "Can you tell me when Muhammad II [historical figure] died?", "cypher": "match ((:ENTITY{name:'Muhammad II [historical figure]'}) - [:Relationship{name:'date of death'}]-> (n) return n.name"}, {"query": "I'm wondering what the accident was that caused five construction workers to lose their connection?", "cypher": "match (:ENTITY{name:'5 construction workers lost contact'}) <- [:Relationship{name:'casualties'}]- (q) return distinct q.name"}, {"query": "Can you list 10 supplements that taste fresh and fresh?", "cypher": "match (:ENTITY{name:'sweet, fresh'}) <- [:Relationship{name:'flavor'}]-(h),(h) - [:Relationship{name:'supplement'}]->(p) return distinct p.name limit 10"}, {"query": "What is the range and accuracy of the magnetic disk's directional measurement?", "cypher": "match (:ENTITY{name:'disc'}) - [:Relationship{name:'navigation measurement range'}]->(n) return n.name as name union all match (:ENTITY{name:'disc'}) - [:Relationship{name:'navigation accuracy:'}]->(m) return m.name as name"}, {"query": "Do you know what the characteristics of love in 1977 are?", "cypher": "match (:ENTITY{name:'1977 love'}) --(h) with h order by h.name return h.name"}, {"query": "Tell me which games are next in the 2018 Pyeongchang Winter Olympics?", "cypher": "match (:ENTITY{name:'2018 Winter Olympics in Pyeongchang'}) <- [:Relationship{name:'next edition'}]- (n) return distinct n.name"}, {"query": "The number of books in the world is three.", "cypher": "match (:ENTITY{name:' three'}) <- [:Relationship{name:' number'}]- (n) return n.name"}, {"query": "What are the most representative works of the author born in 1943? Name three?", "cypher": "match (h:ENTITY{name:'1943'}) <- [:Relationship{name:'date of birth'}]- ((q),(q) - [:Relationship{name:'represents work'}]->(n) return distinct n.name limit 3"}, {"query": "Apart from the Internet, what are the three labels of People's Life Information Technology [Beijing] Limited?", "cypher": "match (:ENTITY{name:'People Car Life Information Technology [Beijing] Limited'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'Internet' return p.name limit 3"}, {"query": "What are the main minerals and minerals that make up serpentine rocks?", "cypher": "match (:ENTITY{name:' serpentine rock'}) - [:Relationship{name:' main constituent mineral'}]->(n) return n.name as name union all match (:ENTITY{name:' serpentine rock'}) - [:Relationship{name:' related mineral'}]->(m) return m.name as name"}, {"query": "Can you name five social events?", "cypher": "match (:ENTITY{name:' social event'}) <--(n) return n.name limit 5"}, {"query": "Do you have any doctors with PhDs? Can you find three for me?", "cypher": "match (:ENTITY{name:'doctor'}) <- [:Relationship{name:'degree'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='doctor' return m.name limit 3"}, {"query": "What is the subject of 02 with 5 messages?", "cypher": "match (:ENTITY{name:'02 subject'}) --(x) with x order by x.name return x.name limit 5"}, {"query": "Which exam materials are on sale for 7.5 discount lately?", "cypher": "Match (s) (m) return m.name (s) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m)"}, {"query": "I want to know who the editors are.", "cypher": "match (:ENTITY{name:'composer'}) --(q) return q.name skip 2"}, {"query": "The first is the fact that the government has not yet decided on the issue.", "cypher": "match (n:ENTITY{name:'stringSL-F02'}) --(x) return x.name"}, {"query": "I would like to ask you how many of the main departments of the Higher Technical School in Mecca are there?", "cypher": "match (:ENTITY{name:' that is, the City of Mecca's High School of Engineering'}) - [:Relationship{name:' the main faculty'}]-> (p) return p.name skip 1"}, {"query": "Can you tell me which company is mainly involved in channel promotion and mobile internet research and development?", "cypher": "match (:ENTITY{name:'Channel promotion and mobile Internet research and development'}) <- [:Relationship{name:' business'}]- (m) return m.name"}, {"query": "Can you recommend 20 ACT-type games for me?", "cypher": "Match (:ENTITY{name:'ACT'}) <- [:Relationship{name:'game type'}]- (h) return h.name limit 20"}, {"query": "I wonder what kind of warships are there with a width of 16 meters and a length of 16 meters?", "cypher": "match (:ENTITY{name:'16 m'}) <- [:Relationship{name:'ship width'}]- (x) return x.name"}, {"query": "In addition to the 600*800*1700V range, what are the three voltage ranges that a 40KVA T-series can operate in?", "cypher": "match (:ENTITY{name:'T series 40KVA'}) <- [:Relationship{name:'Chinese name'}]-(q) - [:Relationship{name:'voltage range'}]->(p) where p.name <> '600*800*1700V' return distinct p.name limit 3"}, {"query": "What books are priced at $8? Can you help me find three?", "cypher": "match (:ENTITY{name:'8\u5143'}) <- [:Relationship{name:'priced'}]-(h),(h) - [:Relationship{name:'book name'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "Please help me find the other 5 information about the Black Dog Brothers 2 on the mountain.", "cypher": "match (:ENTITY{name:' black dog brother'}) - [*1..2]-(p) where p.name <> 'record' return p.name limit 5"}, {"query": "Do you know what types of relationships are contained in the three layers of the inner-mountain pineapple?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' mountain pineapple'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "I'm going to be a little bit more specific about George Blankpohn, but I'm not sure if I'm going to be able to tell you about him.", "cypher": "match (h:ENTITY{name:'George Blankbourn'}) --(q) return q.name skip 3 The name of the game is the same as the name of the game itself."}, {"query": "What is the most representative work of the husband of the mayor of Rouen?", "cypher": "match (:ENTITY{name:'roadmaster'}) <- [:Relationship{name:'husband'}]-(x),(x) - [:Relationship{name:'representative work'}]->(m) return distinct m.name limit 10"}, {"query": "Do you know what Baidu does for a living?", "cypher": "match (:ENTITY{name:'Bei Yu'}) <- [:Relationship{name:'Chinese name'}]- ((m) - [:Relationship{name:'profession'}]->(x) return distinct x.name limit 1"}, {"query": "Fire Speed tells me about the different tags for .at domain names?", "cypher": "match (n:ENTITY{name:'.at domain name'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Can you introduce me to the book The Windmill of God?", "cypher": "match (:ENTITY{name:'Windmill of God'}) <- [:Relationship{name:'book name'}]-(x),(x) - [:Tag{name:'tag'}]->(q) return distinct q.name"}, {"query": "Which chemicals are 99.0% pure? Name nine?", "cypher": "match (:ENTITY{name:'\u226599.0%'}) <- [:Relationship{name:' purity'}]- (n) return n.name limit 9"}, {"query": "I want to purify phenylalanine, do you know where it boils?", "cypher": "match ((:ENTITY{name:'nonphenylen'}) - [:Relationship{name:'boiling point'}]-> (x) return x.name"}, {"query": "Can you give me details of the three-tier relationship of Morev Andrey from Kazakhstan?", "cypher": "match (n:ENTITY{name:'Morev Andrey'}) - [*1..3]->(x) where x.name<>'Kazakhstan' return distinct x.name"}, {"query": "The first thing I want to ask you is, which warship is 112.7 meters long?", "cypher": "match (:ENTITY{name:'112.7 m'}) <- [:Relationship{name:'full length'}]- (x) return distinct x.name"}, {"query": "Can you list the most representative works of the name Pug?", "cypher": "match (:ENTITY{name:'penname'}) <- [:Relationship{name:'alias'}]-(h),(h) - [:Relationship{name:'representing work'}]->(n) return distinct n.name"}, {"query": "Can you tell me about the types of relationships in the two layers of the four-tiered banana?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Relationship'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 4"}, {"query": "What is the shortest connection path between the closed stairway and the smoke-proof stairway on the 2nd floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'closed stairway'}) - [*..2]-(b:ENTITY{name:'smokeproof stairway'})) return count ((p)"}, {"query": "What is the name of the publication called 100 times crying?", "cypher": "match (:ENTITY{name:'100 times crying'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'publication' return h.name"}, {"query": "The article is about the life of Miguel Riveras.", "cypher": "match (:ENTITY{name:'Miguel Riveras'}) --(q) return distinct q.name limit 3 The name of the game is the same as the name of the game itself."}, {"query": "Do you have other aliases for brands like Odai, Haiba, Marun, Japan ASAHI?", "cypher": "match (:ENTITY{name:'\u5927,\u6d77\u99ac,\u5143,\u65e5\u672cASAHI etc'}) <- [:Relationship{name:'brand'}]- ((n) - [:Relationship{name:'alias'}]->(q) return distinct n.name"}, {"query": "What else did you do besides singing at a party?", "cypher": "match (:ENTITY{name:'Relationship{name:'Relationship'}) <- [Relationship{name:'Relationship'}]-(m) where m.name <> 'Relationship' return distinct m.name"}, {"query": "What nationality is Joey Vandenborg of whom we are talking today?", "cypher": "Match ((:ENTITY{name:'Joy Van Den Bosch'}) - [:Relationship{name:'nationality'}]-> (p) return p.name The name of the game is the same as the name of the game."}, {"query": "I'm going to show you the work of five people in Scorpio.", "cypher": "match (:ENTITY{name:'Scorpio'}) <- [:Relationship{name:'Scorpio'}]-(h),(h) - [:Relationship{name:'representing work'}]->(p) return p.name order by p.name limit 5"}, {"query": "What is the shortest distance between the two levels of General Zhang Leiping and Zhang Chongwen?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Zhang Leiping [People's Liberation Army Major General]'}) - [*..2]-(b:ENTITY{name:'Zhang Chongwen [Linghai City Township, Zhejiang Province]')) return count ((p)"}, {"query": "What is the 800 Questions for Infant and toddler intellectual development written by Zhang Zhen?", "cypher": "match (:ENTITY{name:'0~6 years old Infant and toddler intellectual development 800 questions'}) --(x) with x order by x.name where x.name <> 'Zhang's' return x.name"}, {"query": "What are the three types of TV shows produced by East East Productions Limited?", "cypher": "match (:ENTITY{name:'Just East Production Limited'}) <- [*]-(m), (m) - [:Relationship{name:' type'}]->(n) return distinct m.name, n.name limit 3"}, {"query": "The following is a list of some of the topics that Hamzic A has been involved in.", "cypher": "match (n:ENTITY{name:'Hamzic A'}) - [*1..2]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "Do you know what medical treatment Wang Min invented?", "cypher": "match (:ENTITY{name:'Wang Min'}) <- [:Relationship{name:'creator'}]- (h) return distinct h.name"}, {"query": "Can you list the top 10 books written by Capricorn writers?", "cypher": "match (:ENTITY{name:'Scorpio'}) <- [:Relationship{name:'Scorpio'}]- ((h) - [:Relationship{name:'main work'}]->(m) return distinct m.name limit 10"}, {"query": "Can you find me the address of the headquarters of three listed companies?", "cypher": "match (:ENTITY{name:'listed company'}) <- [:Relationship{name:'company nature'}]- ((n) - [:Relationship{name:'headquarters location'}]->(q) return distinct q.name limit 3"}, {"query": "What are the main achievements of graduates of the Chinese Military Police Command Academy?", "cypher": "match (:ENTITY{name:'China Military Police Officer Commanding Academy'}) <- [:Relationship{name:'Graduate Academy'}]- ((h) - [:Relationship{name:'Main achievements'}]->(x) return distinct x.name"}, {"query": "Can you tell me the types of relationships within the two layers of the Red Square?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Red City Temple'}) UNWIND relationships(path) AS rel return distinct rel.name limit 5"}, {"query": "Can you tell me what this Chinese person does for a living? Please tell me three.", "cypher": "match (:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]-(x),(x) - [:Relationship{name:'profession'}]->(h) return h.name skip 2 limit 3"}, {"query": "Can you recommend me five free books and magazines?", "cypher": "match (:ENTITY{name:'free'}) <- [:Relationship{name:'price'}]- (n) return distinct n.name limit 5"}, {"query": "Can you tell me about the five famous places in China?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'country'}]-(p) - [:Relationship{name:'famous places'}]->(n) return distinct n.name limit 5"}, {"query": "What are the plants in the genus of the orchid besides the watermelon? Can you name five?", "cypher": "match (:ENTITY{name:'sect'}) <-[:Relationship{name:'sect'}]-(m) where m.name <>'Plain Lake Watermelon' return distinct m.name limit 5"}, {"query": "Can you tell me which earthquake was 45.4 degrees north latitude and 132.0 degrees east longitude?", "cypher": "match (:ENTITY{name:'Northeast 45.4 degrees, east 132.0 degrees'}) <- [:Relationship{name:'Earthquake in the northern latitude'}]- (n) return distinct n.name"}, {"query": "What is the shortest relationship path between the two layers of sugar and caramel?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'sugar loaf'}) -[:Relationship*..2]-(b:ENTITY{name:'sugar loaf'})) return count ((p)"}, {"query": "Can you recommend seven songs with a duration of 3 minutes and 38 seconds?", "cypher": "match (:ENTITY{name:'3 min 38 seconds'}) <- [:Relationship{name:'music length'}]- (q) return q.name limit 7"}, {"query": "The abbreviation for the Center for Social Media Research at Peking University is CSMR, and it belongs to the organization.", "cypher": "match (n:ENTITY{name:'Socialized Media Research Center of Peking University'}) -->(h) with h order by h.name where h.name <> 'CSMR' and h.name <> 'organization' return h.name limit 2"}, {"query": "Can you list 10 representative works of Chinese literature?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(m),(m) - [:Relationship{name:'representative work'}]->(q) return distinct q.name limit 10"}, {"query": "Can you find me five films that Dingri is a producer on?", "cypher": "match (:ENTITY{name:'dingri'}) <- [:Relationship{name:'producer'}]-(p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 5"}, {"query": "Help me find 10 painters.", "cypher": "match (:ENTITY{name:'painter'}) <- [:Relationship{name:'profession'}]-(m) return distinct m.name limit 10"}, {"query": "Which exhibition is coming on September 21, 2011?", "cypher": "match (n:ENTITY{name:'21 September 2011 23 September 2011'}) <- [:Relationship{name:'exhibition time'}]- (m) return m.name"}, {"query": "I want to buy something at 123 Easy Taobao, do you know any shopping tips?", "cypher": "match ((:ENTITY{name:'123 easy-to-find-online'}) - [:Relationship{name:'shopping tips'}]-> (n) return n.name"}, {"query": "Can you give me some examples of the famous sights in the southern Ghassanflower Seaport?", "cypher": "Match (:ENTITY{name:'Southern Grasshopper Scenic Area'}) - [:Relationship{name:'Famous attractions'}]-> (n) return n.name skip 2"}, {"query": "Help me find 10 A-level hospitals.", "cypher": "match (:ENTITY{name:'level A and similar'}) <- [:Relationship{name:'hospital grade'}]-(m) return distinct m.name limit 10"}, {"query": "When is the anniversary of the Victory in the Battle of Stalingrad and where is the institution?", "cypher": "match (m:ENTITY{name:'Victory Day of the Battle of Stalingrad'}),(m) - [:Relationship{name:'set time'}]->(n), (m) - [:Relationship{name:'set location'}]->(h) return n.name,h.name"}, {"query": "The school is a great place to learn about the history of the country, and the school is a great place to learn about the history of the country.", "cypher": "match (:ENTITY{name:'Young aspiring, achieving future\u3002'}) <- [:Relationship{name:'Teacher's remark'}]-(p),(p) - [:Relationship{name:'Known alumnus'}]->(x) return distinct x.name limit 1"}, {"query": "My classmates, this Visual C+++.NET university tutorial you have in your hands, does anyone know the original name of it?", "cypher": "match ((:ENTITY{name:'Visual C++.NET University Tutorial'}) - [:Relationship{name:'original name'}]-> (m) return m.name"}, {"query": "Help me find five species of squirrels.", "cypher": "match (:ENTITY{name:' family of squirrels'}) <- [:Relationship{name:' family of squirrels'}]-(m) return distinct m.name limit 5"}, {"query": "1322 Games has a plugin for the tag?", "cypher": "match (:ENTITY{name:'1322 game'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'software' return q.name"}]