[{"query": "I would like to know what else is there about the Crown Prince besides General Yang Zhiwei? Help me find 10 information on this person in 2 layers.", "cypher": "match (:ENTITY{name:' the king of the jungle [Doh Han final year name]'}) - [*1..2]-(p) where p.name <> 'the king of the jungle' return p.name limit 10"}, {"query": "What is the name of the international standard airline credit card issued by China Construction Bank and China Eastern Airlines?", "cypher": "match (:ENTITY{name:'China Construction Silver China Eastern Airlines'}) <- [:Relationship{name:'Issuing agency'}]-(m), (m) - [:Relationship{name:'type'}]->(n) where n.name='International Standard Airlines Unified Credit Card' return distinct m.name"}, {"query": "What is the asset/liability ratio and what are the applications?", "cypher": "match (:ENTITY{name:'Availability'}) - [:Describe{name:'tag'}]->(n) return n.name as name union all match (:ENTITY{name:'Availability'}) - [:Relationship{name:'area of application'}]->(m) return m.name as name"}, {"query": "Can you tell us about Richard Lane?", "cypher": "match (:ENTITY{name:'Richard Lane'}) --(x) return x.name order by x.name"}, {"query": "I would like to know what shows are scheduled for December 30, 2013?", "cypher": "match (:ENTITY{name:'December 30, 2013'}) <- [:Relationship{name:'time of show'}]- (x) return x.name"}, {"query": "What is the shortest relationship between the Vickers and the Pioneer within the two layers?", "cypher": "The first time the two spacecraft met, the first time they were able to get a match, the second time they were able to get a match."}, {"query": "Tell me about the 328-page textbook on contract law for high schools: how does it relate to the four layers of relationships in this book?", "cypher": "match (n:ENTITY{name:'Higher school textbook: contract law course'}) - [*1..4]->(x) where x.name<>'328 pages' return distinct x.name limit 5"}, {"query": "How to spell ten Chinese words?", "cypher": "match (:ENTITY{name:'Chinese vocabulary'}) <- [:Relationship{name:'attribute'}]- ((m) - [:Relationship{name:'spelling'}]->(q) return q.name order by q.name limit 10"}, {"query": "Please help me find the country and unit that developed the MiG-15 fighter.", "cypher": "match (:ENTITY{name:'Mig-15 fighter'}) - [:Relationship{name:'nation'}]->(n) return n.name as name union all match (:ENTITY{name:'Mig-15 fighter'}) - [:Relationship{name:'development unit'}]->(m) return m.name as name"}, {"query": "The following is a list of literary works by Ryu Min-Shichikou, which have been viewed over a thousand times in the past day.", "cypher": "match (n:ENTITY{name:'Ruyung\u00b7\u671f\u601d\u6eaa\u4e0a\u65e5\u5343\u56de'}) - [:Relationship*1..2]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "The Chinese government has been trying to get the Chinese government to stop the Chinese government from selling Chinese products to the Chinese.", "cypher": "match (n:ENTITY{name:'Chen Kwon [revolutionary jungle]'}) - [:Relationship*]->(x) where x.name <> 'Han Chinese' return distinct x.name limit 5"}, {"query": "I would like to know which books were published on December 1, 2004?", "cypher": "match (:ENTITY{name:'December 1, 2004'}) <- [:Relationship{name:'date of publication'}]- (n) return n.name limit 6"}, {"query": "Please help me find a job as a host, singer, actor, writer, please.", "cypher": "match (:ENTITY{name:' host, singer, actor, writer'}) <- [:Relationship{name:' profession'}]- ((x),(x) - [:Relationship{name:' Chinese name'}]->(q) return distinct q.name limit 1"}, {"query": "Can you recommend a website where you can share resources?", "cypher": "match (:ENTITY{name:'home of shared resource'}) <- [:Relationship{name:'network function'}]- (h) return h.name"}, {"query": "What are the famous sights in Copper Lions?", "cypher": "match (:ENTITY{name:'copper beam area'}) - [:Relationship{name:'famous attractions'}]-> (m) return distinct m.name"}, {"query": "I don't suppose you have five levels of relationship information that I don't think you have in your heart?", "cypher": "The following pages link to The Unknown:"}, {"query": "Do you know what reports were implemented on September 22, 2011?", "cypher": "match (:ENTITY{name:'22nd of September 2011'}) <- [:Relationship{name:'time of implementation'}]- (p) return distinct p.name"}, {"query": "I would like to know about the other 4 items in the 5310m2 floor of HP laptop.", "cypher": "match (:ENTITY{name:'HP5310m'}) - [*1..2]-(p) where p.name <> 'laptop' return p.name limit 4"}, {"query": "His English name is XIDANStation, do you know what it is?", "cypher": "match (:ENTITY{name:'XIDANStation'}) <- [:Relationship{name:' foreign language name'}]- ((m),(m) - [:Relationship{name:' operating unit'}]->(q) return distinct q.name"}, {"query": "Can you tell me what the relationship between cities and culture is on these two levels?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' cities and culture'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "Can you tell us about the type of relationship involved in grilling turkey in 5 layers?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:' baked turkey'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What are the novels that are available on 17k Novel Network? Can you tell me seven?", "cypher": "match (:ENTITY{name:'17k novel network'}) <- [:Relationship{name:'connecting platform'}]- (q) return q.name limit 7"}, {"query": "You don't understand what the coverage of Green Boat Primary School in the three levels has to do with it?", "cypher": "The following pages link to The Unknown:"}, {"query": "I'm not sure if you've got more than ten tags to introduce 16WiFi?", "cypher": "match (:ENTITY{name:'16WiFi'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 10"}, {"query": "Can you tell me about the three companies that were founded in 2014?", "cypher": "match (:ENTITY{name:'2014'}) <- [:Relationship{name:'time of establishment'}]-(n) - [:Relationship{name:'company name'}]->(q) return distinct q.name limit 3"}, {"query": "Do you know who is the manufacturer of this 2007 Kosta 4.0T diesel luxury 20s that we are looking at?", "cypher": "match ((:ENTITY{name:'2007 Kosta 4.0T diesel luxury version 20 seats'}) - [:Relationship{name:' manufacturer'}]-> (h) return h.name"}, {"query": "Tell me about the five 1313UV flatbed printers?", "cypher": "match (:ENTITY{name:'1313uv tablet printer'}) --(p) with p order by p.name return p.name limit 5"}, {"query": "Do you know which one was a 2.6 magnitude earthquake?", "cypher": "The name of the file is the same as the name of the file."}, {"query": "What happened on January 29, 2018?", "cypher": "match (:ENTITY{name:'January 29, 2018'}) <- [:Relationship{name:'time'}]- (m) return distinct m.name"}, {"query": "Name one of the major departments of the Beijing Industrial School.", "cypher": "match (:ENTITY{name:'Beijing Industrial School'}) - [:Relationship{name:'Main Faculty'}]-> (x) return distinct x.name limit 1"}, {"query": "Who won the title of best male player at the 2013 East Asian Cup in South Korea?", "cypher": "Match (s) (h) return (h) name (s) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h) (h (h) (h) (h) (h) (h) (h) (h (h) (h) (h) (h) ("}, {"query": "Does anyone know when World of Tanks will be released?", "cypher": "match (:ENTITY{name:'World of Tanks'}) <- [:Relationship{name:' belongs to series'}]-(n) - [:Relationship{name:' release date'}]->(x) return distinct x.name limit 3"}, {"query": "I'm curious to know what other information besides film work touched my heart? Please help me find 7 of the 3 layers.", "cypher": "match (:ENTITY{name:'songs have to be'}) -[*1..3]-(p) where p.name <> 'film work' return p.name limit 7"}, {"query": "Did you know that the coal mine accident in Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside,", "cypher": "match (:ENTITY{name:'Soon family town of Sunny family coal mine'})"}, {"query": "Can you list any of the 3rd level labels that are related to Left Eye Detective? 5 can you?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'left-eye detective'}) return distinct n.name limit 5"}, {"query": "What books are priced at $49.8? Can you recommend 10?", "cypher": "match (:ENTITY{name:'49.80 yuan'}) <- [:Relationship{name:' priced'}]- (n) return n.name limit 10"}, {"query": "Who is the next best screenwriter after Shaggy?", "cypher": "match (:ENTITY{name:'snap after dragon'}) --(p) return p.name order by p.name"}, {"query": "Can you tell me five things you know about the second layer of the national news, other than the newspaper that belongs to the Qing Dynasty?", "cypher": "match (:ENTITY{name:'Relationship*1..2]->(p) where p.name <> 'newspaper of the Qing Dynasty' return p.name limit 5"}, {"query": "Have you read the fantasy novel Witch in Disguise, and share it with me?", "cypher": "match (:ENTITY{name:' disguised witch'}) --(n) with n order by n.name where n.name <> ' disguised witch' return n.name"}, {"query": "Do you know which weapons are the 56-1, 56-2, 81 classes?", "cypher": "match (p:ENTITY{name:'56-1\u300156-2\u300181 forms'}) <- [:Relationship{name:'subtype'}]- (m) return distinct m.name"}, {"query": "Please describe to me all the information about the Oregon White-tailed Deer subspecies.", "cypher": "match (:ENTITY{name:'Blankettails of Oregon'}) --(h) return h.name order by h.name"}, {"query": "Which game was originally called 1500 DS Spirits Vol.2 Shogi?", "cypher": "The game is also known as the \"Shogi\" game."}, {"query": "Listed below are the products of the technology NACHI 29392E bearing.", "cypher": "match (n:ENTITY{name:'NACHI 29392E bearing'}) - [:Relationship*1..2]->(x) where x.name <> 'technology product' return distinct x.name"}, {"query": "This man was born in Sichuan province, do you know what he does for a living?", "cypher": "match (:ENTITY{name:' Sichuan Province'}) <- [:Relationship{name:'place of birth'}]-(x) - [:Relationship{name:'profession'}]->(h) return h.name order by h.name limit 5"}, {"query": "I would like to know what else is there to know about neonatal jaundice besides the common newborn disease? Help me find 10 information in 3 layers related to this school.", "cypher": "match (:ENTITY{name:' newborn yellow fever'}) - [*1..3]-(p) where p.name <> 'paediatrics, newborn paediatrics' return p.name limit 10"}, {"query": "Do you know the date of birth of football star Lundstram?", "cypher": "match ((:ENTITY{name:'Lendstrand'}) - [:Relationship{name:'date of birth'}]-> (h) return h.name"}, {"query": "Help me find 10 birds with crooked eyes.", "cypher": "match (:ENTITY{name:'shaped eye'}) <-[:Relationship{name:'shaped eye'}]-(m) return distinct m.name limit 10"}, {"query": "Tell me about the three main achievements of the Beijingers.", "cypher": "match (:ENTITY{name:'Beijing'}) <- [:Relationship{name:'place of birth'}]-(x) - [:Relationship{name:'main achievements'}]->(h) return distinct h.name limit 3"}, {"query": "What chemical is CAS number 119171-18-5?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Can you give me five facts about the 05 China Electricity Bond?", "cypher": "match (:ENTITY{name:'05 China electricity bond'}) --(p) with p order by p.name return p.name limit 5"}, {"query": "The blog post \"100 Floors\" is a great way to get your business started.", "cypher": "match (:ENTITY{name:'100Floors'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "The first is the \"100 Gates: Finding the Fountainhead\" campaign.", "cypher": "match (m:ENTITY{name:'100 Gates: search for a tag'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 10"}, {"query": "The Chinese Academy of Painting and Sculpture, which other profession has the same name?", "cypher": "match (:ENTITY{name:'category'}) <- [:Relationship{name:'Chinese name'}]-(q),(q) - [:Relationship{name:'profession'}]->(m) where m.name <> 'Academician of the Chinese Academy of Sciences' return distinct m.name limit 1"}, {"query": "Who among the six singers born in Taiwan's Pyongyang?", "cypher": "match (:ENTITY{name:'Taiwanese screenshot six stacks'}) <- [:Relationship{name:'place of birth'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='singer' return m.name"}, {"query": "Do you know his 5 main achievements? He is Park Jung-hyun, No. 1 in the tree, North Korean Qin Shan-do, also known as Kochi Sung-young.", "cypher": "match (:ENTITY{name:'\u6734\u6b63, No. in tree, North Korean Qing Shan Road, also known as Kaokumi Jong-hyun\u3002'}) <- [:Describe{name:'description'}]-(x),(x) - [:Relationship{name:'main achievement'}]->(q) return q.name order by q.name limit 5"}, {"query": "Please help me find three card games, what platforms are they for?", "cypher": "match (:ENTITY{name:'card game'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'app platform'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "I'm wondering now what kind of relationships are involved in the Chinese Social Science Evaluation Center in the two layers?", "cypher": "The following pages link to The Chinese Academy of Sciences:"}, {"query": "Do you know where the scope of application of cost classification management is?", "cypher": "match (:ENTITY{name:'Cost classification management refers to classifying costs according to their different nature.\u2666'}) <- [:Describe{name:'description'}]- ((x),(x) - [:Relationship{name:'Scope of application'}]->(q) return distinct q.name"}, {"query": "Find 16 books in the Comprehensive Practice Activity Implementation Guide: 5 articles related to case commentary and analysis.", "cypher": "match (n:ENTITY{name:'Integrated practice activities implementation guide: case comments and analysis'}) - [*]->(x) where x.name <>'16' return distinct x.name limit 5"}, {"query": "Do you know what kind of awards the Da Nang City Central Kindergarten, founded in 1985, has won?", "cypher": "match (:ENTITY{name:'Kindergarten in the center of the town of Daegu City was founded in 1985, there are 27 classes, 895 children, 90 teachers...'}) <-[:Describe{name:'description'}]-(p) -[:Relationship{name:'main award'}]->(h) return distinct h.name"}, {"query": "Besides the private website, can you tell me three things you know about SkyTickets Level 2?", "cypher": "match (:ENTITY{name:'space ticketing network'}) - [*1..2]->(p) where p.name <> 'private website' return p.name limit 3"}, {"query": "Help me find 10 species of plants in the genus Arctium.", "cypher": "match (:ENTITY{name:'Key'}) <- [:Relationship{name:'Key'}]-(m) return distinct m.name limit 10"}, {"query": "I need specific information about the International Bridge Art Management class at Shanghai Transport University.", "cypher": "match (:ENTITY{name:' Shanghai Transport University International Bridge Art Management class'}) --(h) return h.name order by h.name"}, {"query": "In which year was the Sendai Foot Secondary School in Tao County founded?", "cypher": "match (:ENTITY{name:'Dao County Senzoku Foot Secondary School'}) <- [:Relationship{name:'Chinese name'}]-(x),(x) - [:Relationship{name:'creation time'}]->(q) return distinct q.name"}, {"query": "What chemical has a molar volume of 104 ((m3/mol) ?", "cypher": "The name of the matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching matching"}, {"query": "Please help me find out what kind of buildings are in the East Wing Gardens.", "cypher": "match (:ENTITY{name:'Tunisia's Garden'}) - [:Relationship{name:'Building type'}]-> (m) with m order by m.name return m.name"}, {"query": "What products are developed by Baidu's Deep Learning Lab?", "cypher": "match (:ENTITY{name:'Baidu Deep Learning Lab'}) <- [:Relationship{name:'Research and development organization'}]- (p) return distinct p.name"}, {"query": "Help me find 10 public colleges for engineering.", "cypher": "match (:ENTITY{name:'public university'}) <- [:Relationship{name:' category'}]-(m), (m) - [:Relationship{name:' school type'}]->(n) where n.name='technology' return distinct m.name limit 10"}, {"query": "Please list the schools and the primary schools that are of the same school type and what are their labels. Please list them in order of number of labels for each school.", "cypher": "match (n:ENTITY{name:'Bean Creek Elementary School'}) - [:Relationship{name:'School type'}]->(:ENTITY) <- [:Relationship{name:'School type'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) BY ORDER c"}, {"query": "I'm wondering which posts have reached 20+ million posts in total?", "cypher": "match (:ENTITY{name:'20 million+'}) <- [:Relationship{name:'total posts'}]- (x) return x.name"}, {"query": "Do you know which channel was chosen for the 1984 Central Television Spring Festival?", "cypher": "match ((:ENTITY{name:'1984 Central Television Spring Festival reunion party'}) - [:Relationship{name:' broadcast channel'}]-> (q) return q.name"}, {"query": "Give me the Nike Zoom Kobe 4,3 in the relationship?", "cypher": "match (n:ENTITY{name:'Nike Zoom Kobe 4'}) - [:Relationship*1..3]->(x) where x.name <>'NIKE' return distinct x.name"}, {"query": "The project is a collaboration between the two artists, who have been working together since the beginning of the project.", "cypher": "match (n:ENTITY{name:'second monkey's mother-in-law and daughter-in-law'}) - [:Relationship*1..3]->(x) where x.name <> '' return distinct x.name"}, {"query": "Please tell me what kind of weapon is the 1975 mm wide?", "cypher": "match (:ENTITY{name:'1975 mm'}) <- [:Relationship{name:'ranking width'}]- (p) return p.name"}, {"query": "I need you to tell me about one type of relationship that is involved in Guangxi Baijian in the 2nd level, okay?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Kangxi Province'}) UNWIND relationships(path) AS rel return distinct rel.name limit 1"}, {"query": "Can you tell me what the scope of application of metal-insulation transformation is?", "cypher": "match (:ENTITY{name:'metal-insulator transformation'}) <- [:Relationship{name:'Chinese name'}]-(h) - [:Relationship{name:'scale of application'}]->(m) return distinct m.name limit 1"}, {"query": "What is the Chinese name of the China Initiative of Social Finance?", "cypher": "match (:ENTITY{name:'China Initiative of Social Finance'}) <- [:Relationship{name:'foreign language name'}]- ((n) - [:Relationship{name:'Chinese language name'}]->(q) return distinct q.name limit 3"}, {"query": "What are the main departments of schools in Harbin, Helangar Province?", "cypher": "match (:ENTITY{name:'Harbin City, Helanggang Province'}) <- [:Relationship{name:'the area'}]-(p),(p) - [:Relationship{name:'the main department'}]->(x) return x.name skip 1 limit 5"}, {"query": "The first book of the series, The Book of the Dead, was published in the United States in the year 2000.", "cypher": "match (:ENTITY{name:'\u90ed\u5b50\u777f'}) <- [:Relationship{name:' alias'}]- ((m) - [:Relationship{name:' main works'}]->(q) return distinct m.name,q.name"}, {"query": "What other career can graduates of the Sichuan Conservatory of Music do besides being an associate professor?", "cypher": "match (:ENTITY{name:'Sian Music College'}) <- [:Relationship{name:'Graduate School'}]-(n),(n) - [:Relationship{name:'Profession'}]->(m) where m.name <> 'professor' return distinct m.name limit 1"}, {"query": "The exhibition has over 800 exhibitors, so what's your name?", "cypher": "match (m:ENTITY{name:'more than 800'}) <- [:Relationship{name:'number of exhibitors'}]- (h) return h.name"}, {"query": "What are the main ingredients in lamb soup and what are the benefits of the supplement?", "cypher": "match (:ENTITY{name:' when classified as lamb's pork'}) - [:Relationship{name:' main ingredient'}]->(n) return n.name as name union all match (:ENTITY{name:' when classified as lamb's pork'}) - [:Relationship{name:' basic characteristics'}]->(m) return m.name as name"}, {"query": "What other position can a politician be in the Standing Committee of the Tianjin Municipal Commission?", "cypher": "match (p:ENTITY{name:'political figure'}) <- [:Tag{name:'tag'}]-(n) - [:Relationship{name:'profession'}]->(m) where m.name <> 'Standing Committee of the Chinese Communist Party of Taiwan' return distinct m.name limit 1"}, {"query": "What wars did the USS Titanic fight?", "cypher": "match (:ENTITY{name:'Turtle cruiser'}) - [:Relationship{name:' achievement'}]-> (m) return distinct m.name"}, {"query": "Do you know anything about the case that happened on August 22, 2015?", "cypher": "match (:ENTITY{name:'August 22, 2015'}) <- [:Relationship{name:'time of occurrence'}]- (m) return distinct m.name"}, {"query": "Who knows the labels for the 10K Cancer Genome Project?", "cypher": "match (:ENTITY{name:'10K cancer genome project'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "Please share all the news about Park Shin-young.", "cypher": "match (:ENTITY{name:'\u6734\u94f6\u82b1'}) --(h) return h.name order by h.name"}, {"query": "Shidu's representative work gave me the top five?", "cypher": "match (:ENTITY{name:'Shidu'}) - [:Relationship{name:'represents work'}]-> (q) with q order by q.name return q.name limit 5"}, {"query": "What do people born in Shinjuku do?", "cypher": "match (:ENTITY{name:'Shinjuku County'}) <- [:Relationship{name:'place of birth'}]-(h),(h) - [:Relationship{name:'profession'}]->(p) return distinct h.name"}, {"query": "When did Lee Hsuo-no die?", "cypher": "match (:ENTITY{name:'Lee Hyo-no'}) <- [:Relationship{name:'deceased celebrity'}]- (p) return distinct p.name"}, {"query": "What is the shortest relationship path between the two levels of Tianjin Sports Academy Sports and Cultural Arts College and Tianjin Foreign Language College and Tianjin Foreign Affairs College?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' Tianjin Sports Academy Sports and Cultural Arts College'}) - [:Relationship*..2]-(b:ENTITY{name:' Tianjin Foreign Language College and School of Foreign Affairs'})) return count ((p)"}, {"query": "What kind of work do people born in Konya Province, Turkey, do?", "cypher": "match (:ENTITY{name:'Konya Province of Turkey'}) <- [:Relationship{name:'place of birth'}]-(n),(n) - [:Relationship{name:'profession'}]->(q) return distinct q.name"}, {"query": "Can you name four brands of medicinal marijuana from South Korea?", "cypher": "match (:ENTITY{name:' Korea'}) <- [:Relationship{name:' origin'}]- (x) return x.name limit 4 This is a list of all the different ways X.name is credited in the database."}, {"query": "Is there a secondary school named Daung?", "cypher": "match (n:ENTITY{name:'Dawson Middle School'}) where n is not null return 1"}, {"query": "I need five footballs, Marcus Coco, and no less than six levels of relationships.", "cypher": "match (n:ENTITY{name:'Marcus Coco'}) - [*1..6]->(x) where x.name <> 'football' return distinct x.name limit 5"}, {"query": "What else do you know about the movie, other than that it was filmed in Mexico?", "cypher": "match (:ENTITY{name:' first drop of blood2'}) - [*1..2]-(p) where p.name <> 'Mexico' return distinct p.name limit 10"}, {"query": "Can you tell me what the attributes of the 299 master's degree institutions are?", "cypher": "The following is a list of the most commonly used tags for the game:"}, {"query": "I need information about the work of Huang Junsuo's Chiang Kai-shek, which is not above two levels of relationship.", "cypher": "match (n:ENTITY{name:'Hu\u95e8\u6625\u8272\u4e4b\u5343\u91d1\u5983'}) - [:Relationship*1..2]->(x) where x.name <>'parenthesis' return distinct x.name"}, {"query": "What kind of projects are supported by the Shanghai Conservatory of Music's Creative Committee?", "cypher": "match (p:ENTITY{name:'Shanghai Conservatory of Music's composition committee special commission'}) <- [:Relationship{name:'project support'}]- (h) return h.name order by h.name"}, {"query": "What is the story of Eugenio Barba?", "cypher": "match (:ENTITY{name:'Eugenio Barba'}) --(n) return distinct n.name"}, {"query": "The school, which was awarded the title of Chongqing City School of Politics and was founded in 2001, lists 10 other awards it has received.", "cypher": "match (:ENTITY{name:'2001'}) <- [:Relationship{name:'time of founding'}]-(q) - [:Relationship{name:'main award'}]->(h) where h.name <> 'Relationship' return distinct h.name limit 10"}, {"query": "What is the name of the dish that is served with the cooked blue fish?", "cypher": "match (:ENTITY{name:'cooking blue fish'}) - [:Relationship{name:'category'}]->(n) return n.name as name union all match (:ENTITY{name:'cooking blue fish'}) - [:Relationship{name:'supplies'}]->(m) return m.name as name"}, {"query": "Can you name a ice race, please?", "cypher": "match (:ENTITY{name:' ice hockey game'}) <- [:Relationship{name:' event type'}]- (p) return p.name"}, {"query": "Can you tell me the geographical location of the Soviet Martyrs' Mausoleum?", "cypher": "match (:ENTITY{name:'Soviet Union Martyrs' Monument'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'Geographical location'}]->(q) return distinct q.name"}, {"query": "Do you know the types of relationships that are involved in the three levels of the middle school in Ji County?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Kongji County Three Secondary School'}) UNWIND relationships(path) AS rel return rel.name limit 5"}, {"query": "Who are the directors and writers of the film in the city and outside?", "cypher": "Match (:ENTITY{name:'Relationship{name:'director'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'screenwriter'}) ->(m) return m.name as name"}, {"query": "Which ships belong to the South China Sea Fleet?", "cypher": "match (:ENTITY{name:'South Sea Fleet'}) <- [:Relationship{name:'Affiliated Fleet'}]- (m) return m.name"}, {"query": "What is the name of a company that makes high-tech websites?", "cypher": "match (:ENTITY{name:'high technology'}) <- [:Relationship{name:'enterprise'}]- (p) return p.name"}, {"query": "Do you know how many actors' names are there? Can you name 11?", "cypher": "match (:ENTITY{name:' actor'}) <- [:Relationship{name:' profession'}]- (p) return p.name limit 11"}, {"query": "The film is 97 minutes long and was produced in which country?", "cypher": "match (:ENTITY{name:'97 minutes'}) <- [:Relationship{name:'long film'}]-(x),(x) - [:Relationship{name:'production area'}]->(m) return distinct m.name limit 5"}, {"query": "Born in July 1987, in addition to his main work Father, he recommended his work to me.", "cypher": "match (:ENTITY{name:'July 1987'}) <- [:Relationship{name:'date of birth'}]-(p),(p) - [:Relationship{name:'main work'}]->(n) where n.name <> 'father' return distinct n.name limit 3"}, {"query": "What do you think of the soul that burns?", "cypher": "match (:ENTITY{name:'soul burn'}) --(m) with m order by m.name return m.name"}, {"query": "Please tell me which works are by the same author as the Fourth and Fourth Quotations, and what labels are on each of them? Please list them in order of number of labels.", "cypher": "match (n:ENTITY{name:'r'}) - [:Relationship{name:'author'}]->(:ENTITY) <- [:Relationship{name:'author'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect ((r.name) ORDER BY c"}, {"query": "I wonder what plants are distributed in Taiwan and the middle provinces of China?", "cypher": "match (:ENTITY{name:' Taiwan and China's middle provinces'}) <- [:Relationship{name:' distribution area'}]- (h) return h.name"}, {"query": "How long is the barrel length of the 1880 mm rear-wheel drive 210 mm cannon in my army?", "cypher": "match ((m:ENTITY{name:'1880 style 210mm rear-mounted steel cannon'}) - [:Relationship{name:'chief'}]-> (x) return x.name"}, {"query": "Can you tell me about this film from the time of the slaughter?", "cypher": "match (:ENTITY{name:' breeding era'}) --(x) return distinct x.name limit 3"}, {"query": "What chemical is EINECS number 204-438-5?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What is the first dish in the world? What are the main ingredients?", "cypher": "match (:ENTITY{name:'Thanks for the link}) - [:Describe{name:'Thanks for the link'}]->(n) return n.name as name union all match (:ENTITY{name:'Thanks for the link'}) - [:Relationship{name:'Thanks for the link'}->(m) return m.name as name"}]