[{"query": "The first is that the government has not been able to disclose the facts of the case.", "cypher": "match (:ENTITY{name:'100 days of variation'}) --(m) with m order by m.name return m.name"}, {"query": "Can you tell me about some sports events and transportation specials started by Xi'an?", "cypher": "match (p:ENTITY{name:'Xian'}) <- [:Relationship{name:'starting point'}]- (q) return distinct q.name"}, {"query": "What games and dramas are in the 18th ban category?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Check out the other 6 stories in this film, Accident on the Mountain Road.", "cypher": "match (:ENTITY{name:'accident on the mountain road'}) - [:Relationship*1..2]-(p) where p.name <> 'film' return p.name limit 6"}, {"query": "The following is a list of the top 10 most popular websites in the world.", "cypher": "match (n:ENTITY{name:'Thank you'}) - [:Relationship*1..2]->(x) where x.name <>'seven-word clause' return distinct x.name"}, {"query": "Help me find 10 species of ants in the family.", "cypher": "match (:ENTITY{name:' umbrella family'}) <- [:Relationship{name:' family'}]-(m) return distinct m.name limit 10"}, {"query": "What chemical is the EINECS number 200-254-4?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "What books are published by China Forestry Press? 2 recommendations?", "cypher": "match (:ENTITY{name:'China Forestry Publishing'}) <- [:Relationship{name:'China Forestry Publishing'}]- (p) return p.name limit 2 The name of the game is the same as the name of the game."}, {"query": "The Chinese graduate from the People's University of China, Le Pen College, is calling out, \"Hello, is there a name for you?\"", "cypher": "match (:ENTITY{name:'People's University of China, Leibniz Academy'}) <- [:Relationship{name:'Graduate School'}]-(n) - [:Relationship{name:'representative work'}]->(m) return distinct n.name, m.name"}, {"query": "What is the shortest path between the airspace station and the spacecraft control system?", "cypher": "match p=shortestpath (((a:ENTITY{name:'airspace control station'}) - [*..2]-(b:ENTITY{name:'spacecraft control system'})) return p"}, {"query": "Chanida Pandey is from which country and what are her works?", "cypher": "match (:ENTITY{name:'Christie's'}) - [:Relationship{name:'nationality'}]->(n) return n.name as name union all match (:ENTITY{name:'Christie's'}) - [:Relationship{name:'represents work'}]->(m) return m.name as name"}, {"query": "What is the most important information about the development of the whole brain in infants and toddlers aged 0 to 10 years?", "cypher": "match (:ENTITY{name:'0-1 years old infant toddler full brain development'}) --(n) with n order by n.name return n.name limit 10"}, {"query": "Can you recommend five novels that are still in print?", "cypher": "match (:ENTITY{name:'linked'}) <- [:Relationship{name:'status'}]- (p) return distinct p.name limit 5"}, {"query": "I'm not sure what companies are based in Shanghai.", "cypher": "match (:ENTITY{name:' Shanghai'}) <- [:Relationship{name:' Headquarters'}]- (h) return distinct h.name"}, {"query": "Please help me find out who wrote the five books on history.", "cypher": "match (:ENTITY{name:'history book'}) <- [*]-(m), (m) - [:Relationship{name:'author'}]->(n) return m.name, n.name limit 5"}, {"query": "Can you list the three types of complex supply ships?", "cypher": "match (:ENTITY{name:'complete supply ship'}) <- [:Relationship{name:'ship type'}]- (h) return h.name limit 3"}, {"query": "Can you list me 10 of the main achievements of this Chinese man?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(p) - [:Relationship{name:'main achievements'}]->(q) return q.name order by q.name limit 10"}, {"query": "I would like to know 5 personal details about footballer Evanilson Lemos da Silva.", "cypher": "match (n:ENTITY{name:'Evanilson Lemos da Silva'}) - [:Relationship*]->(x) where x.name <> 'footballer' return distinct x.name limit 5"}, {"query": "I wonder what Bridget Marquand's work is representative of?", "cypher": "Match (:ENTITY{name:'Brigitte Marquardt, female, born September 25, 1973 in Tillamook, Oregon, USA, American actress and producer\u3002'}) <-[:Describe{name:'description'}]-(h),(h) -[:Relationship{name:'represents work'}]->(x) return distinct x.name"}, {"query": "What are the main awards for this school that is fully public? Can you tell me 10 things?", "cypher": "match (:ENTITY{name:'publicly owned full secondary school'}) <- [:Relationship{name:'category'}]-(n) - [:Relationship{name:'main award'}]->(m) return m.name order by m.name limit 10"}, {"query": "Can you tell me one of the professions of this man?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(h) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 1"}, {"query": "Do you know anyone who is a haematologist who graduated from the same university?", "cypher": "match (:ENTITY{name:' blood pathologist'}) <- [:Relationship{name:' profession'}]- ((m), (m) - [:Relationship{name:' graduate school'}]->(n) where n.name='Hawaiian University' return m.name"}, {"query": "The Eastern Mary's Hospital for Women is a gynecological hospital. What is the description for?", "cypher": "match (:ENTITY{name:'Eastern Mary's Hospital for Women is a women's hospital\u3002'}) <-[:Describe{name:'label'}]-(p) return max(p.name)"}, {"query": "Help me find an encyclopedic plant in the family of the crocuses", "cypher": "match (:ENTITY{name:'Copper'}) <- [:Relationship{name:'Copper'}]-(m), (m) - [:Relationship{name:'Copper'}]->(n) where n.name='Encyclopedia' return distinct m.name"}, {"query": "The most commonly used formulas for this are: \"Shark\" and \"Rice\" and \"Shark\" and \"Shark\" and \"Shark\" and \"Shark\" and \"Shark\" and \"Shark\" and \"Shark\" and \"Shark\".", "cypher": "match (n:ENTITY{name:'mostly'}) -->(h) with h order by h.name where h.name <> 'mostly' and h.name <> 'mostly' return h.name limit 3"}, {"query": "The team that has five Brazilian players in it?", "cypher": "match (:ENTITY{name:'Brazil'}) <- [:Relationship{name:'nationality'}]-(x) - [:Relationship{name:'former team'}]->(q) return q.name order by q.name limit 5"}, {"query": "Can you name a few of the most representative works of the Yantai language?", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'dynasty'}]- ((m) - [:Relationship{name:'represented work'}]->(h) return distinct h.name"}, {"query": "What did you say LTRO was?", "cypher": "match (:ENTITY{name:'LTRO'}) <--(n) return n.name The name of the match is"}, {"query": "I want to send a letter to Shengjun Shi from Nan Yue to Beijing to introduce his work on the two-tier relationship.", "cypher": "match (n:ENTITY{name:' send the teacher from South Yue out into Beijing'}) - [:Relationship*1..2]->(x) where x.name <>'seven rules' return distinct x.name"}, {"query": "What is the name of the Russian minority living in the North Caucasus?", "cypher": "match (:ENTITY{name:'Russian minority'}) <- [:Relationship{name:'nation'}]-(m), (m) - [:Relationship{name:'residence area'}]->(n) where n.name='North Caucasus region' return distinct m.name"}, {"query": "Please list the main achievements of Elisabeth Foster-Nietzsche.", "cypher": "match (:ENTITY{name:'Elizabeth Foster-Nietzsche'}) - [:Relationship{name:' major achievements'}]-> (m) return distinct m.name"}, {"query": "What is the shortest path of connection between the east and west layers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'West'}) - [*..3]-(b:ENTITY{name:'West'})) return count ((p)"}, {"query": "I wonder what the labels are for the computer game category?", "cypher": "match (:ENTITY{name:' computer game'}) <- [:Relationship{name:' classification'}]-(n) - [:Tag{name:' tag'}]->(m) return distinct m.name limit 3"}, {"query": "The restaurant recommends 0048 banana, what is the name of the restaurant?", "cypher": "The game is based on the game of the same name."}, {"query": "I'm going to give you four old plays, who wrote them?", "cypher": "match (:ENTITY{name:'old-fashioned drama'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'writer'}]->(n) return m.name,n.name limit 4"}, {"query": "Please tell me what is his name? Tell me 10 things.", "cypher": "match (:ENTITY{name:'Tang-Tang' ((March 6, 1470 - January 7, 1524), born February 4, early in the sixth year of the Qing Dynasty, and died on December 2, in the second year of the Qing Dynasty."}, {"query": "What other jobs can a Chinese person do besides being a business founder?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(n) - [:Relationship{name:'profession'}]->(h) where h.name <> 'founder of the company' return distinct h.name limit 5"}, {"query": "The snow leopard is a vertebrate, and I have five pieces of information about it in two layers.", "cypher": "match (:ENTITY{name:' snow shadow wolf'}) - [*1..2]-(p) where p.name <> ' vertebrate Armenian' return distinct p.name limit 5"}, {"query": "Please find out if you have more than 14 years of experience in forex gold trading or a 1-4 level relationship with Liu Yue Hua, the best trainer in Forex and Asian Forex Network.", "cypher": "match (n:ENTITY{name:'\u60a6\u534e'}) - [*1..4]->(x) where x.name<>' has over 14 years of experience in foreign exchange gold trading, three consecutive years of CCTV Securities Information Channel special invitation to the wire trader 2007-2009 three consecutive years of CCTV Securities Information Channel, telecommunications broadcasting room, financial channel Xiamen Exchange, Forex.com, Asia FX Network's best trainer."}, {"query": "I want 5 tips on how to play the game within the 2nd level of the Fantastic Four.", "cypher": "match (n:ENTITY{name:'Relationship*1..22]->(x) where x.name <> 'wisdom game' return distinct x.name limit 5"}, {"query": "What is the main department of the Faculty of Physics and Space Sciences at Western Michigan University?", "cypher": "match (:ENTITY{name:'School of Physics and Space Sciences of Western China University of Minsk'}) - [:Relationship{name:'Main Faculty'}]-> (x) return x.name skip 3"}, {"query": "What is the relationship between the second tier label and Mibenbo?", "cypher": "match (n) <- [:Tag*2{name:'tag'}]- ((p:ENTITY{name:'Miiwenbo'}) return distinct n.name"}, {"query": "Can you say that 10 positions are the chairman of the Standing Committee of Dermatology of the Chinese Medical Association?", "cypher": "match (:ENTITY{name:' Chairman of the Standing Committee on Dermatology of the Chinese Medical Association'}) --(x) return distinct x.name limit 10"}, {"query": "When is the last date for the resolution of the 1/8 taxi parked in the Yangon region reported by journalists?", "cypher": "match ((:ENTITY{name:'1\u00b78 Changzhou area taxi parked incident'}) - [:Relationship{name:'resolved date'}]-> (m) return m.name"}, {"query": "What is the abbreviation for internal rate of return?", "cypher": "match (:ENTITY{name:' internal rate of return'}) - [:Relationship{name:' abbreviated '}]->(m) return distinct m.name"}, {"query": "The 1206 studios mentioned in the report belong to which company?", "cypher": "match ((:ENTITY{name:'1206 studio'}) - [:Relationship{name:'belongs to'}]-> (q) return q.name"}, {"query": "How many employees does Sichuan Electrical Co. Ltd. have?", "cypher": "match (:ENTITY{name:' Sichuan Electrical Co. Ltd'}) - [:Relationship{name:' Practitioner'}]-> (m) return distinct m.name"}, {"query": "What is the Chinese name for Candida Albicans?", "cypher": "match (:ENTITY{name:'Candida Albicans'}) <- [:Relationship{name:'English name'}]-(x),(x) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name"}, {"query": "The report was published by the government's official website, the People's Daily.", "cypher": "match (:ENTITY{name:'Zhang Hongyi'}) <- [:Relationship{name:'then mayor'}]- (m) return distinct m.name"}, {"query": "So let's say the prime factor is 7 times 11 times 13.", "cypher": "match (m:ENTITY{name:'7\u00d711\u00d713'}) <- [:Relationship{name:'the prime factor is '}] - (x) return x.name"}, {"query": "How much is the price of a ticket to the White Dragon Mountain?", "cypher": "Match (:ENTITY{name:'Bei Longshan'}) - [:Relationship{name:'Ticket price'}]->(m) return distinct m.name"}, {"query": "What does the flower of the four heads of the flower represent?", "cypher": "match (:ENTITY{name:'the four horsemen'}) - [:Relationship{name:'May'}]-> (m) return m.name"}, {"query": "How about a hundred ways to do something that will fail, have you heard?", "cypher": "match (:ENTITY{name:'100 ways to do exactly what you want to do and it will fail'}) --(q) with q order by q.name return q.name"}, {"query": "What is the number of words in 400,000 words of literature?", "cypher": "The name of the function is the same as the name of the function itself."}, {"query": "What is the shortest path between the middle and the old floors?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'old gutter village'}) - [*..2]-(b:ENTITY{name:'old gutter village'})) return count ((p)"}, {"query": "Can you find me two books on economics published by the Mechanical Industries Publishing House?", "cypher": "match (:ENTITY{name:' publishing house of the mechanical industry'}) <- [:Relationship{name:' publishing house'}]- ((m), (m) - [:Relationship{name:' packaging house'}]->(n) where n.name='packaging house' return m.name limit 3"}, {"query": "Can you tell me the statistics on the number of Chinese teachers?", "cypher": "match (:ENTITY{name:'teacher'}) <--(m), (m) --(n) where n.name='China' return count ((distinct m.name)"}, {"query": "What are the other names of the nine islands?", "cypher": "match (:ENTITY{name:'Nine Chapters Islands'}) <- [:Relationship{name:' geographical location'}]-(m),(m) - [:Relationship{name:' alias'}]->(x) return distinct x.name limit 2"}, {"query": "The most advanced Type 053H frigate in the world today, which country built it?", "cypher": "match ((:ENTITY{name:'053H type frigate'}) - [:Relationship{name:'building nation'}]-> (p) return p.name"}, {"query": "Please tell me what is a weapon with eight bullets for five rounds?", "cypher": "match (p:ENTITY{name:'5 hair'}) <- [:Relationship{name:'capacity'}]- (n) return n.name limit 8"}, {"query": "What was the Roman law?", "cypher": "match (:ENTITY{name:' Roman law [general name of the state of Roman slavery]'}) - [:Relationship{name:' exists in '}]->(m) return distinct m.name"}, {"query": "What songs are on the album Express?", "cypher": "match (:ENTITY{name:'Express'}) <- [:Relationship{name:' album to which belongs'}]- (q) return distinct q.name"}, {"query": "How about 20 comprehensive hospitals?", "cypher": "match (:ENTITY{name:'comprehensive hospital'}) <- [:Relationship{name:'type of hospital'}]->(n) where n is not null return distinct n.name limit 20"}, {"query": "Can you find out 5 facts about Zhang Zhengyi's stage related to Zhang Zhengyi?", "cypher": "match (n:ENTITY{name:'square'}) - [*]->(x) where x.name<>'square' return distinct x.name limit 5"}, {"query": "What was his occupation before he died on March 8, 1958? Name two?", "cypher": "match (:ENTITY{name:'8 March 1958'}) <- [:Relationship{name:'date of death'}]-(h) - [:Relationship{name:'occupation'}]->(p) return distinct p.name limit 2"}, {"query": "What happened at the Malaysian border with Vietnam, 153 nautical miles from the island of Tur-Jung in Zhejiang Province?", "cypher": "match (:ENTITY{name:'153 nautical miles off the coast of the Malay Peninsula, Vietnam, on the island of Tu Jue, Jiangsu Province'}) <- [Relationship{name:'place of occurrence'}]- (q) return distinct q.name"}, {"query": "Do you know the five messages of Serugendo Arafat of Rwanda?", "cypher": "match (n:ENTITY{name:'Serugendo Arafat'}) - [*]->(x) where x.name<>'Rwanda' return distinct x.name limit 5"}, {"query": "Can you name a few players who have been suspended by the league?", "cypher": "match (:ENTITY{name:' middle name'}) <- [:Relationship{name:' executive'}]- ((h) - [:Relationship{name:' alias'}]->(p) return distinct p.name"}, {"query": "He's a very good man, and he's a very good man.", "cypher": "match (:ENTITY{name:' his town'}) --(q) with q order by q.name return q.name limit 5"}, {"query": "I want to know the personal information of a three-tier relationship with a Chinese name Bakagui Iris.", "cypher": "match (n:ENTITY{name:'Bakaragi-Aris'}) - [*1..3]->(x) where x.name <>'s Chinese name' return distinct x.name"}, {"query": "Can you name one model produced by Audi?", "cypher": "match (:ENTITY{name:'Audi'}) <- [:Relationship{name:'production manufacturer'}]- (m) return distinct m.name"}, {"query": "Tell me about the five female professions you know?", "cypher": "match (:ENTITY{name:' female'}) <- [:Relationship{name:' gender'}]-(x) - [:Relationship{name:' profession'}]->(n) return n.name order by n.name limit 5"}, {"query": "Do you know which books are available in the social sciences? Can you name five?", "cypher": "The following is a list of the most commonly used tags for the search terms:"}, {"query": "What exhibitions have you had in Beijing, list 20?", "cypher": "match (:ENTITY{name:'Beijing'}) <- [:Relationship{name:'Exhibition city'}]- (h) return h.name limit 20"}, {"query": "Have you heard about the game, 09 Warren Servant Dress Up in New Dresses, in detail?", "cypher": "match (:ENTITY{name:'09 Warren G. Harding's new dress'}) --(m) with m order by m.name where m.name <> 'game' return m.name"}, {"query": "As the dean of the medical school at Jeju University, can you give us 10 things about his career?", "cypher": "match (:ENTITY{name:'Dean of the Faculty of Medicine, University of Gifu'}) <- [:Relationship{name:'position'}]-(m) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 10"}, {"query": "What are the top five Japanese occupations?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'nationality'}]-(x),(x) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 5"}, {"query": "The poem is written in the fourth level of the relationship between the dog and the Lord.", "cypher": "match (n:ENTITY{name:'10 from poem\u00b7dog from lord'}) - [*1..4]->(x) where x.name <>'poem' return distinct x.name limit 5"}, {"query": "Can you give me five links to the four-tiered relationship of Apsto Julian, born in Galatasaray?", "cypher": "match (n:ENTITY{name:'Aposto Julian'}) - [*1..4]->(x) where x.name<>'Garatz' return distinct x.name limit 5"}, {"query": "How does the school that won the best entrepreneurial design award in Quanzhou set up its main department?", "cypher": "match (:ENTITY{name:'Relationship's Best Design Award for the Springfield Youth'}) <- [Relationship's Best Design Award for the Springfield Youth's Best Design Award]- ((h) - [Relationship's Best Design Award for the Springfield Youth's Best Design Award]-> ((q) return distinct q.name"}, {"query": "The second male protagonist in the Japanese anime anime series SEED, and the sequel to SEED DESTINY, is one of the three main protagonists in the series.", "cypher": "match (:ENTITY{name:'Aslan Zala' ((Athrun Zala), the second main character in the Japanese anime series SEED, and one of the three main characters in the sequel SEED DESTINY."}, {"query": "I'm not sure if you can tell me the inside story of the three-tier relationship between Yuri and Yumi.", "cypher": "match (n:ENTITY{name:'memory\u00b7fifteen six'}) - [*1..3]->(x) where x.name <> 'repeated' return distinct x.name"}, {"query": "What is the name of the castle?", "cypher": "match (n:ENTITY{name:'Castle landscape'}) --(x) return distinct x.name"}, {"query": "Check out the basic relationship of Antoine Lyndon, the football player, level 6 and give me five.", "cypher": "match (n:ENTITY{name:'Antoine Lyndon'}) - [*1..6]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "Can you find me two Hong Kimbo directed TV series and introduce them?", "cypher": "match (:ENTITY{name:'\u6d2a\u91d1\u5b9d'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return m.name,n.name limit 2 The name of the match is not specified in the match description."}, {"query": "Can you please provide 10 pieces of jewelry?", "cypher": "match (:ENTITY{name:'Jane Love* series of letters'}) <- [:Relationship{name:' series'}]- (h) return h.name limit 10"}, {"query": "Can you list the representative works of an actor?", "cypher": "match (:ENTITY{name:' actor'}) <- [:Relationship{name:' profession'}]-(x),(x) - [:Relationship{name:' representing work'}]->(m) return distinct m.name limit 1"}, {"query": "What are the Chinese names of the new series?", "cypher": "match (:ENTITY{name:'borrowing a corpse'}) - (p) with p order by p.name return p.name limit 5"}, {"query": "The film is being distributed by which company and who is the lead actor?", "cypher": "match (x:ENTITY{name:'the red ribbon'}),(x) - [:Relationship{name:'the issuing company'}]-> (m), (x) - [:Relationship{name:'the lead actor'}]->(n) return m.name,n.name"}, {"query": "What are the different labels of people who are the same height as Streutker Jens Jurn?", "cypher": "The following is a list of the most commonly used tags for the game of basketball:"}, {"query": "Can you tell me what is the main achievement of this person born in Jilin City, Jilin Province?", "cypher": "match (:ENTITY{name:'Jilin City'}) <- [:Relationship{name:'Born'}]-(m),(m) - [:Relationship{name:'Major achievement'}]->(x) return x.name skip 2 limit 1"}, {"query": "What about the personal circumstances of Bourhis Jonathan, born in Tours?", "cypher": "match (n:ENTITY{name:'Bourhis Jonathan'}) - [*1..3]->(x) where x.name<>'Tour' return distinct x.name"}, {"query": "What is the meaning of the phrase \"no sun, no moon, no time limit\"?", "cypher": "match (:ENTITY{name:' indicates no date, no time period'}) --(x) return distinct x.name"}, {"query": "Can you recommend a hotel with 7 rooms?", "cypher": "Match (:ENTITY{name:'room'}) <- [:Relationship{name:'room'}]- (n) return n.name limit 7 This is a list of all the different ways The House of the Dead is credited in the database."}, {"query": "Tell me about your understanding of 1-methyltetrahydroceta-5-sulfur.", "cypher": "match (:ENTITY{name:'1-methyl tetrahydro-5-sulphate'}) --(p) with p order by p.name return p.name"}, {"query": "I'm wondering what the criteria are for something with a tensile strength \u2265 550? Can you name one?", "cypher": "match (:ENTITY{name:'\u2265550'}) <- [:Relationship{name:'resistance to pulling'}]-(x),(x) - [:Relationship{name:'standard'}]->(q) return q.name order by q.name limit 1"}, {"query": "How many Japanese have graduated from Kagoshima University?", "cypher": "match (:ENTITY{name:'Kagoshima University'}) <- [:Relationship{name:' Graduate School'}]- (mn) - [:Relationship{name:' Nationality'}]->(n:ENTITY{name:'Japan'}) return mn.name"}, {"query": "The top 10 tags for the 009 Super Rescue?", "cypher": "match (:ENTITY{name:'009 super big rescue'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 10"}, {"query": "Do you know the name of the tournament that will be held from July 16 to July 24?", "cypher": "match (:ENTITY{name:'July 16 to July 24'}) <- [:Relationship{name:'Holding time'}]- (q) return distinct q.name"}, {"query": "He died in 1986 in a car accident in the city of San Francisco, California.", "cypher": "match (:ENTITY{name:'1986'}) <- [:Relationship{name:'date of death'}]-(h),(h) - [:Relationship{name:'profession'}]->(q) where q.name <> 'actor' return distinct q.name limit 5"}, {"query": "Can you analyze the causes of the Russo-Turkish War of 1568 that you learned from your world history lessons?", "cypher": "match ((:ENTITY{name:'1568 Russo-Turkish War'}) - [:Relationship{name:'cause'}]-> (m) return m.name"}, {"query": "In three words, tell me about this man George Orwell.", "cypher": "match (:ENTITY{name:' George Ewell'}) --(h) with h order by h.name return h.name limit 3"}, {"query": "Can you tell me which of the artists' representative works is the first one?", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}]- (m) return distinct m.name limit 3"}, {"query": "I would like to know about the personal situation of Solbakken Staale, who is a football player with no more than six levels of relationships?", "cypher": "match (n:ENTITY{name:'Solbakken Staale'}) - [*1..6]->(x) where x.name <> 'football' return distinct x.name limit 5"}, {"query": "Can you tell me about the profile of Campanella Francesco's relationship with the football player in the second tier?", "cypher": "match (n:ENTITY{name:'Campanella Francesco'}) - [*1..2]->(x) where x.name <> 'football' return distinct x.name"}, {"query": "Can you tell me the English name of the fox subject, \"Fox\"?", "cypher": "match (:ENTITY{name:'fox'}) <- [:Relationship{name:'\u5c5e'}]-(q) - [:Relationship{name:'English name'}]->(p) return distinct p.name limit 1"}, {"query": "The following is a list of the top three links in Shinko Yao's relationship with Shinzo Abe:", "cypher": "match (n:ENTITY{name:'sinkyoo'}) - [:Relationship*1..2]->(x) where x.name <>'finished' return distinct x.name"}, {"query": "What is the reality show produced by HKTVB besides a suspicious romance?", "cypher": "match (:ENTITY{name:'HKTVB'}) <- [:Relationship{name:'production company'}]-(m) where m.name <> 'suspicious affair' return distinct m.name"}, {"query": "Can you explain in one sentence 0792?", "cypher": "match (:ENTITY{name:'0792'}) --(h) with h order by h.name return h.name limit 1"}, {"query": "I have a problem finding three Lin Min-shui non-citizens with relevant information about China.", "cypher": "match (:ENTITY{name:'\u6797\u68a6\u6cc9'}) --(m) with m order by m.name where m.name <> 'China' return distinct m.name limit 3"}, {"query": "What are the main ingredients and ingredients of silk powder?", "cypher": "match (:ENTITY{name:' silk powder'}) - [:Relationship{name:' main ingredient'}]->(n) return n.name as name union all match (:ENTITY{name:' silk powder'}) - [:Relationship{name:' accessory'}]->(m) return m.name as name"}, {"query": "What songs are full of lyrics in Chinese?", "cypher": "match (:ENTITY{name:' in Chinese'}) <- [:Relationship{name:' fill-in'}]-(p) - [:Relationship{name:' in Chinese name'}]->(n) return distinct n.name"}, {"query": "I'm wondering if you know who the founder of the company that is part of the Roman.Quint group is?", "cypher": "match (:ENTITY{name:'Roman.Quinn Group'}) <-[:Relationship{name:' company'}]-(h),(h) -[:Relationship{name:' founder'}]->(x) return x.name order by x.name limit 1"}, {"query": "Can you tell me about the type of relationship that is contained in the three-story luxury apartment in Chambly?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Luxury Apartments in Chambly'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "The administrative district of the town is 88.1 square kilometers, how much more can it be? I want to know 3 types.", "cypher": "match (:ENTITY{name:'\u4e61'}) <- [:Relationship{name:'administrative district category'}]-(x),(x) - [:Relationship{name:'area'}]->(n) where n.name <> '88.1 sq km' return distinct n.name limit 3"}, {"query": "Can you name three substances that are insoluble in water?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Please tell me one Himesh Reshammiya's profession.", "cypher": "match (:ENTITY{name:'Himesh Reshammiya'}) - [:Relationship{name:'profession'}]-> (m) return distinct m.name limit 1"}, {"query": "What else does an actor in the Golden Bull of the Cassanova Cave represent besides this one?", "cypher": "match (:ENTITY{name:'Taurus'}) <- [:Relationship{name:'Star'}]-(h) - [:Relationship{name:'represented works'}]->(p) where p.name <> 'Cassano Ruins' return distinct p.name limit 10"}, {"query": "The five other functions of the Pyongyang County Development and Reform Bureau that are not strategic in terms of social development are given.", "cypher": "match (:ENTITY{name:'Pyongyang County Development and Reform Bureau'}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'functions'}]->(x) where x.name <> 'strategic in social development' return distinct x.name limit 5"}, {"query": "Do you know which case was the subject of the arrest operation on the night of September 8, 1996?", "cypher": "match (:ENTITY{name:'September 8, 1996 at night'}) <- [:Relationship{name:'capture time'}]- (x) return distinct x.name"}, {"query": "What was the occupation of the person who died in 1370?", "cypher": "match (:ENTITY{name:'1370'}) <- [:Relationship{name:'date of death'}]-(m),(m) - [:Relationship{name:'occupation'}]->(h) return distinct h.name"}, {"query": "Do you know what is nicknamed sulfur diethylamide?", "cypher": "match (n:ENTITY{name:'Sulfur dioxide diethylamide'}) - [:Relationship{name:' alias'}]-> (h) return distinct h.name"}, {"query": "Can you tell me about the type of relationship that is contained in the nine villages in the five levels?", "cypher": "match path=(n) <- [:Relationship*5]-(p:ENTITY{name:'\u4e5d\u53e3\u6751'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What are the most representative works of Mongolian writers? Can you list five?", "cypher": "match (:ENTITY{name:'Mongolian'}) <- [:Relationship{name:'ethnicity'}]-(m),(m) - [:Relationship{name:'representative work'}]->(h) return distinct h.name limit 5"}, {"query": "What is the most recent relationship between Step Up K208 and Step Up K128?", "cypher": "match?p=shortestpath (((a:ENTITY{name:'step by step K208'}) - [r:Relationship]-(b:ENTITY{name:'step by step K128'}))?return?count(p)"}, {"query": "Who is the founder of Hangzhou Hong Kong Enterprise Management Limited?", "cypher": "match (:ENTITY{name:'Hangzhou Huangkang Enterprise Management Limited'}) - [:Relationship{name:'founder'}]-> (q) return q.name skip 1"}, {"query": "Can you tell me how you feel?", "cypher": "match (:ENTITY{name:'Thank you'}) --(h) return h.name order by h.name"}, {"query": "What is the name of the tree?", "cypher": "match (:ENTITY{name:'Dawgwood'}) - [:Relationship{name:'door'}]->(n) return n.name as name union all match (:ENTITY{name:'Dawgwood'}) - [:Relationship{name:'program'}]->(m) return m.name as name"}, {"query": "Who is Lu Zhizheng's son? What are his main achievements? Can you name three?", "cypher": "match (:ENTITY{name:'lu\u5c55\u5f15'}) <- [:Relationship{name:'son'}]-(p),(p) - [:Relationship{name:'main achievement'}]->(q) return q.name order by q.name limit 3"}, {"query": "The following is a list of all the resources for Lake Okeechobee, a flat-topped mountain with a subtropical monsoon climate.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name<>'Subtropical monsoon climate' return distinct x.name"}, {"query": "Do you know the types of relationships in Li Fang Village that are involved in the three levels?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'\u793c\u82b3\u6751'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 1 This is a list of all the different ways REL is credited in the database."}, {"query": "I would like to know the other 4 information in the 2nd level of this game.", "cypher": "match (:ENTITY{name:'Relationship*1..2]-(p) where p.name <> 'game' return p.name limit 4"}, {"query": "What is the difference between indisputable near and anti-near?", "cypher": "match (:ENTITY{name:'undoubtedly'}) - [:Relationship{name:'near term'}]->(n) return n.name as name union all match (:ENTITY{name:'undoubtedly'}) - [:Relationship{name:'undoubtedly'}]->(m) return m.name as name"}]