[{"query": "Can you name 10 of the major awards this Brazilian has won?", "cypher": "match (:ENTITY{name:'Brazil'}) <- [:Relationship{name:'nationality'}]-(h),(h) - [:Relationship{name:'main prize'}]->(m) return m.name skip 1 limit 10"}, {"query": "What is the shortest distance between the Shaanxi Province branch of China Construction Bank and Qingdao City branch of China Construction Bank within the two levels?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'China Construction Bank Shanxi Province Branch'}) - [*..2]-(b:ENTITY{name:'China Construction Bank Qingdao City Branch'})) return count ((p)"}, {"query": "What is the story of the reign of Inchon?", "cypher": "Match (:ENTITY{name:'Inherent'}) - [:Tag{name:'tag'}]->(n) return n.name The name of the game is not shown."}, {"query": "Do you have anything for $44.5?", "cypher": "match (:ENTITY{name:'44.5 yuan'}) <--(n) return n.name The name of the match is"}, {"query": "Do you know who the representative of the first 10 best works of art is?", "cypher": "match (p:ENTITY{name:'Relationship{name:'represents work'}) - (x) return x.name order by x.name limit 10"}, {"query": "What is the chemical formula of sodium perchlorate in the many different information?", "cypher": "match ((:ENTITY{name:'sodium nitrate'}) - [:Relationship{name:' chemical formula'}]-> (p) return p.name"}, {"query": "The Shijiazhuang City Council is a social group organization that was founded on December 6, 2011. I would like to know more about the Council, find out and tell me.", "cypher": "match (n:ENTITY{name:'Kazakhstan City Chamber of Commerce'}) -->(h) with h order by h.name where h.name <> '2011/12/16' and h.name <> 'social group organization' return h.name limit 6"}, {"query": "Can you tell me about some of the professions that Paulo Melo has?", "cypher": "match (:ENTITY{name:'Paulo Melo'}) - [:Relationship{name:'profession'}]-> (m) return m.name order by m.name"}, {"query": "The two-tiered relationship between the two is related to the rainfall in the late afternoon in Denpo.", "cypher": "match (n:ENTITY{name:' night in the heart of the city's rain'}) - [*1..2]->(x) where x.name <>'\u4e07\u91cc' return distinct x.name"}, {"query": "Help me find two long novels by Yu Hua.", "cypher": "match (:ENTITY{name:'\u4f59\u534e'}) <- [:Relationship{name:'author'}]-(m), (m) - [:Relationship{name:'literary genre'}]->(n) where n.name='long novel' return distinct m.name limit 2"}, {"query": "What are the main achievements of people born in December 1961?", "cypher": "match (:ENTITY{name:'December 1961'}) <- [:Relationship{name:'date of birth'}]- ((q) - [:Relationship{name:'main achievements'}]->(p) return distinct p.name limit 3"}, {"query": "I want to know who is related to the 4th level of the tag?", "cypher": "The following is a list of the most commonly used tags in the search results."}, {"query": "I want to be a Wuhan University graduate with major achievements.", "cypher": "match (:ENTITY{name:'Wuhan University'}) <- [:Relationship{name:' Graduate School'}]- ((m) - [:Relationship{name:' Major achievements'}]->(x) return distinct x.name limit 1"}, {"query": "Do you know how many hotlines the Ministry of Health has set up?", "cypher": "match (:ENTITY{name:' Ministry of Health'}) <- [:Relationship{name:' established'}]- (q) return distinct q.name"}, {"query": "Can you list the 10 types of phones that were launched in October 2010?", "cypher": "match (:ENTITY{name:'October 2010'}) <- [:Relationship{name:' time of launch'}]-(n) - [:Relationship{name:' type of mobile phone'}]->(x) return distinct x.name limit 10"}, {"query": "Can you tell me about the types of relationships that are involved in the three layers of the classic romance novel?", "cypher": "Match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'European and American classic romance novel selection'}) UNWIND relationships(path) AS rel return distinct rel.name limit 1"}, {"query": "Can you name three representative works by Carlo Montuori?", "cypher": "match (:ENTITY{name:'Carlo Montuori'}) - [:Relationship{name:'represents work'}]-> (p) return distinct p.name limit 3"}, {"query": "Do you know of any exhibitions in the building materials category?", "cypher": "match (:ENTITY{name:' building materials'}) <- [:Relationship{name:' industry'}]- (m) return m.name limit 5"}, {"query": "Could you tell me which year Barzak wrote Eurythmics?", "cypher": "match (:ENTITY{name:'Barzakh written as Euryne Gruntai'}) <- [:Relationship{name:'Great note'}]- (x) return distinct x.name"}, {"query": "Do you have any information about the inner ties between the two groups involved in the village of Dodo?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations"}, {"query": "I know that the term rural water technology is a 200 page book published by Shanghai Cultural Press, please give me 7 more details.", "cypher": "match (n:ENTITY{name:'Rural water technology terms'}) -->(h) with h order by h.name where h.name <> '200 pages' and h.name <> 'Shanghai Cultural Press' return h.name limit 7"}, {"query": "What are the films Jacqueline Caut has been involved in writing? Can you name 10?", "cypher": "match (:ENTITY{name:'Jacqueline Caut'}) --(x) return distinct x.name limit 10"}, {"query": "Five descriptions of the 11/5 murder of his wife in Harbin?", "cypher": "match (:ENTITY{name:'11.5 Harbin City Wife Murder Case'}) --(x) with x order by x.name return distinct x.name skip 1 limit 5"}, {"query": "What is the name of the gaming platform released by Chintoo Traveller Cyber Technology Co., Ltd.?", "cypher": "match (:ENTITY{name:'Chingdu Yinyue Network Technology Co. Ltd'}) <- [:Relationship{name:'developer'}]-(x),(x) - [:Relationship{name:'game platform'}]->(q) return distinct q.name"}, {"query": "Who is the current winner of the AFC Asian Cup?", "cypher": "Match (:ENTITY{name:'AFCON Cup'}) - [:Relationship{name:'Current champion'}]->(n) return n.name"}, {"query": "Do you know anything else about Chinese mushrooms besides plants? Help me find 4 information in 2 layers.", "cypher": "match (:ENTITY{name:' Chinese mushroom'}) - [*1..2]-(p) where p.name <> 'plant' return p.name limit 4"}, {"query": "The three alumni of the Beijing Municipal Committee of the Party School, where are they all from?", "cypher": "match (:ENTITY{name:'Peking City Committee Party School'}) <- [*]-(m),(m) - [:Relationship{name:'Born'}]->(n) return m.name,n.name limit 3"}, {"query": "Manipulating the [2017 SBS Korean TV series] Do you know the time of the TV series?", "cypher": "Match ((:ENTITY{name:' Manipulating [2017 SBS production Korean television series]'}) - [:Relationship{name:' Production time'}]-> (n) return n.name"}, {"query": "I want all the information from Sun Qin [professor at the People's University of China].", "cypher": "match (:ENTITY{name:'Sun Gen [Professor at the People's University of China]'}) --(m) return m.name order by m.name"}, {"query": "You mentioned the other six information in the four layers of the book, which is published by Tsinghua University Press.", "cypher": "match (:ENTITY{name:'Communication principles for learning'}) - [*1..4]-(p) where p.name <> 'Chinghua University Press' return distinct p.name limit 6"}, {"query": "I'm going to label a 3mm remix for...", "cypher": "match (:ENTITY{name:'...3mm remix'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "Please tell me 10 names of films that are about surveillance and surveillance.", "cypher": "match (:ENTITY{name:' daylight tracking, surveillance mission'}) --(m) return distinct m.name limit 10"}, {"query": "The first is the \"How to make 10 women\" by Peter Lindberg.", "cypher": "match (:ENTITY{name:'10 WOMEN BY PETER LINDBERGH'}) --(x) with x order by x.name return x.name skip 1 limit 10"}, {"query": "Tell me about the first three things you said about being intimate with your mother.", "cypher": "match (:ENTITY{name:' close as a feather'}) --(p) return p.name order by p.name limit 3"}, {"query": "Do you know which concert started on November 25, 2012?", "cypher": "match (:ENTITY{name:'25 November 2012'}) <- [:Relationship{name:'time of the concert'}]- (x) return x.name"}, {"query": "Do you know what event was held on November 10, 2013?", "cypher": "match (:ENTITY{name:'November 10, 2013'}) <- [:Relationship{name:' date of holding'}]- (n) return distinct n.name"}, {"query": "Help me find 10 water sports projects", "cypher": "match (:ENTITY{name:'swimming'}) <- [:Tag{name:'tag'}]-(m), (m) - [:Tag{name:'tag'}]->(n) where n.name='sports project' return m.name limit 10"}, {"query": "Please tell me which scam happened in April 2017?", "cypher": "match (:ENTITY{name:'April 2017'}) <- [:Relationship{name:'time of occurrence'}]- (x) return distinct x.name"}, {"query": "What else can be labeled with 45 degrees of low temperature lubricant with scientific labeling?", "cypher": "match (:ENTITY{name:'-45 degree cold-pressure lubricant'}) - [:Tag{name:'label'}]-> (h) with h order by h.name where h.name <> 'science' return h.name"}, {"query": "What do you know about this book? Help me find the other four in the 2nd layer.", "cypher": "match (:ENTITY{name:'Relationship*1..2]-(p) where p.name <> 'books' return p.name limit 4"}, {"query": "What is the shortest relationship path between the two layers of film common alert and murder memory?", "cypher": "Match p=allshortestpaths (((a:ENTITY{name:'Common Guard Area [2000 Korean film directed by Park Chan-young]'}) - [*..2]-(b:ENTITY{name:'Murder Memories [Korean 2003 film directed by Jun Jun-ho]'})) return count ((p))"}, {"query": "Tell me what the ticketing campaign ended on March 3, 2016 was?", "cypher": "match (:ENTITY{name:'March 3, 2016) <- [:Relationship{name:'end time'}]- (x) return distinct x.name"}, {"query": "What is the shortest path between the two levels of Taiyanlu Village and Muhu Mountain Village?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Tanyagu'}) -[:Relationship*..2]-(b:ENTITY{name:'Tanyagu'})) return count ((p)"}, {"query": "Can you tell me about a career that is rooted in war?", "cypher": "match (:ENTITY{name:'war month source'}) - [:Relationship{name:'profession'}]-> (n) return distinct n.name limit 1"}, {"query": "The student of the school, the editor of the literature of the county of Zhizheng, whose son Yang Yan inherited a collection of young acorns, you know who this person is, what is his name?", "cypher": "match (q:ENTITY{name:'(16011681), a student of the University of Tokyo, who is the editor-in-chief of the Qing Dynasty's Zhijiang, whose son, Yang Yan, inherited the Zheng Qing Quong Collection of Zheng He."}, {"query": "What is the Chinese name of the novel that is being published in the Clouds Book City?", "cypher": "match (:ENTITY{name:'cloud city'}) <- [:Relationship{name:'linked website'}]-(h),(h) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 5"}, {"query": "Do you know what company Nana's Green Tea is?", "cypher": "match (q:ENTITY{name:'nanas green tea'}) <- [:Relationship{name:'foreign name'}]- (n) return n.name"}, {"query": "Can you name five professions that this French national has?", "cypher": "match (:ENTITY{name:' France'}) <- [:Relationship{name:' nationality'}]-(h),(h) - [:Relationship{name:' profession'}]->(m) return m.name skip 2 limit 5"}, {"query": "Tell me about two new things about Apple besides the industry?", "cypher": "match (:ENTITY{name:'sweatbox'}) --(m) with m order by m.name where m.name <> 'industry figure' return distinct m.name limit 2"}, {"query": "Question 1-What is the chemical name of cyclopropylcarbonylpiperazine in Chinese?", "cypher": "The name of the drug is \"Piperazine\" (Piperazine)"}, {"query": "Do you know the founders of the eSports Association of the same city?", "cypher": "match (:ENTITY{name:'The City of Toronto's Electronic Sports Association'}) - [:Relationship{name:'Founder'}]-> (n) return n.name order by n.name limit 10"}, {"query": "Can you tell us about the types of relationships involved in the four layers of Linguistics?", "cypher": "The following pages link to the list of links in the list of links in the list of links:"}, {"query": "What is the shortest distance between the 4th hospital in Langsha and the 2nd floor of the 1st hospital in Langsha?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Fourth Hospital of Changsha City'}) - [*..2]-(b:ENTITY{name:'First Hospital of Changsha City'})) return count ((p)"}, {"query": "Is the Tai Chi chicken unique to China? Where is it mainly distributed?", "cypher": "match (:ENTITY{name:'Relationship{name:'Is China exclusive'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'Distributed area'}) ->(m) return m.name as name"}, {"query": "Please tell me which one of these works is from Domi?", "cypher": "match (:ENTITY{name:'honey'}) --(x) return x.name order by x.name limit 5"}, {"query": "Do you know what chemical has CAS number 6261-22-9?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "I want to publish the other 8 pieces of information in the 3 layers of this book, which was designed by an electronic filter in 2008.", "cypher": "match (:ENTITY{name:' design of electronic filter'}) - [*1..3]-(p) where p.name <> '2008/9/1' return distinct p.name limit 8"}, {"query": "Can you tell me about the 10/27 roof collapse in Baghdad, Afghanistan?", "cypher": "match (:ENTITY{name:'10\u00b727 Afghanistan Baghlan Province roof collapse'}) --(x) with x order by x.name return x.name"}, {"query": "Where is the location of the 2013 China International Hardware Tools Expo in Tianjin?", "cypher": "match ((p:ENTITY{name:'2013 China International Hardware Tools [Tianjin] Exhibition'}) - [:Relationship{name:' Exhibition location'}]-> (n) return n.name"}, {"query": "What are the medicinal uses of rosehip oil and what are the conditions for which it is used?", "cypher": "match (:ENTITY{name:'pure red flower oil'}) - [:Relationship{name:'type of drug'}]->(n) return n.name as name union all match (:ENTITY{name:'pure red flower oil'}) - [:Relationship{name:'use classification'}]->(m) return m.name as name"}, {"query": "Do you know which novel is in progress of being republished?", "cypher": "match (:ENTITY{name:' in the continuation of the update) }) <- [:Relationship{name:' progress'}]- (n) return n.name"}, {"query": "What are the main achievements of this doctor of law? Can you tell me 10?", "cypher": "match (p:ENTITY{name:'Doctor of Law'}) <- [:Relationship{name:'academic'}]-(x),(x) - [:Relationship{name:'main achievement'}]->(m) return m.name order by m.name limit 10"}, {"query": "Can you list the types of relationships that the Horan Belturi River is involved in in the three layers?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations)"}, {"query": "I want to produce the UK coffin stone and the other 6 pieces of information in the 3rd layer of this thriller.", "cypher": "match (:ENTITY{name:' coffin stone'}) - [*1..3]-(p) where p.name <> 'UK' return distinct p.name limit 6"}, {"query": "Check the following ISBN numbers 7232313013, 9787232313012 for relevant information within the two-layer relationship of mine drainage pressure reduction safe mining technology?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'7232313013, 9787232313012' return distinct x.name"}, {"query": "Do you know how many car shows there are?", "cypher": "match (:ENTITY{name:' car class'}) <- [:Relationship{name:' exhibition category'}]- (m) return m.name limit 3"}, {"query": "What is the Chinese name of the set of cards with the silver letter R and the flashing face SR?", "cypher": "match (q:ENTITY{name:' silver R, face blinking SR'}) <- [:Relationship{name:' rarity'}]-(h),(h) - [:Relationship{name:' Chinese name'}]->(p) return distinct h.name limit 10"}, {"query": "The following is a list of the main achievements of the Yusof Yan family:", "cypher": "match (:ENTITY{name:'\u8bb8\u751f'}) <- [:Relationship{name:'Chinese name'}]- ((q),(q) - [:Relationship{name:'main achievement'}]->(m) return distinct q.name"}, {"query": "Is there such a thing as a circulatory system?", "cypher": "match (n:ENTITY{name:'Hydrate-containing circulator'}) where n is not null return 1"}, {"query": "What are the main achievements of the people who are born in Taurus?", "cypher": "match (:ENTITY{name:'Taurus'}) <- [:Relationship{name:'star'}]-(p),(p) - [:Relationship{name:'main achievement'}]->(m) return distinct m.name limit 1"}, {"query": "Do 007 movies have nicknames?", "cypher": "match (:ENTITY{name:'007[UK series of action films]'}) - [:Relationship{name:'alias'}]-> (p) with p order by p.name return p.name"}, {"query": "Can you help me find out 10 things about Chen Ji, the national-level actor in two-tier relationships, other than the representative work of Liu Xiaobo?", "cypher": "match (:ENTITY{name:' Chen Chi[national first-class actor]'}) - [*1..2]->(p) where p.name <> 'Jinghua' return distinct p.name order by p.name DESC limit 10"}, {"query": "Can you please tell me about the top 10 amateur sports schools for teenagers in the Shijiazhuang Mountain area of Beijing?", "cypher": "match (:ENTITY{name:'Beijing City, Shijiazhuang Mountain Area Junior Children's Amateur Sports School'}) --(p) return p.name order by p.name limit 10"}, {"query": "Please tell me what is http://www.17k.com/?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Find out what labels the four lovers at the end of time own, but other than film and entertainment?", "cypher": "match (n:ENTITY{name:'the lover at the end of time [American film]'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'film work' and h.name <> 'entertainment work' return distinct h.name limit 4"}, {"query": "Do you know what mobile games are? How much memory do these games have in general? Give me five.", "cypher": "match (:ENTITY{name:'mobile game'}) <- [:Tag{name:'tag'}]-(h),(h) - [:Relationship{name:'software size'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Can you tell me where you were born and what you do?", "cypher": "match (x:ENTITY{name:' yellow source photo'}),(x) - [:Relationship{name:' place of birth'}]-> (m), (x) - [:Relationship{name:' profession'}]->(n) return m.name,n.name"}, {"query": "Which animals belong to the canine family? Find out 5 animals.", "cypher": "match (:ENTITY{name:'dog family'}) <--(m), (m) - [:Relationship{name:'dog family'}]->(n) return distinct m.name limit 5"}, {"query": "The Chinese name for the country is not more than 10 words?", "cypher": "match (:ENTITY{name:'Relationship{name:'Chinese name'}]-> (m) with m order by m.name return m.name limit 10"}, {"query": "Can you find me two books published by Zeru Books?", "cypher": "match (:ENTITY{name:'Ziru Book Company'}) <- [:Relationship{name:'Publishing Company'}]- ((n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 2"}, {"query": "The 14th secondary school in Victory, East Kampong, formerly known as Victory Oilfield, has won what awards?", "cypher": "match (:ENTITY{name:'Tripoli East Camp City Fourteenth Secondary School' originally known as Tripoli Oilfield Fourteenth Secondary School, started in 1973 and merged into the Sixty-second Secondary School in Tripoli in 2007\u3002'}) <-[:Describe{name:'Description'}]-(q),(q)-[:Relationship{name:'Main Award'}]->(m) return distinct m.name limit 5"}, {"query": "What is the name of the incident where the last mobster was killed?", "cypher": "match (:ENTITY{name:'Rought out by the mob'}) <- [:Relationship{name:'consequences'}]- (h) return h.name"}, {"query": "Tell me about the 0377 auction site you know of?", "cypher": "match (:ENTITY{name:'0377}) --(x) with x order by x.name where x.name <> 'website' return x.name"}, {"query": "Please help me find information on the publications on guidelines for further budget implementation of the project, which are not more than five levels of relations.", "cypher": "match (n:ENTITY{name:'Guidelines on further improvement of budget execution'}) - [*1..5]->(x) where x.name<>'China' return distinct x.name"}, {"query": "What is the shortest path between the two layers of the forest and the oak tree?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortestpaths'}) - [*..2]-(b:ENTITY{name:'shortestpaths'})) return count ((p)"}, {"query": "Who has a female police officer in the public security?", "cypher": "match (:ENTITY{name:'Public security officer'}) <--(n) return n.name"}, {"query": "Do you know of any awards that have a public benefit award in their name?", "cypher": "match (:ENTITY{name:'1 item'}) <- [:Relationship{name:'public benefit award'}]- (h) return h.name"}, {"query": "I would like to know the name of the person and the main works of the author.", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship's name:'at the time'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship's name:'name:'word'}->(m) return m.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship's name:'main works'}->(r) return r.name as name"}, {"query": "Do you know which government agencies are in the city of Xiamen?", "cypher": "match (q:ENTITY{name:'Palestine'}) <- [:Relationship{name:'located area'}]- (m) return distinct m.name"}, {"query": "Help me find three representative works of art by Ryu Yayoi", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}]-> (m) return distinct m.name limit 3"}, {"query": "What works of 17K novels are online? Please tell me five.", "cypher": "match (:ENTITY{name:'17K novel network'}) <--(n) return n.name limit 5"}, {"query": "What are the famous sights in the Peninsula?", "cypher": "match (:ENTITY{name:'Relationship{name:'Famous attractions'}]->(m) return distinct m.name"}, {"query": "Please help me find out how many people are currently employed at the Qinghai Oil Field Exploration and Development Institute.", "cypher": "match (:ENTITY{name:'Katyung Oilfield Exploration and Development Institute'}) - [:Relationship{name:' Existing staff'}]-> (m) return distinct m.name"}, {"query": "Is it good to talk about the five states?", "cypher": "match (:ENTITY{name:'Land of the Midnight'}) --(m) return distinct m.name limit 5"}, {"query": "I found a horror camera in the old town of Upper Riyadh, directed by Li Qingshi, and you can find three more and give me the information.", "cypher": "match (n:ENTITY{name:'terrorist camera'}) -->(h) with h order by h.name where h.name <> 'Li Qing City' return h.name limit 3"}, {"query": "I'm looking for a public secondary school in Xi'an.", "cypher": "match (:ENTITY{name:'China Xian City, Xinjiang Province'}) <- [:Relationship{name:'area'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='public secondary school' return distinct m.name"}, {"query": "I need to know about the six types of perverted sweetness that are not entertainment.", "cypher": "match (:ENTITY{name:'perverse sweetness'}) --(m) with m order by m.name where m.name <> 'entertainment work' return distinct m.name limit 6"}, {"query": "Please help me find the year 1872 and who is not a librarian, and which three other professions were born in that year.", "cypher": "match (:ENTITY{name:'1872-'}) <- [:Relationship{name:'date of birth'}]-(h) - [:Relationship{name:'profession'}]->(q) where q.name <> 'Tibetanist' return distinct q.name limit 3"}, {"query": "Can you introduce me to books priced at $31.00 on both sides?", "cypher": "match (:ENTITY{name:'31.00\u5143'}) <- [:Relationship{name:' priced'}]- ((x),(x) - [:Relationship{name:' book name'}]->(q) return distinct q.name"}, {"query": "I want a Han Chinese and her corresponding job title, give me ten pairs?", "cypher": "match (m:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]- ((q) - [:Relationship{name:'profession'}]->(p) return distinct q.name,p.name limit 10"}, {"query": "I want to know four messages from the two layers of the person who is not a politician.", "cypher": "match (:ENTITY{name:'spoiler'}) - [*1..2]-(p) where p.name <> 'politician' return p.name limit 4"}, {"query": "I don't know the molecular formula of 2-acetylbiphenyl, so I can't calculate its molecular weight, can you tell me directly what its molecular weight is?", "cypher": "match ((:ENTITY{name:'2-ethyl bicarbonate'}) - [:Relationship{name:'molecular mass'}]-> (x) return x.name"}, {"query": "What is the shortest relationship path between a Taoist monk and a Chinese hero in the two layers?", "cypher": "Match p=allshortestpaths (((a:ENTITY{name:'Taedongsan Master's[1997 film directed by Liu Jingming, starring Liu Yi Min]'}) - [*..2]-(b:ENTITY{name:'Chinese Hero's[1999 film directed by Liu Weiqiang]'})) return count ((p))"}, {"query": "List seven political and military books and their authors.", "cypher": "match (:ENTITY{name:'political and military books'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'author'}]->(n) return m.name,n.name limit 7"}, {"query": "Do you know any famous alumni of the Higher Technical School of Railway Police in Yangzhou?", "cypher": "match (:ENTITY{name:'Relationship{name:'known alumni'}}-> (m) return m.name skip 2"}, {"query": "Can you name 10 schools that have won the provincial normative school's main award?", "cypher": "match (:ENTITY{name:' Provincial normative school'}) <- [:Relationship{name:' major award'}]- (q) return distinct q.name limit 10"}, {"query": "Can you tell me about the main achievements of the actresses and models?", "cypher": "match (:ENTITY{name:'childstar, childmodel'}) <- [:Relationship{name:'profession'}]- ((h) - [:Relationship{name:'main achievement'}]->(m) return distinct m.name"}, {"query": "I am a child of the age of 0-3 years, and I am very interested in learning about the health and care of children.", "cypher": "match (:ENTITY{name:'0-3 years old children's health and care'}) --(q) with q order by q.name return q.name limit 1"}, {"query": "Do you know of any relationship types that are named within the two layers that security guard Jamie McDonnell is involved in?", "cypher": "The following is a list of characters that appear in the game The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of Zelda: Breath of the Wild is a game that is played from the perspective of a human."}, {"query": "How to find out the content of the poem in the two-layer relationship between Chen's poem \"The Pond of Green Spring Grass\" and \"The Poetry of Chen's Poetry\".", "cypher": "match (n:ENTITY{name:'Give me the pond of green spring grass [a Chen Tao poem]'}) - [:Relationship*1..3]->(x) where x.name <>'Chen Qu' return distinct x.name"}, {"query": "Do you know which book has the barcode 9787111350873?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "The place is located on the northwest bank of the river, at the foot of the northern mountain in the Yangtze Mountains, and has a three-sided independent mountain town surrounded by water, which is the scenic and historic old town of Kyungkyu.", "cypher": "match (:ENTITY{name:' is a three-sided independent mountain town located at the northwest bank of the Yangtze River, at the foot of the North Mountain in the Yangtze Mountains, which is a scenic, historic city known as the Kyuk-kyu Creek Guard City .'})"}, {"query": "I wonder what Fan Sun-soo is doing? Can you tell me?", "cypher": "match (n:ENTITY{name:'fan shui'}) <- [:Relationship{name:'Chinese name'}]- ((x) - [:Relationship{name:'profession'}]->(q) return distinct q.name"}, {"query": "The other 6 information provided to me in the Panasonic TH-42PZ800C2 layer of the Panasonic series.", "cypher": "match (:ENTITY{name:'Panasonic TH-42PZ800C'}) - [*1..2]-(p) where p.name <> 'Panasonic' return distinct p.name limit 6"}, {"query": "Bernd Schneider is a nickname?", "cypher": "match (:ENTITY{name:'Bernd Schneider'}) <- [:Relationship{name:'foreign name'}]-(h),(h) - [:Relationship{name:'alias'}]->(n) return distinct n.name"}, {"query": "When the Chinese are the chairmen of the company, who is there?", "cypher": "match (p:ENTITY{name:' company chairman'}) <--(x) -->(q:ENTITY{name:' Han Chinese'}) return x.name"}, {"query": "Can you recommend 12 songs with a duration of 4 minutes and 47 seconds?", "cypher": "match (:ENTITY{name:'4 min 47 seconds'}) <- [:Relationship{name:'music length'}]- (x) return x.name limit 12"}, {"query": "What is the shortest distance between the two-level Kamelou Middle School and the Upper Secondary School in the city?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Roda County Camellia High School'}) - [*..2]-(b:ENTITY{name:'Kota's first high school'})) return count ((p)"}, {"query": "The author of this novel is named after you, naturally?", "cypher": "match (:ENTITY{name:'all in the name of nature'}) <- [:Relationship{name:'author'}]-(q),(q) - [:Relationship{name:'Chinese name'}]->(m) return distinct m.name limit 1"}, {"query": "The following is a list of three professions in which Jiangsu Yangyang can be active apart from being a strategist:", "cypher": "match (:ENTITY{name:'Bianzhou, Jiangsu Province'}) <- [:Relationship{name:'Born'}]- ((q) - [:Relationship{name:'Profession'}]->(x) where x.name <> 'Strategist' return distinct x.name limit 3"}, {"query": "What chemical is CAS number 174669-73-9?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}]