[{"query": "Do you know what chemical has a molecular weight of 152.15?", "cypher": "match (:ENTITY{name:'152.15'}) <- [:Relationship{name:'molecular mass'}]- (m) return distinct m.name"}, {"query": "What are the dates of the six political-military books?", "cypher": "match (:ENTITY{name:'political and military books'}) <- [*]-(m), (m) - [:Relationship{name:' date of creation'}]->(n) return m.name, n.name limit 6"}, {"query": "Is it possible to use a similar label for ivanol?", "cypher": "match (:ENTITY{name:'rock phosphate'}) - [:Tag{name:'label'}]-> (p) with p order by p.name return p.name"}, {"query": "Where are the students who graduated from the Central European School of International Business going?", "cypher": "match (:ENTITY{name:'Central European International Business School'}) <- [:Relationship{name:' Graduate School'}]-(h),(h) - [:Relationship{name:' Profession'}]->(n) return distinct h.name"}, {"query": "Tell me all the labels of the 16MN straight tube?", "cypher": "match (:ENTITY{name:'16MN straight tube'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "Can you help me find out the three vegetables?", "cypher": "match (:ENTITY{name:' vegetables'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' species'}]->(n) return m.name, n.name limit 3"}, {"query": "See the top-ranked label attribute for Ultimate Fantasy 1 that is different from the book label?", "cypher": "match (:ENTITY{name:'0 degree of ultimate fantasy1'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'books' return x.name limit 1"}, {"query": "Please tell me the main department setting of the Banyang Petrochemical Higher Specialist University?", "cypher": "match (:ENTITY{name:'High School of Chemical and Petroleum Engineering'}) <- [:Relationship{name:' Chinese name'}]- ((q),(q) - [:Relationship{name:' Major Faculty'}]->(p) return distinct q.name"}, {"query": "What are the non-hereditary categories and grades of quartz lamps?", "cypher": "match (:ENTITY{name:'Relationship{name:'non-hereditary level'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'non-hereditary category'}) ->(m) return m.name as name"}, {"query": "Which exhibition is the exhibition manager of Hangzhou Creative Jewelry Exhibition Services Limited?", "cypher": "match (:ENTITY{name:'Hangzhou Creative Jewelry Exhibition Services Limited'}) <- [:Relationship{name:'Executive business'}]- (p) return distinct p.name"}, {"query": "Please help me find the other 5 pieces of information in the second layer of the book.", "cypher": "match (:ENTITY{name:' little werewolf'}) - [:Relationship*1..2]-(p) where p.name <> 'books' return p.name limit 5"}, {"query": "Who knows what the main prize is for the famous fenmaster?", "cypher": "match (:ENTITY{name:'Relationship{name:'Chinese name'}]-(n) - [Relationship{name:'main award'}]->(h) return distinct h.name"}, {"query": "Name four doctors and what are their representative works?", "cypher": "match (:ENTITY{name:'doctor'}) <- [*]-(m), (m) - [:Relationship{name:'representative work'}]->(n) return m.name, n.name limit 4"}, {"query": "What kind of exhibitions are there in Zhuzhou, Henan?", "cypher": "match (:ENTITY{name:' Henan Province, Zhejiang City'}) <- [:Relationship{name:' Location'}]- (m) return m.name"}, {"query": "I would like to know what kind of relationships are there within the three layers of Zhou Sam Village?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Zhou with village'}) UNWIND relationships(path) AS rel return distinct rel.name limit 5"}, {"query": "What is the industrial product called 16Mn low alloy stainless steel pipe?", "cypher": "match (:ENTITY{name:'16Mn low alloy stainless steel pipe'}) --(n) with n order by n.name where n.name <> 'industrial product' return n.name"}, {"query": "What chemical has a Molar refraction of 32.57?", "cypher": "match (:ENTITY{name:'32.57'}) <- [:Relationship{name:'Mor refractive rate'}]- (h) return distinct h.name"}, {"query": "In addition to being an economist, Sheng introduces 10 other professions related to him.", "cypher": "match (:ENTITY{name:'\u8c22'}) <- [:Relationship{name:' Chinese name'}]-(p),(p) - [:Relationship{name:' profession'}]->(q) where q.name <> 'economist' return distinct q.name limit 10"}, {"query": "The main characteristic of an alloy steel is that it has good toughness. What is the name of this steel?", "cypher": "match (:ENTITY{name:' good resilience etc'}) <- [:Relationship{name:' main characteristics'}]- (n) return n.name"}, {"query": "What is the name of the 4A scenic area in Gaoqi Village, Tai Chi Town, Shenzhen, Hunan Province?", "cypher": "match (:ENTITY{name:'Nueqiang County Oil Creek Township, Gaokyu Village, Shenzhen, Hunan Province'}) <- [:Relationship{name:'Geographical location'}]-(m), (m) - [:Relationship{name:'Visitation level'}]->(n) where n.name='AAAA level' return m.name"}, {"query": "What is H.D. doing?", "cypher": "match (:ENTITY{name:'H.D'}) <- [:Relationship{name:'alias'}]-(x) - [:Relationship{name:'profession'}]->(p) return distinct p.name limit 1"}, {"query": "Please tell me what the main achievements of this Chinese person are?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(h) - [:Relationship{name:'main achievements'}]->(x) return x.name order by x.name limit 1"}, {"query": "Do you know the name of a car with an engine model called RFJ?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What kind of companies are the ones that have earned the reputation of being the leading brands in e-commerce between building materials companies?", "cypher": "match (:ENTITY{name:' a well-known brand for e-commerce between building materials companies'}) <- [:Relationship{name:' achievements'}]- ((h) - [:Relationship{name:' type'}]->(x) return distinct h.name"}, {"query": "111 Long Rainbow 008-III Big Khanh Horse 4000L What kind of electronics is it?", "cypher": "match (:ENTITY{name:'111 Long Rainbow 008-III Big Sweatshirt 4000L'}) --(n) with n order by n.name where n.name <> 'electronic product' return n.name"}, {"query": "Can you find any companies in Hangzhou?", "cypher": "match (p:ENTITY{location:' Hangzhou'}) return p.name"}, {"query": "What was the 1953 KGB inside?", "cypher": "match (:ENTITY{name:'1953 Kgb's interior'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 1"}, {"query": "Can you tell me the information about the bridge?", "cypher": "match (:ENTITY{name:' high bridge light'}) --(h) return h.name order by h.name limit 1"}, {"query": "The five main awards for excellence in education in Cape Town, please tell me about them.", "cypher": "match (:ENTITY{name:'Hope Excellence Education'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'Main award'}]->(m) return m.name order by m.name limit 5"}, {"query": "What chemical has a density of 1.333 g/cm3?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you find me a representation of a new teacher?", "cypher": "match (:ENTITY{name:'Chen Xin's'}) <- [:Relationship{name:'Teacher'}]-(x),(x) - [:Relationship{name:'Representative work'}]->(q) return distinct q.name limit 1"}, {"query": "You know, besides the 150 W power consumption, the LG 32LH23UR has 5 information in 2 layers.", "cypher": "match (:ENTITY{name:'LG 32LH23UR'}) - [*1..2]-(p) where p.name <> '150 W' return distinct p.name limit 5"}, {"query": "What are the fishes in the family of the crocodile in the western North Pacific?", "cypher": "match (:ENTITY{name:'Western Pacific Northwest'}) <- [:Relationship{name:' distribution area'}]-(m), (m) - [:Relationship{name:' genus'}]->(n) where n.name='genus' return distinct m.name"}, {"query": "What dialect is spoken in the area?", "cypher": "match (:ENTITY{name:'Bayan's Bay'}) - [:Relationship{name:'area'}]->(n) return n.name as name union all match (:ENTITY{name:'Bayan's Bay'}) - [:Relationship{name:'dialect'}]->(m) return m.name as name"}, {"query": "Can you give me the name of a company that has a production base in Guangdong Dongguan?", "cypher": "match (:ENTITY{name:' Guangdong.Dongshan'}) <- [:Relationship{name:' Production base'}]- (m) return m.name"}, {"query": "What is the total length of the Dutch Provence-class frigate? Can you tell me the discharge capacity?", "cypher": "match (x:ENTITY{name:'Dutch Province of the Pompidou class frigate'}),(x) - [:Relationship{name:' full length'}]-> (m), (x) - [:Relationship{name:' full discharge'}]->(n) return m.name,n.name"}, {"query": "What do you think about .vn domain names?", "cypher": "match (:ENTITY{name:'.VN domain name'}) --(h) with h order by h.name return h.name"}, {"query": "What are the components of a polycrystalline silicon solar panel?", "cypher": "match (:ENTITY{name:' polygonal aluminum solar panel'}) <- [:Relationship{name:' Chinese name'}]-(m),(m) - [:Relationship{name:' component'}]->(h) return distinct h.name"}, {"query": "The first is to match five labels for a 1,000-gun fishing machine.", "cypher": "match (:ENTITY{name:'1000 cannon fishing machine'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 5"}, {"query": "Find out the 10 people in Liang Shan, how many are they in Liang Shan?", "cypher": "match (:ENTITY{name:'spoonful'}) <--(m), (m) - [:Relationship{name:'spoonful'}]->(n) return m.name,n.name limit 10"}, {"query": "I've listed four famous sights in the Bay of Biscay, but what else can I do besides visit the Shining Moon and the Fukuda Tower?", "cypher": "match (n:ENTITY{name:'Floral Bay'}) - [:Relationship{name:'Famous attractions'}]->(h) where h.name <> 'Floral Bay' and h.name <> 'Floral Bay' return distinct h.name limit 4"}, {"query": "What is the density of 1-methoxyethylene?", "cypher": "match ((:ENTITY{name:'1-methacrylate ring-4-methylmethacrylate'}) - [:Relationship{name:'density'}]-> (m) return m.name"}, {"query": "What are some of the major accomplishments of Michael W. Young?", "cypher": "match (h:ENTITY{name:'Michael W. Young'}) <- [:Relationship{name:'foreign language name'}]- ((p) - [:Relationship{name:'main achievement'}]->(n) return distinct n.name"}, {"query": "What is the profession of Y.M. Shockaliski?", "cypher": "Match (:ENTITY{name:'Shakaliski, Y.M.'}) - [:Relationship{name:'profession'}]-> (p) return p.name skip 1 This is a list of all the different ways Shakaliski is credited in the database."}, {"query": "I would like to get some information about Brian Lally.", "cypher": "match (:ENTITY{name:'Brian Lally'}) --(n) return n.name skip 3"}, {"query": "Can you tell me five things about Capito Francesco, an Italian?", "cypher": "match (n:ENTITY{name:'Capto Francesco'}) - [*]->(x) where x.name <>'Italy' return distinct x.name limit 5"}, {"query": "How many 4A sites are there in our country?", "cypher": "match (:ENTITY{name:'AAAA'}) <--(m), (m) --(n) where n.name='China' return count ((distinct m.name)"}, {"query": "Do you know where the home stadium of AC Milan is?", "cypher": "match ((:ENTITY{name:'AC Milan Football Club'}) - [:Relationship{name:'Home venue'}]-> (p) return p.name"}, {"query": "What is the full name of Hong Kong star Shima?", "cypher": "match (:ENTITY{name:'shy'}) --(x) return distinct x.name"}, {"query": "What is the profession of Yang Kang?", "cypher": "Match ((:ENTITY{name:'spoon'}) - [:Relationship{name:'profession'}]-> (n) return n.name"}, {"query": "What is the type and grade of hospital in Xuzhou City Hospital?", "cypher": "match (:ENTITY{name:'Xuzhou City Center Hospital'}) - [:Relationship{name:'Hospital type'}]->(n) return n.name as name union all match (:ENTITY{name:'Xuzhou City Center Hospital'}) - [:Relationship{name:'Hospital grade'}]->(m) return m.name as name"}, {"query": "I know the molecular formula for 3-hydroxybenzene, but I don't know the molecular weight, can you help me?", "cypher": "match ((:ENTITY{name:'3-methacrylate'}) - [:Relationship{name:'molecular mass'}]-> (m) return m.name"}, {"query": "What is the name of the annual Buddhist law festival held in Lhasa, Tibet, China, during the new moon of the Tibetan calendar?", "cypher": "match (:ENTITY{name:' Buddhist Council held in Lhasa, Tibet, China during the new moon month of the Tibetan calendar .'}) --(x) return distinct x.name"}, {"query": "In addition to \"Soft and Too Loving You\", there are three other works by Liu Xiaobo.", "cypher": "match (n:ENTITY{name:'spoonful'}) - [:Relationship{name:'representative work'}]->(h) where h.name <> '\u67d4\u67d4' and h.name <> 'too much love for you' return distinct h.name limit 3"}, {"query": "1968 people now give five other professions in addition to professors, master's students, tutors.", "cypher": "match (:ENTITY{name:'1968'}) <- [:Relationship{name:'date of birth'}]-(p) - [:Relationship{name:'profession'}]->(m) where m.name <> 'professor, master student tutor' return distinct m.name limit 5"}, {"query": "What else do you know about the film The Chestnut Angel? Help me find the other 4 pieces of information in the 2nd layer.", "cypher": "match (:ENTITY{name:'chestnut angel'}) - [:Relationship*1..2]-(p) where p.name <> 'film' return p.name limit 4"}, {"query": "What is the ink painting of Nan-woo?", "cypher": "match (:ENTITY{name:'Southern Lights'}) <- [:Relationship{name:'creation date'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='paperback ink painting' return distinct m.name"}, {"query": "Is Lee Zhou-Ping a cook? Can you name five?", "cypher": "match (:ENTITY{name:'Lee Zhoupo'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 5"}, {"query": "Can you find information about Aguar Fernando, 5 and 1.85 meters?", "cypher": "match (n:ENTITY{name:'Aguiar Fernando'}) - [*]->(x) where x.name <>'1.85 m' return distinct x.name limit 5"}, {"query": "What are the school profiles of the following three primary schools in the Cabinet 2 level?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' Cabinet Primary School'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "Who is as tall as Reynaldo and what are their individual labels?", "cypher": "The following is a list of the most commonly used tags for the game of basketball:"}, {"query": "How much is the hotline for buying a bus ticket?", "cypher": "match (:ENTITY{name:'travel ticket'}) <- [:Relationship{name:'purchase'}]- (q) return distinct q.name"}, {"query": "What is the profession of people born in October 1984?", "cypher": "match (:ENTITY{name:'October 1984'}) <- [:Relationship{name:'date of birth'}]- ((q),(q) - [:Relationship{name:'occupation'}]->(x) return distinct x.name"}, {"query": "How about a 100 layer reveal strategy with one message?", "cypher": "match (:ENTITY{name:'100 level reveal full tactics'}) --(m) with m order by m.name return m.name skip 1 limit 1"}, {"query": "What kind of programs are on CNTV?", "cypher": "match (p:ENTITY{name:'CNTV'}) <- [:Relationship{name:'online streaming platform'}]- (h) return distinct h.name"}, {"query": "Do you know what the main awards are for ambition, kindness, yes, innovation in schools?", "cypher": "match (:ENTITY{name:'ambitious, kind, ambitious, innovative'}) <- [:Relationship{name:'school lesson'}]- ((h) - [:Relationship{name:'main award'}]->(x) return distinct x.name limit 5"}, {"query": "I'm going to be a writer for the next few years.", "cypher": "match (:ENTITY{name:' love business'}) <--(n) return n.name"}, {"query": "Can you find me three books published by Educational Science Publishing?", "cypher": "match (:ENTITY{name:'Publications in the field of education'}) <- [:Relationship{name:'Publications in the field of education'}]- ((n) - [:Relationship{name:'Book name'}]->(q) return distinct q.name limit 3"}, {"query": "Please list the names of 10 schools in Canada and the main departments they include.", "cypher": "match (:ENTITY{name:'Canada'}) <- [:Relationship{name:'area'}]-(x),(x) - [:Relationship{name:'main department'}]->(m) return x.name,m.name skip 1 limit 10"}, {"query": "What is the EINECS number of the ((\u00b1) -a-methyl-a-[trimethyl]phenyl acetate in the table?", "cypher": "match ((x:ENTITY{name:'(\u00b1) -a-methyl-a-[trimethyl]methyl-ethylene'}) - [:Relationship{name:'EINECS'}]-> (n) return n.name"}, {"query": "Can you tell me about the two labels owned by Kohin Pharmaceutical Trading Co., Ltd. in Sichuan Province, besides the brand name?", "cypher": "match (:ENTITY{name:' Kochin Pharmaceutical Trading Co., Ltd. of Sichuan Province'}) - [:Tag{name:'label'}]-> (p) with p order by p.name where p.name <> 'brand' return p.name limit 2"}, {"query": "Do you know which industrial books are available? Can you name five?", "cypher": "match (:ENTITY{name:' industry book'}) <- [:Tag{name:' label'}]-(x),(x) - [:Relationship{name:' book'}]->(q) return distinct q.name limit 5"}, {"query": "The scope of the evaluation of the evaluation work includes the implementation of a sanitary rural rehabilitation project in the area, called the \"Page name\"?", "cypher": "match (:ENTITY{name:' area of implementation of sanitary rural sanitation project\u3002'}) <- [:Relationship{name:' scope of assessment acceptance'}]- (p) return p.name"}, {"query": "I'm not sure if you can tell me the name of the host or the shooter's performance.", "cypher": "match (p:ENTITY{name:'performance host'}) <--(x) -->(q:ENTITY{name:'shooter'}) return x.name"}, {"query": "In which city is the South of Five Love Market?", "cypher": "match ((:ENTITY{name:'South of the Five Love Markets'}) - [:Relationship{name:'Location'}]-> (n) return n.name"}, {"query": "Do you know the first two words of the name of the publisher of The Last of the Mohicans and the full name of the publisher?", "cypher": "MATCH (n:ENTITY{name:' the last great wizard'}) - [:Relationship{name:' the issuing company'}]->(m) RETURN m.name, substring ((m.name, 0,2)"}, {"query": "What other information does Yuen Yuen have besides the Japanese information?", "cypher": "match (:ENTITY{name:'\u7950\u4ed9\u52c7'}) --(m) with m order by m.name where m.name <> 'Japan' return distinct m.name limit 2"}, {"query": "Do you know what chemical has CAS number 106505-90-2?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Can you give me two Japanese actors, what are their main roles?", "cypher": "match (:ENTITY{name:'Japanese actor'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:'main work'}]->(n) return distinct m.name,n.name limit 10"}, {"query": "What is the name of the long-tailed weasel?", "cypher": "match (:ENTITY{name:'Relationship{name:'do not call'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'distribution area'}) ->(m) return m.name as name"}, {"query": "Who is the founder of the two-time drivers' championship and four-time team championship?", "cypher": "match (:ENTITY{name:'2 times driver champion, 4 times team champion'}) <- [:Relationship{name:'main achievement'}]- ((n) - [:Relationship{name:'founder'}]->(m) return distinct m.name limit 1"}, {"query": "Help me find 10 songs", "cypher": "match (:ENTITY{name:'song'}) <- [:Relationship{name:'category'}]-(m) return distinct m.name limit 10"}, {"query": "What is the natural number between 108 and 110?", "cypher": "match (:ENTITY{name:'108 and 110 are natural numbers'}) <- [:Relationship{name:'meaning'}]- (q) return distinct q.name"}, {"query": "Who is the astronomer who wrote the book on the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth of the myth?", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship's name: 'representative work'}]- ((m), (m) - [Relationship's name: 'profession'}]->(n) where n.name='astronomer' return m.name"}, {"query": "Looking for an introduction to the three 1810 hard fatty acids besides their academic properties?", "cypher": "match (:ENTITY{name:'1810 fatty acid'}) --(x) with x order by x.name where x.name <> 'discipline' return x.name limit 3"}, {"query": "What is the shortest path to studying the comparison of the East and West reproductive cultures in the three layers of the electronic circuit experiment tutorial?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Electronic circuit experiment tutorial'}) - [*..3]-(b:ENTITY{name:'East and West fertility culture comparison study'})) return count ((p)"}, {"query": "Who among the animation masters has won the Oscar for Best Picture?", "cypher": "match (:ENTITY{name:'Oscar of the Golden Image'}) <- [:Relationship{name:' Major achievements'}]-(m), (m) - [:Relationship{name:' Career'}]->(n) where n.name='Master of Animation' return distinct m.name"}, {"query": "What is the Latin name of the Emerald Budgies butterfly described in the book?", "cypher": "Match (s) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) ("}, {"query": "Whoopi Goldberg's work is representative of what?", "cypher": "match (:ENTITY{name:'Whoopi Goldberg'}) <- [:Relationship{name:'foreign language name'}]-(m) - [:Relationship{name:'representing work'}]->(q) return q.name order by q.name limit 10"}, {"query": "I'm not sure if I can explain this person.", "cypher": "match (n:ENTITY{name:'sweet'}) --(x) return x.name"}, {"query": "I would like to know which reporting regulations were published by Sichuan Daily?", "cypher": "match (:ENTITY{name:'Sichwa daily'}) <- [:Relationship{name:'published media'}]- (m) return distinct m.name"}, {"query": "Can you list two software that were launched in 2013?", "cypher": "The following is a list of the most commonly used parameters for the calculation of the value of a variable:"}, {"query": "Do you have any trouble recommending some fantasy, romance, comedy movies?", "cypher": "match (:ENTITY{name:'fantasy, love, comedy'}) <- [:Relationship{name:'type'}]- (x) return distinct x.name"}, {"query": "Can anyone tell me what Liu Wei Ming does for a living?", "cypher": "match (:ENTITY{name:'Yun Wei-ming, Zhejiang practitioner, born 1961 in Wuhan, Hubei, studied book painting since childhood, his calligraphy works are just as hard as hard, and as easy as easy.\u300f)"}, {"query": "What do you think of when you think of Shanghai? Can you name four?", "cypher": "match (:ENTITY{name:'Shanghai City'}) <- [:Relationship{name:'location'}]- (m) return m.name limit 4"}, {"query": "Is there another strain of the unusual chainworm that is a radiofrequency bacteria?", "cypher": "match (:ENTITY{name:'unusual chainworm'}) - [:Relationship{name:'properties'}]-> (h) with h order by h.name where h.name <> 'radioactive bacteria' return h.name"}, {"query": "I would like to know what the relationship is between the three levels of administrative penalties that customs impose?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Customs administrative penalty'}) UNWIND relationships(path) AS rel return distinct rel.name limit 1 The name of the link is not known"}, {"query": "Can you tell me two things about Kim Quayle's main achievements?", "cypher": "match (:ENTITY{name:'Kin Kwei'}) <- [:Relationship{name:' alias'}]- ((q),(q) - [:Relationship{name:' major achievement'}]->(x) return distinct x.name limit 2"}, {"query": "I'm going to be a pop star and an actor, can you find me two?", "cypher": "match (:ENTITY{name:'pop singer'}) <- [:Relationship{name:'profession'}]-(m), (m) - [:Relationship{name:'profession'}]->(n) where n.name='film and television actor' return m.name"}, {"query": "I would like to know all the information about Wang Xia's work in Qingdao Chapter 2, Chapter 4?", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name<>'Wangyang' return distinct x.name"}, {"query": "What's the name of this person with the artist tag? Can you tell me one?", "cypher": "match (:ENTITY{name:' artist'}) <- [:Tag{name:' tag'}]-(x) - [:Relationship{name:' alias'}]->(q) return q.name order by q.name limit 1"}, {"query": "I'm not sure if you understand, but can you tell me about him?", "cypher": "match (:ENTITY{name:'Welcome'}) --(p) return p.name skip 1 This is a list of all the different ways P.M.S. is credited in the database."}, {"query": "Can you name the other five professions this politician has?", "cypher": "match (:ENTITY{name:'political figure'}) <- [:Tag{name:'tag'}]-(m),(m) - [:Relationship{name:'profession'}]->(q) return q.name skip 1 limit 5"}, {"query": "The information about Bialek Jaroslaw, who gave me the third level of relationship football?", "cypher": "match (n:ENTITY{name:'Bialek Jaroslaw'}) - [*1..3]->(x) where x.name <> 'football' return distinct x.name"}, {"query": "I asked what label is 2GB DDR3 on the product?", "cypher": "match (:ENTITY{name:'2GB DDR3'}) <- [:Relationship{name:'memory capacity'}]-(m),(m) - [:Tag{name:'tag'}]->(p) return distinct p.name limit 1"}, {"query": "Can you give me 10 pieces of information about the famous 3 layered dihu-saima, other than the instrument of performance is the dihu?", "cypher": "match (:ENTITY{name:'racehorse[Diihu track]'}) - [*1..3]-(p) where p.name <> 'Diihu, folk music' return distinct p.name limit 10"}, {"query": "Can you give me one of the mass sex groups and describe it?", "cypher": "match (:ENTITY{name:'mass group'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 1"}, {"query": "I would like to know what kind of jobs are people with socialist, Marxist, communist beliefs doing?", "cypher": "match (:ENTITY{name:'socialism, Marxism, communism'}) <- [:Relationship{name:'faith'}]- ((m) - [:Relationship{name:'profession'}]->(x) return distinct x.name"}, {"query": "The following is a list of five Natalie Magdalene messages.", "cypher": "match (:ENTITY{name:'Natalie Magdalena'}) --(h) return distinct h.name limit 5 The name of the game is the same as the name of the game"}, {"query": "What are the three Chinese names of Chin Dong, born in Hong Kong in 1954 and a native of Shandong, China?", "cypher": "match (:ENTITY{name:'Zhu Zhong Shan Tong's Tobacco Company, born 1954 in Hong Kong Taipei Mountain, entered the Chinese Drama School at the age of six to study drama, initially as a martial artist, and gradually developed into an actor, director and supervisor."}, {"query": "How many books of 32 pages have been published by the Reliance Publishing Company?", "cypher": "match (l:ENTITY{name:'connection publisher'}) <- [:Relationship{name:'publisher'}]- (mn) - [:Relationship{name:'opened'}]->(n:ENTITY{name:'32opened'}) return mn.name limit 20"}, {"query": "Can you tell me what Emanuel Wolstein does for a living?", "cypher": "match (:ENTITY{name:'Emanuel Wolstein'}) - [:Relationship{name:'profession'}]-> (m) return m.name order by m.name"}, {"query": "Life is tough, which company is producing? Who is the director? Who is the main actor in this drama?", "cypher": "Match (:ENTITY{name:'life is tough'}) - [:Relationship{name:'output company'}]->(n) return n.name as name union all match (:ENTITY{name:'life is tough'}) - [:Relationship{name:'director'}]->(m) return m.name as name union all match (:ENTITY{name:'life is tough'}) - [:Relationship{name:'lead actor'}->(r) return r.name as name"}, {"query": "I want to find six plants, and what are their families?", "cypher": "The name of the plant is the same as the name of the plant itself."}, {"query": "Which company developed the spss software?", "cypher": "match (:ENTITY{name:'spss'}) - [:Relationship{name:'developer'}]->(m) return distinct m.name"}, {"query": "The first is that the government has decided to give 12308 national tickets 10 different labels.", "cypher": "match (:ENTITY{name:'12308 national bus ticket'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return distinct n.name limit 10"}, {"query": "Can you tell me about the 5 types of relationships in the 5 levels of the 3 practical violin scale exercises published by Shanghai Music Publishing?", "cypher": "match (n:ENTITY{name:'Practical Violin Stage 3'}) - [*1..5]->(x) where x.name<>'Shanghai Music Publishing' return distinct x.name limit 5"}, {"query": "What is the name of the theory proposed by J. Piaget for its application in psychology?", "cypher": "match (:ENTITY{name:'J. Piager'}) <- [:Relationship{name:'proposer'}]- ((m), (m) - [:Relationship{name:'applied discipline'}]->(n) where n.name='developmental psychology' return distinct m.name"}, {"query": "Do you know anything about Shan Lin's career other than modeling and acting?", "cypher": "match (n:ENTITY{name:'Shan Lin's'}) - [:Relationship{name:'profession'}]->(h) with h order by h.name where h.name <> 'model' and h.name <> 'actor' return h.name limit 1"}, {"query": "Do you want to know about the profile of this person, Vrapi Endrit, in the two-tier relationship?", "cypher": "match (n:ENTITY{name:'Vrapi Endrit'}) - [*1..2]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "Can you provide me with five details of the five levels of relationship of Yuki Kobayashi, a football player?", "cypher": "match (n:ENTITY{name:'\u7389\u57ce\u5cfb\u543e'}) - [*1..5]->(x) where x.name<> 'footballer' return distinct x.name limit 5"}, {"query": "Can you name two types of blackbird bikes in languages other than English and Chinese?", "cypher": "match (n:ENTITY{name:'Blackbird Bike'}) - [:Relationship{name:'software language'}]->(h) with h order by h.name where h.name <> 'English' and h.name <> 'Chinese' return h.name limit 2"}, {"query": "Do you know which international conference was held on December 1st - December 12th 2008?", "cypher": "match (:ENTITY{name:'December 1, 2008 - December 12, '}) <- [:Relationship{name:' time'}]- (q) return distinct q.name"}, {"query": "What is the best way to get rid of the smell of strawberries?", "cypher": "match (:ENTITY{name:'Relationship{name:'Not suitable for the crowd'}]-> (m) return distinct m.name"}, {"query": "Do you know what constellations represent for the authors of Virgo?", "cypher": "match (:ENTITY{name:'virgin'}) <- [:Relationship{name:'star'}]-(n),(n) - [:Relationship{name:'represented work'}]->(q) return distinct q.name limit 1"}, {"query": "List four online novels and their authors.", "cypher": "match (:ENTITY{name:'net novel'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'author'}]->(n) return m.name, n.name limit 4"}, {"query": "Please tell me 10 famous sights in the city of Taipei.", "cypher": "Match (:ENTITY{name:'Water City of the West'}) - [:Relationship{name:'Famous attractions'}]-> (m) return m.name limit 10"}, {"query": "The author of the book represented by Liu Xiaobo is a Shenyang man, who told me about his other three works.", "cypher": "match (:ENTITY{name:'Shenyang'}) <- [:Relationship{name:'birthplace'}]-(m) - [:Relationship{name:'representative work'}]->(x) where x.name <> 'Yunqian' return distinct x.name limit 3"}]