[{"query": "Do you want to know about the three-tier relationship of the JMC Health Management Training Center?", "cypher": "match (n:ENTITY{name:'Tajikistan Health Management Training Centre'}) - [*1..3]->(x) where x.name<>'Tajikistan Health Management Training Centre' return distinct x.name"}, {"query": "I'm curious about the soundtracks of the movie. Can you name five?", "cypher": "match (n:ENTITY{name:'strongman'}) <--(q) - [:Relationship{name:'sounding'}]->(x) return distinct x.name limit 5"}, {"query": "What else do you know about Lan Xiao Chan, besides that it was founded in 2002?", "cypher": "match (:ENTITY{name:'Lanterns'}) - [*1..3]-(p) where p.name <> '2002' return p.name limit 5"}, {"query": "Tell me about Finnish Bj\u00f6rkman Jani in the third level of relationships?", "cypher": "match (n:ENTITY{name:'B?ckman Jani'}) - [*1..3]->(x) where x.name <> 'Finland' return distinct x.name"}, {"query": "Please tell me what games require graphics cards with 32M or more GeForce 2 3D acceleration cards?", "cypher": "match (:ENTITY{name:'GeForce2 or higher 3D acceleration card 32M displayed'}) <- [:Relationship{name:'graphics card'}]- (q) return q.name"}, {"query": "Find out who are the main characters in the six Korean movies.", "cypher": "Match (:ENTITY{name:'Korean film'}) <- [*]-(m), (m) - [:Relationship{name:'star'}]->(n) return m.name, n.name limit 6"}, {"query": "How much are Liu's books priced?", "cypher": "match (:ENTITY{name:'\u798f\u7965'}) <- [:Relationship{name:'author'}]- ((n) - [:Relationship{name:'pricing'}]->(q) return distinct q.name"}, {"query": "Did you mention that Beijing has a brick company?", "cypher": "match (p:ENTITY{location:'Beijing'}) return p.name The name of the match is"}, {"query": "Can you sum up your dream for me in no more than 10 words?", "cypher": "match (:ENTITY{name:'your dream'}) --(n) with n order by n.name return n.name limit 10"}, {"query": "Can you tell me about the representative works of the National Tour of the City of Khartoum?", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}]-> (m) return distinct m.name"}, {"query": "What are the chemical elements of aluminum and what are the main uses?", "cypher": "match (:ENTITY{name:'peridot'}) - [:Relationship{name:'element symbol'}]->(n) return n.name as name union all match (:ENTITY{name:'peridot'}) - [:Relationship{name:'main use'}]->(m) return m.name as name"}, {"query": "Find out about the three types of flour dishes and introduce them.", "cypher": "match (:ENTITY{name:'flour'}) <- [:Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "What else do you know about the mountain besides the mountain range?", "cypher": "match (:ENTITY{name:'Mountain'}) -[*1..2]-(p) where p.name <> 'Mountains' return p.name limit 10"}, {"query": "What is the name of the cucumber?", "cypher": "match (:ENTITY{name:' sea cucumber'}) --(x) return distinct x.name"}, {"query": "I wonder what TV shows are on Farmers TV?", "cypher": "Match (:ENTITY{name:'Relationship'}) <- [:Relationship{name:'online play platform'}]- (m) return m.name"}, {"query": "Tell me five things about the position of acting deputy governor.", "cypher": "match (:ENTITY{name:' Deputy County Chief'}) --(h) return distinct h.name limit 5"}, {"query": "I'm not sure if you're familiar with the film, but I'm not sure.", "cypher": "match (:ENTITY{name:'Wau Steel'}) <- [:Relationship{name:'General Director'}]- (q) return q.name"}, {"query": "What are the novels that are included in Red Sleeve? Can you name two?", "cypher": "match (:ENTITY{name:' red sleeve added'}) <- [:Relationship{name:' connecting platform'}]- (x) return x.name limit 2"}, {"query": "Please tell me what kind of birds are in the Dimension?", "cypher": "match (:ENTITY{name:' multi-dimensional bird'}) --(p) return p.name order by p.name limit 10"}, {"query": "This person is a Maon, male, Han, born in September 1964, a native of Inner Mongolia, with a master's degree, entered the workforce in July 1986, and joined the Communist Party of China in November 1990.", "cypher": "match (n:ENTITY{name:'Mao, male, Han, born September 1964, native of Inner Mongolia, master's degree, entered the workforce in July 1986, joined the Communist Party of China in November 1990)"}, {"query": "Can you tell me the top 5 information about Ren Liyuan?", "cypher": "match (:ENTITY{name:'reputed'}) <- [Relationship{name:'known'}]- (n) return n.name order by n.name limit 5"}, {"query": "Please tell me what is the nature of evening dancing and what is the good of it?", "cypher": "match (:ENTITY{name:'night's dance'}) - [:Relationship{name:'bound'}]->(n) return n.name as name union all match (:ENTITY{name:'night's dance'}) - [:Relationship{name:'\u5c5e'}]->(m) return m.name as name"}, {"query": "How much is the global sales of Mario Kart 8?", "cypher": "match (:ENTITY{name:'Mario Racing 8'}) <- [:Relationship{name:' Chinese name'}]- ((m) - [:Relationship{name:' Global sales'}]->(q) return distinct q.name limit 1"}, {"query": "Can you list the 10 most representative works of people born on August 1, 1973?", "cypher": "match (:ENTITY{name:'August 1, 1973)) <- [:Relationship{name:'date of birth'}]-(n) - [:Relationship{name:'representative work'}]->(q) return distinct q.name limit 10"}, {"query": "Do you have any information about the most representative works of Liu?", "cypher": "match (:ENTITY{name:''}) - [:Relationship{name:'represents work'}]-> (h) return h.name order by h.name limit 10"}, {"query": "I wonder if there is a plant-based skin care brand named after you?", "cypher": "match (m:ENTITY{name:' plant skin care brand'}) <- [:Relationship{name:' definition'}]- (x) return x.name"}, {"query": "Do you have the content of the relationship names involved in the 3 tier commercial real estate planning blue book?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Commercial real estate planning blue book'}) UNWIND relationships(path) AS rel return rel.name"}, {"query": "The type of website is tourism, study abroad help me find 10 of them.", "cypher": "match (:ENTITY{name:' travel, study abroad'}) <- [:Relationship{name:' website type'}]- (n) return n.name order by n.name limit 10"}, {"query": "I want an introduction to the three-layer relationship between the method of airtight testing of dangerous goods and airtight packaging published by China Standard Publishing.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <> 'China Standard Publishing' return distinct x.name"}, {"query": "Do you know what All Source Chinese translation is?", "cypher": "The name of the file is the same as the name of the file in the source code."}, {"query": "I'm not going to give you more than 10 professors' achievements.", "cypher": "match (:ENTITY{name:'professor'}) <- [:Relationship{name:'profession'}]-(p),(p) - [:Relationship{name:'main achievement'}]->(h) return h.name order by h.name limit 10"}, {"query": "Can you tell us about the main achievements of this Chinese person?", "cypher": "match (:ENTITY{name:'Han Chinese'}) <- [:Relationship{name:'ethnicity'}]-(p) - [:Relationship{name:'main achievement'}]->(x) return x.name skip 1 limit 3"}, {"query": "What is the representative work of Arthur Shields?", "cypher": "match (:ENTITY{name:'Arthur Shields'}) - [:Relationship{name:'represents work'}]-> (h) return h.name order by h.name"}, {"query": "What are the books of Florida George and what are they classified as?", "cypher": "match (:ENTITY{name:'Florida George'}) <- [:Relationship{name:'author'}]-(h),(h) - [:Tag{name:'tag'}]->(q) return distinct h.name,q.name"}, {"query": "Can you tell me the first three Chinese names of the Dark Souls of the Third Age?", "cypher": "match (:ENTITY{name:'Relationship{name:'Chinese name'}]-> (h) with h order by h.name return distinct h.name limit 3"}, {"query": "The Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, and the Chinese Academy of Engineering.", "cypher": "match (:ENTITY{name:'Land Road, academician of Chinese Academy of Sciences, economic geographer\u3002'}) <- [:Describe{name:'description'}]- ((h) - [:Relationship{name:'main achievements'}]->(x) return distinct x.name"}, {"query": "I want to publish the 2009 version of the 2010 Chinese Pharmaceutical Model and the other 5 pieces of information in the second layer of the book.", "cypher": "match (:ENTITY{name:'2010 Chinese pharmaceutical simulation and analysis'}) - [*1..2]-(p) where p.name <> '2009/11/1' return distinct p.name limit 5"}, {"query": "The article is about the political education and political science topics that are being studied in the two-tiered relationship.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'Jade' return distinct x.name"}, {"query": "What is the difference between the adjective and the adverb in poor villages like Yangyang?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'next meaning'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'next meaning'}]->(m) return m.name as name"}, {"query": "Where did the expression \"alcoholic hell\" come from?", "cypher": "match (:ENTITY{name:'drinking hell'}) - [:Relationship{name:'from where'}]->(m) return distinct m.name"}, {"query": "Help me find a primate with a curly tail.", "cypher": "match (:ENTITY{name:'ringtail'}) <- [:Relationship{name:'ringtail'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='ringtail' return distinct m.name"}, {"query": "I'm not sure what the main achievements of Irene Ko are.", "cypher": "match (:ENTITY{name:'Irene ko'}) <- [:Relationship{name:' foreign language name'}]- ((q),(q) - [:Relationship{name:' major achievement'}]->(n) return n.name order by n.name limit 3"}, {"query": "The price of a concert is 255, 355, 455, 655, which concert?", "cypher": "match (:ENTITY{name:'255\u3001355\u3001455\u3001655 etc'}) <- [:Relationship{name:'concert ticket price'}]- (m) return m.name"}, {"query": "Has there come to you the news of the name of the rich man?", "cypher": "Match (:ENTITY{name:'Relationship{name:'alias'}]-> (m) return m.name skip 2"}, {"query": "Is the 09 Miss USA benefiting other brand attributes besides the smart game?", "cypher": "match (:ENTITY{name:'09 Selected American Games'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'wisdom game' return h.name"}, {"query": "The top 10 archaeological discoveries of 2010 in the country are so amazing, I would like to know who is the organizer?", "cypher": "match ((:ENTITY{name:'2010 Top 10 Archaeological Discoveries in the Country'}) - [:Relationship{name:' Host'}]-> (q) return q.name"}, {"query": "Please tell me which books have been published by author Ju-Jin? Please help me find three books, each published by which publisher?", "cypher": "match (:ENTITY{name:'Ju Akishun Kingdompin'}) <- [*]-(m), (m) - [:Relationship{name:'publishing house'}]->(n) return m.name, n.name limit 3"}, {"query": "What is the English name of the subject of the family?", "cypher": "match (:ENTITY{name:'cow'}) <- [:Relationship{name:'category'}]- ((n) - [:Relationship{name:'English name'}]->(m) return distinct n.name limit 1"}, {"query": "What does 1000 keyboard tricks mean for a label?", "cypher": "match (:ENTITY{name:'1000 keyboard tricks'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name"}, {"query": "What is the culture of the company that is on the 0912 website?", "cypher": "match ((:ENTITY{name:'0912 info network'}) - [:Relationship{name:'corporate culture'}]-> (h) return h.name"}, {"query": "Please list all the content of Sun Yat-sen.", "cypher": "match (:ENTITY{name:'Sun Yi Huan'}) --(q) return q.name skip 3 This is a list of all the different ways Sun Yi Huan is credited in the database."}, {"query": "Help me find the words next to the five foot words.", "cypher": "match (:ENTITY{name:'foot'}) <- [:Relationship{name:'part'}]-(m) return distinct m.name limit 5"}, {"query": "Help me find five pieces of music.", "cypher": "match (:ENTITY{name:'music'}) <- [:Tag{name:'label'}]-(m) return distinct m.name limit 5"}, {"query": "Can you tell me about the three actors who star in the movie \"Love at Dawn\"?", "cypher": "match (:ENTITY{name:'Love at dawn and sunrise'}) --(q) return distinct q.name limit 3"}, {"query": "Do you know how many Chinese government employees there are? Name three?", "cypher": "match (:ENTITY{name:'Chinese'}) <- [:Relationship{name:'Chinese'}]- (n) return n.name limit 3"}, {"query": "What is the main treatment for the 14 amino acid solution 800 in the hospital?", "cypher": "match ((:ENTITY{name:'14 amino acid injectable -800'}) - [:Relationship{name:' mainly used for '}]-> (n) return n.name"}, {"query": "There is an exhibition called \"Experimentation across borders\" and its name is what?", "cypher": "match (:ENTITY{name:' cross-border; experiment'}) <- [:Relationship{name:' exhibition theme'}]- (n) return n.name"}, {"query": "I'm curious about some of Rochelle Redfield's iconic works.", "cypher": "Match (:ENTITY{name:'Rochelle Redfield'}) - [:Relationship{name:'representing work'}]-> (x) return x.name skip 1"}, {"query": "Do you know how many 3D works of unknown voice actors are there?", "cypher": "match (:ENTITY{name:' unknown'}) <- [:Relationship{name:' three circles'}]-(x),(x) - [:Relationship{name:' sounding'}]->(p) return distinct p.name limit 3"}, {"query": "Are you playing Minecraft?", "cypher": "The game is called \"Minecraft\" and is called \"Minecraft\"."}, {"query": "Do you remember what the theme of the 2010 Mid-Autumn TV show was?", "cypher": "match ((n:ENTITY{name:'2010 Central Television Mid-Autumn Party'}) - [:Relationship{name:'subject'}]-> (x) return x.name"}, {"query": "What is the Chinese name of a novel called Swordspine Rockfish?", "cypher": "match (:ENTITY{name:'Swordspine rockfish'}) <- [:Relationship{name:'English name'}]- (m) return m.name"}, {"query": "Tell me what the hotline was founded on April 1, 2009?", "cypher": "match (:ENTITY{name:'April 1, 2009'}) <- [:Relationship{name:'time of opening'}]- (m) return distinct m.name"}, {"query": "Help me find three AAAA-rated sites.", "cypher": "match (:ENTITY{name:'AAAA level'}) <- [:Relationship{name:'site level'}]-(m) return distinct m.name limit 3"}, {"query": "Can you tell me what kind of relationship is covered by the passionate fighter in the three layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' passionate battleground owner'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "I want to know the complete nutrition book for 0-3 year old babies?", "cypher": "match (:ENTITY{name:'0~3 years old baby nutrition book'}) --(m) with m order by m.name return m.name"}, {"query": "Could you tell me what you know about the five professions of this Dutch-born person?", "cypher": "match (:ENTITY{name:'Netherlands'}) <- [:Relationship{name:'place of birth'}]- ((m) - [:Relationship{name:'profession'}]->(q) return q.name skip 1 limit 5"}, {"query": "What is the name of the school of the river otter?", "cypher": "match (:ENTITY{name:' river, river, river'}) <- [:Relationship{name:' not named'}]- ((m) return distinct m.name"}, {"query": "The attackers were also killed by the Taliban, who were also killed by the Taliban.", "cypher": "match (:ENTITY{name:' offensive weapon, defensive equipment'}) <- [:Relationship{name:' classification'}]- (p) return p.name"}, {"query": "Can you help me find two people who were born in Hebei's Lotus?", "cypher": "match (:ENTITY{name:'Hebei's Playground'}) <- [:Relationship{name:'birthplace'}]- ((x),(x) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name"}, {"query": "Tell me about the five pieces of information about the organization of Hangzhou Miwan Advertising Co., Ltd.", "cypher": "match (n:ENTITY{name:'Hangzhou Miwan Advertising Co. Ltd'}) - [*]->(x) where x.name <> 'organizing agency' return distinct x.name limit 5"}, {"query": "What is the origin of the name of the dish?", "cypher": "match (:ENTITY{name:'Relationship{name:'category'}]-> (m) return distinct m.name"}, {"query": "The first is that the scientists who graduated from the University of Hebei have a medical degree.", "cypher": "match (:ENTITY{name:'Hebei Medical College'}) <- [:Relationship{name:'Graduate College'}]-(m), (m) - [:Relationship{name:'Profession'}]->(n) where n.name='Scientist' return m.name"}, {"query": "I would like to ask you about the 13 books of the People's University of China: The relationship between the two layers of the literature curriculum?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'13' return distinct x.name"}, {"query": "Can anyone help me find two national champions for Lanzhou?", "cypher": "match (:ENTITY{name:'\u5170\u5dde'}) <- [:Relationship{name:'\u7c4d\u8d2f'}]-(x),(x) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 2"}, {"query": "What are the five famous places that are open from 07:00 to 17:30?", "cypher": "match (:ENTITY{name:'07:00~17:30'}) <- [:Relationship{name:'open hours'}]- ((x),(x) - [:Relationship{name:'famous attractions'}]->(m) return distinct m.name limit 5"}, {"query": "Can you tell me who is the voice of Jaune Arc? Can you name the first five?", "cypher": "match (:ENTITY{name:'Jaune Arc'}) - [:Relationship{name:'sounding'}]-> (m) return m.name order by m.name limit 5"}, {"query": "Do you know which relationship names are included in the 3 layers of the Haze?", "cypher": "The following pages link to The Unknown:"}, {"query": "Where are the six seasonal picnic spots listed?", "cypher": "match (:ENTITY{name:' four seasons are available'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' geographical location'}]->(n) return m.name,n.name limit 6"}, {"query": "Find me the location of the three Da Nang International Airports, which are the famous attractions?", "cypher": "match (:ENTITY{name:'Da Nang International Airport'}) <--(m), (m) - [:Relationship{name:'Famous attractions'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "What do you know about the publication, the Encyclopedia of Early Childhood Education 0-6?", "cypher": "match (:ENTITY{name:'0~6 Early Childhood Encyclopedia'}) --(n) with n order by n.name where n.name <> ' publications' return n.name"}, {"query": "Do you know the 5 facts about the chemical 2-hydroxy-3-hydroxy-methyl acetate?", "cypher": "match (n:ENTITY{name:'2-hydroxy-3-hydroxy-methylmethacrylate'}) - [*]->(x) where x.name <>'2-hydroxy-3-hydroxy-methylmethacrylate' is a chemical compound with the molecular formula C11H8O2S\u3002' return distinct x.name limit 5"}, {"query": "I would like to know what other identity is there besides the personality tag?", "cypher": "match (:ENTITY{name:'Lang-shan'}) --(m) with m order by m.name where m.name <> 'person' return distinct m.name limit 2"}, {"query": "The system is related to the records of Beijing Zhuhai Investment Limited?", "cypher": "match (n:ENTITY{name:'Beijing Huizhou Investment Co. Ltd'}) where n is not null return 1"}, {"query": "The first 10 items are the most popular in the world, and the first 10 are the most popular in the world.", "cypher": "match (:ENTITY{name:'floating city giant'}) --(n) return n.name order by n.name limit 10"}, {"query": "I want to know the total number of Longcheng businesses.", "cypher": "match (p:ENTITY{location:' Long Spring'}) return count ((p) and the number of matches"}, {"query": "Please help me find out the names of the four species of fish in the family of the beaked sea snails.", "cypher": "match (:ENTITY{name:'spoon'}) <- [*]-(m), (m) - [:Relationship{name:'spoon'}]->(n) return m.name, n.name limit 4"}, {"query": "What news events were reported on the 23rd?", "cypher": "match (:ENTITY{name:' news event'}) <- [:Relationship{name:' concept'}]- (h) return h.name"}, {"query": "Where can I find the Rainforest Company?", "cypher": "match (p:ENTITY{name:' Rainforest Company'}) return p.location The name of the company is"}, {"query": "What is the maximum storage capacity of the Quintin Scalar i40 ((LSC14-CH5J-219H)?", "cypher": "match (:ENTITY{name:'Quinn Scalar i40(LSC14-CH5J-219H) is a tape library with a maximum storage capacity of: 37500GB\u3002'}) <- [:Describe{name:'description'}]- ((q) - [:Relationship{name:'Maximum storage capacity'}]->(m) return distinct m.name"}, {"query": "I want to know what the three layers of the relationship that Maya Babi is involved in are?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations"}, {"query": "What is the personal information of Levite Ohad, the five-time world champion?", "cypher": "match (n:ENTITY{name:'Levitte Ohad'}) - [*]->(x) where x.name<> 'football' return distinct x.name limit 5"}, {"query": "What are the symptoms of plant diseases?", "cypher": "match (:ENTITY{name:' plant disease'}) - [:Relationship{name:' disease'}]->(m) return distinct m.name"}, {"query": "Can you recommend 5 songs that are in Mandarin?", "cypher": "match (:ENTITY{name:'Mandarin'}) <- [:Relationship{name:'Language of song'}]- (q) return distinct q.name limit 5"}, {"query": "Can you find 10 animals with two outlines? Please help me introduce them.", "cypher": "match (:ENTITY{name:' two-lined'}) <- [*]-(m), (m) - [:Describe{name:' description'}]->(n) return distinct m.name, n.name limit 10"}, {"query": "What chemical is Beilstein's number 1764476?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you describe the contents of the five-tier relationship related to the Hu clan?", "cypher": "match (n:ENTITY{name:'Hu clan'}) - [*1..5]->(x) where x.name<>'Hu clan' return distinct x.name"}, {"query": "Help me find 10 religious figures from the Qing Dynasty.", "cypher": "match (:ENTITY{name:'Chang Dynasty'}) <- [:Relationship{name:'at the time'}]-(m), (m) - [:Tag{name:'tag'}]->(n) where n.name='religious figure' return distinct m.name limit 10"}, {"query": "What are the different types of poems in the genre of science fiction? What are the different labels? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'science fiction'}) - [:Relationship{name:'style'}]->(:ENTITY) <- [:Relationship{name:'style'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Can you tell me the name and surname of Liang Sambo in English?", "cypher": "match (:ENTITY{name:'Liang Shanber'}) - [:Relationship{name:'foreign language name'}]->(n) return n.name as name union all match (:ENTITY{name:'Liang Shanber'}) - [:Relationship{name:'alpha name'}]->(m) return m.name as name"}, {"query": "The book is published by a group of young writers in the city of Gyumri, which is also known as the \"Gumrah\".", "cypher": "match (:ENTITY{name:''}) <- [:Relationship{name:'author'}]-(x),(x) - [:Relationship{name:'publisher'}]->(q) return distinct q.name"}, {"query": "The question is, which category of theory is the universal resource theory?", "cypher": "match (:ENTITY{name:'theory of the whole resource'}) <- [:Relationship{name:'theory of belonging'}]- (n) return distinct n.name"}, {"query": "The first is the medical field, which is a field of study that is not only a medical field but also a medical field.", "cypher": "match (:ENTITY{name:'1-'}) --(n) with n order by n.name where n.name <> 'medicine' return n.name limit 10"}, {"query": "The Big Four has a representation of the chicken?", "cypher": "match (:ENTITY{name:'Big four'}) - [:Relationship{name:'representing work'}]-> (m) return m.name skip 1"}, {"query": "The people who are representing the work of the people who are climbing the mountains in the mountains?", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}}) - (p) return p.name skip 1"}, {"query": "List five books by the management, and tell me when they were published.", "cypher": "match (:ENTITY{name:'Manage books'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:' time of publication'}]->(n) return m.name, n.name limit 5"}, {"query": "What is the word for Kirchhoff's law? Who proposed it?", "cypher": "match (:ENTITY{name:'Kirhof's law'}) - [:Relationship{name:'other name'}]->(n) return n.name as name union all match (:ENTITY{name:'Kirhof's law'}) - [:Relationship{name:'proponent'}]->(m) return m.name as name"}, {"query": "Can you list the four major faculties of Beijing's industrial schools that are not mechanical and chemical?", "cypher": "match (n:ENTITY{name:'Beijing Industrial School'}) - [:Relationship{name:'main faculty'}]->(h) where h.name <> 'mechanical' and h.name <> 'chemical' return distinct h.name limit 4"}, {"query": "Can you recommend some fun 8.2M software to me?", "cypher": "Match (:ENTITY{name:'8.2M'}) <- [:Relationship{name:'size'}]- (h) return h.name The name of the match is the same as the name of the match."}, {"query": "Do you know about the South Korean movie theater? What information is there about the other 10 locations in the 2nd tier besides Linzhou?", "cypher": "match (:ENTITY{name:'mirror shadow fascination'}) - [:Relationship*1..2]->(p) where p.name <> 'gold addict' return p.name limit 10"}, {"query": "What is the meaning of the '09 Barzilai T-Show star'?", "cypher": "match (:ENTITY{name:'09 Barzilai T-Show star'}) --(p) with p order by p.name return p.name"}, {"query": "The following is a list of all the works by Ro in Guayaquil, Guanajuato, Guanajuato.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name <>'\u4e07\u91cc' return distinct x.name"}, {"query": "What is the level of protection of the Pomodoro?", "cypher": "match (:ENTITY{name:'Relationship{name:'protection level'}]->(m) return distinct m.name"}, {"query": "The title of the film is \"The Master of the Flying Machine\" and the title of the film is \"The Master of the Flying Machine\".", "cypher": "match (:ENTITY{name:'1944 Master of the Flying Dutchman'}) --(q) with q order by q.name where q.name <> 'entertainment work' return q.name limit 3"}, {"query": "Who sang the last song of the bandit?", "cypher": "match (:ENTITY{name:' last time a rogue'}) <- [:Relationship{name:' representing work'}]- ((m) return distinct m.name"}, {"query": "And I was asked to say, \"What is this substance called R-2-methyl-CBS-vibrate?\"", "cypher": "match (:ENTITY{name:'(R)-2-methyl-CBS-vibrate'}) --(h) with h order by h.name where h.name <> '(R) -(+)-2-Methyl-CBS-oxazaborolidinesolution' return h.name"}, {"query": "Tell me about a piece of work by Jack Chan that has a three-tier relationship?", "cypher": "match (n:ENTITY{name:'mining seat one'}) - [*1..3]->(x) where x.name<>'poker house' return distinct x.name"}, {"query": "Did you have trouble reading the app for Android Cookie Singing 2 for the software introduction of the no less than two-layer relationship?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'Relationship is an Android app\u3002' return distinct x.name"}, {"query": "Can you find 5 facts about the footballer Sinzov Sergey?", "cypher": "match (n:ENTITY{name:'Shinzuov Sergey'}) - [*]->(x) where x.name <> 'footballer' return distinct x.name limit 5"}, {"query": "The following information is provided on the technical regulations for the management of the Huai'an and Huai'an artificial forests published by the State Forestry Department:", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name <> 'National Forestry Bureau' return distinct x.name"}, {"query": "I wonder what the name of the conflict that took place on May 20, 2007 is?", "cypher": "match (:ENTITY{name:'May 20, 2007'}) <- [:Relationship{name:'time of explosion'}]- (q) return q.name"}, {"query": "What is the rated voltage of this 12V10A power adapter you use?", "cypher": "match ((:ENTITY{name:'12V10A power adapter'}) - [:Relationship{name:'rated voltage'}]-> (h) return h.name"}, {"query": "Can you list the five characteristics of the SMG3000?", "cypher": "match (:ENTITY{name:'SMG3000'}) <--(x) - [:Relationship{name:'attributes'}]->(n) return distinct n.name limit 5"}, {"query": "I wonder if the State Department has made any specific reports on the implementation of these, can you name three?", "cypher": "match (:ENTITY{name:'Department of State'}) <- [:Relationship{name:'department'}]- (h) return h.name limit 3"}, {"query": "In addition to literature, I would like to know three things about the use of electronic technology in professional systematic construction practices and research.", "cypher": "match (:ENTITY{name:' Electronic technology application professional systematization of construction practice and research'}) --(m) with m order by m.name where m.name <> 'literary work' return distinct m.name limit 3"}, {"query": "I would like to know what the exam process is for the written test?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What are the most representative works of people born in 1865?", "cypher": "match (:ENTITY{name:'1865'}) <- [:Relationship{name:'date of birth'}]-(n),(n) - [:Relationship{name:'representative work'}]->(x) return distinct x.name limit 1"}, {"query": "What ethnicity are the Chuvash?", "cypher": "match (:ENTITY{name:'Chuvash'}) - [:Relationship{name:'ethnicity'}]->(m) return distinct m.name"}, {"query": "The three professions that graduates of Sichuan University are engaged in", "cypher": "match (:ENTITY{name:' University of Sichuan'}) <- [:Relationship{name:' Graduate School'}]-(n) - [:Relationship{name:' Profession'}]->(q) return distinct q.name limit 3"}, {"query": "Can you please list a computer-specific noun?", "cypher": "match (:ENTITY{name:'exclusive name in the computer domain'}) <- [:Relationship{name:'meaning'}]- (h) return distinct h.name"}, {"query": "And you told me about the 18 switch?", "cypher": "match (:ENTITY{name:'18 switched net'}) --(m) with m order by m.name return m.name"}]