[{"query": "Which two writers' books have been published by the Chinese Youth Press?", "cypher": "match (:ENTITY{name:'China Youth Publishing'}) <- [:Relationship{name:'China Youth Publishing'}]-(x),(x) - [:Relationship{name:'author'}]->(q) return distinct q.name limit 2"}, {"query": "Can you find the five species of bony fish? Can you help me introduce them?", "cypher": "match (:ENTITY{name:'Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 5"}, {"query": "Do you know who is in the same profession as Yang Yong-jun? What are the labels of each person and please list them in order of the number of labels of each person?", "cypher": "match (n:ENTITY{name:'\u8363\u519b'}) - [:Relationship{name:'profession'}]->(:ENTITY) <- [:Relationship{name:'profession'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Can you please tell me about a Southern gravedigger case?", "cypher": "match (:ENTITY{name:'Relationship'}) <- [Relationship{name:'Tomb Raider'}]- (q) return distinct q.name"}, {"query": "Can you tell me who are the actors and columnists? Please tell me the first three.", "cypher": "match (:ENTITY{name:' performance  columnist'}) --(n) return n.name order by n.name limit 3"}, {"query": "I would like to know what is the model of DVD.VCD.SVCD distributor?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Can the word \"d\" be summarized in no more than 10 words?", "cypher": "match (:ENTITY{name:'.dk'}) --(h) with h order by h.name return distinct h.name skip 1 limit 10"}, {"query": "Which institution is the host of the 2012 China Football Association Cup?", "cypher": "match ((:ENTITY{name:'2012 Chinese Football Association Cup'}) - [:Relationship{name:'host'}]-> (h) return h.name"}, {"query": "I'm not sure if you're familiar with the game, but I'm not sure if you're familiar with the game, but I'm not sure if you're familiar with the game.", "cypher": "match (:ENTITY{name:' edible vegetable salad'}) --(m) with m order by m.name where m.name <> 'leisure' return distinct m.name limit 3"}, {"query": "What are the names of the schools that belong to the New Library category?", "cypher": "match (:ENTITY{name:'new library'}) <- [:Relationship{name:'category'}]- ((q),(q) - [:Relationship{name:'known alumni'}]->(p) return distinct q.name,p.name"}, {"query": "What is the representative work of the Catholic Church?", "cypher": "match (:ENTITY{name:' Catholic'}) <- [:Relationship{name:' faith'}]- ((h) - [:Relationship{name:' representing work'}]->(q) return distinct q.name limit 1"}, {"query": "Help me find 10 politicians, where are they all from?", "cypher": "match (:ENTITY{name:'political figure'}) <- [*]-(m),(m) - [:Relationship{name:'place of birth'}]->(n) return m.name,n.name limit 3"}, {"query": "The first thing I want to say is, is that the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story.", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name <>'Meng Xue' return distinct x.name"}, {"query": "What is Sky Tracking?", "cypher": "match (:ENTITY{name:' sky price tracking'}) --(n) with n order by n.name where n.name <> 'entertainment work' return n.name"}, {"query": "Do you know what CDC stands for?", "cypher": "The name of the game is \"Crypt\""}, {"query": "I want to find seven novels, what are their types?", "cypher": "match (:ENTITY{name:'novel'}) <- [*]-(m), (m) - [:Relationship{name:'type'}]->(n) return m.name, n.name limit 7"}, {"query": "What other major accomplishments did Choi have besides being the head of the boiler plant from 2000 to 2014 and the current vice chief engineer (and head of the steel plant) of Nanjing Steel Shares Limited?", "cypher": "match (n:ENTITY{name:' on the small side'}) - [:Relationship{name:' major achievements'}]->(h) where h.name <> 'director of the boiler plant from 2000 to 2014' and h.name <> 'currently vice chief engineer (and director of the steel plant) of Nanjing Steel Shares Limited' return distinct h.name limit 1"}, {"query": "What is the Chinese name of Crash N Burn?", "cypher": "match (:ENTITY{name:'Crash N Burn'}) --(x) return distinct x.name"}, {"query": "Show me some information about Jia Jiang's paintings/artworks in the name of famous school names?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'Jadejiang' return distinct x.name"}, {"query": "The game is based on the popular video game series 123 Labyrinth.", "cypher": "match (:ENTITY{name:'123 labyrinth'}) --(p) with p order by p.name where p.name <> ' game work' return p.name"}, {"query": "Find the personal profile of sports personality Mazak Ares in the second level of relationships.", "cypher": "match (n:ENTITY{name:'Mazak Aras'}) - [*1..2]->(x) where x.name <> 'sportsman' return distinct x.name"}, {"query": "Help me find the other 7 pieces of information in the 3 layers of the Ideal World of John Lennon.", "cypher": "match (:ENTITY{name:'The ideal world of John Lennon'}) - [:Relationship*1..3]-(p) where p.name <> 'film' return p.name limit 7"}, {"query": "I want to ask you, which high school alumnus is Wang Yi Moon?", "cypher": "match (:ENTITY{name:'Wang Xuan Moon'}) <- [:Relationship{name:'known alumni'}]- (m) return distinct m.name"}, {"query": "Give me 10 relevant information about the stress coefficients in the 3 layers, other than the way they are expressed in CP?", "cypher": "match (:ENTITY{name:' stress coefficient'}) - [*1..3]-(p) where p.name <> 'Cp' return distinct p.name limit 10"}, {"query": "Search for 5 major achievements of August 1966?", "cypher": "match (:ENTITY{name:'August 1966'}) <- [:Relationship{name:'date of birth'}]-(m),(m) - [:Relationship{name:'main achievements'}]->(n) return n.name order by n.name limit 5"}, {"query": "Do you know if the flute is a stringed instrument, or if it is a stringed instrument? Help me find 10 information in 3 layers.", "cypher": "match (:ENTITY{name:'flute and harpsichord'}) - [*1..3]->(p) where p.name <> 'stringed stringed instrument' return p.name limit 10"}, {"query": "What is the shortest path between the two layers of the relationship between the force attack and the force attack frequency?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'highest free path'}) - [*..2]-(b:ENTITY{name:'highest free path'})) return count ((p)"}, {"query": "Tell us about five personal details about the four-tier relationship of sports personality DeVoe.", "cypher": "match (n:ENTITY{name:'Dawg's'}) - [*1..4]->(x) where x.name <> 'Sportsman' return distinct x.name limit 5"}, {"query": "Can you find out the online time of 159dnf search service?", "cypher": "match ((:ENTITY{name:'159dnf search engine'}) - [:Relationship{name:'online time'}]-> (n) return n.name"}, {"query": "How about a minute of 10 messages and fall in love with this book on management?", "cypher": "match (q:ENTITY{name:'1 minute in love with management'}) --(m) with m order by m.name return m.name limit 10"}, {"query": "I wonder what comedy shows are there in the UK?", "cypher": "match (p:ENTITY{name:'UK'}) <--(x) --> ((q:ENTITY{name:'comedy'}) return x.name"}, {"query": "Who among the politicians has won a university diploma?", "cypher": "match (:ENTITY{name:'college officer'}) <-[:Relationship{name:'main achievement'}]-(m), (m) -[:Tag{name:'tag'}]->(n) where n.name='political figure' return m.name"}, {"query": "Who is the principal of the Xuzhou City Yue Star Middle School? How many students are there?", "cypher": "match (:ENTITY{name:'Relationship{name:'former principal'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'in the university'}->(m) return m.name as name"}, {"query": "The 12/11 Yunnan Chu-Chiang student dormitory disaster in the newspaper, does it include any victims?", "cypher": "match ((h:ENTITY{name:'12\u00b711 Yunnan Chu-Chiang student dormitory disaster'}) - [:Relationship{name:'victim'}]-> (x) return x.name"}, {"query": "What are the 10 most common labels for new clothes for the fall of 2006?", "cypher": "match (x:ENTITY{name:'06 autumn new outfit'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 10"}, {"query": "Can you tell me who this Claude Lecomte is?", "cypher": "match (:ENTITY{name:'Claude Lecomte'}) --(n) return distinct n.name"}, {"query": "I'm not sure if you know what I mean, but I'm not sure if you know what I mean.", "cypher": "match (:ENTITY{name:'Meng was caught'}) --(x) return x.name limit 5"}, {"query": "Please tell me what kind of relationship is involved in a non-principled dispute in the three levels?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'no principle disputes'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "I'm not sure where the publishers are, let alone the four publications.", "cypher": "match (:ENTITY{name:'publication'}) <- [*]-(m), (m) - [:Relationship{name:'publication'}]->(n) return m.name, n.name limit 4"}, {"query": "I wonder if you can introduce me to the two-tier relationship that Rwandan Sadou Boubakary has with the country.", "cypher": "match (n:ENTITY{name:'Sadou Boubakary'}) - [*1..2]->(x) where x.name<>'Rwanda' return distinct x.name"}, {"query": "Please tell me about a cosmic god architect, who rose up, who wishes to be with the eternal god.", "cypher": "match (:ENTITY{name:'architect of the universe, god of the rising, god of the sun'}) <-[:Relationship{name:'god of the sun'}]-(p) -[:Relationship{name:'god of the sun'}]->(x) return x.name order by x.name limit 1"}, {"query": "Do you know which chemical has a boiling point of 47.4?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Can you recommend 30 free tickets to the scenic spots?", "cypher": "The following is a list of all the different ways The Great Wall of China is credited in the database:"}, {"query": "Can you name a chemical that is shaped like a white or pale yellow crystalline powder?", "cypher": "match (:ENTITY{name:' white or light yellow crystalline powder'}) <- [:Relationship{name:' properties'}]- (q) return distinct q.name"}, {"query": "Can you introduce yourself to the guy who infiltrated C?", "cypher": "match (:ENTITY{name:'C\u541b'}) --(p) return p.name order by p.name"}, {"query": "Who is the author of the whole of the tongue?", "cypher": "match (:ENTITY{name:'s) - [:Relationship{name:'s author'}]-> (m) return distinct m.name"}, {"query": "I want to know the three main ingredients of the tomato sauce besides the tomato and the grapefruit sauce.", "cypher": "match (n:ENTITY{name:'Tuberculosis salad'}) - [:Relationship{name:'main ingredient'}]->(h) with h order by h.name where h.name <> 'Tuberculosis' and h.name <> 'Tuberculosis' return h.name limit 3"}, {"query": "I would like to know about the London Fashion Week in the fall and winter of 2005-06?", "cypher": "match (:ENTITY{name:'05~06 autumn-winter Paris London high fashion release'}) --(q) with q order by q.name return q.name"}, {"query": "What is the shortest path between the two levels of the cabinet, the common people and Liu Hongzhi?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'\u666e\u901a\u6c11'}) -[:Relationship*..2]-(b:ENTITY{name:'\u5b8f\u5fd7'})) return count ((p)"}, {"query": "Did you have trouble listing the five organizations that were founded in 2013?", "cypher": "match (:ENTITY{name:'2013'}) <- [:Relationship{name:'time of establishment'}]- (h) return distinct h.name limit 5"}, {"query": "What are the types of relationships that are involved in the two layers of polytechnics?", "cypher": "The following pages link to the list of UNWIND relationships:"}, {"query": "Do you know anything about the military, like the 032 Type 201 Combined Experimental Submarine?", "cypher": "match (n:ENTITY{name:'032 Type 201 Integrated Experimental Submarine'}) --(h) with h order by h.name where h.name <> 'military' return h.name"}, {"query": "Do you know which chords make up the #1, #3, #5, or #6?", "cypher": "match (:ENTITY{name:'#1\u3001#3\u3001#5'}) <- [:Relationship{name:'composite sound'}]- (m) return distinct m.name"}, {"query": "Do you know what programs CCTV-1 and CCTV-4 have been broadcasting?", "cypher": "match (:ENTITY{name:'CCTV-1\u3001CCTV-4'}) <- [:Relationship{name:' broadcast channel'}]- (x) return distinct x.name"}, {"query": "Can you give me the information of the 5 companies of the cultural company Dalian Hai Star Violin Bands Limited?", "cypher": "match (n:ENTITY{name:'Dalyane Sea's Star Harp Playing Instrument Sales Limited'}) - [*]->(x) where x.name <>'culture' return distinct x.name limit 5"}, {"query": "I want to know the six main works of the actors in this industry?", "cypher": "match (n:ENTITY{name:' actor'}) <- [:Relationship{name:' profession'}]- ((h) - [:Relationship{name:' major works'}]->(p) return distinct p.name limit 6"}, {"query": "There is a word family, the one that says monkey, do you know his name?", "cypher": "match (:ENTITY{name:' word family, \u66f0 \u5b50\u3002'}) <--(n) return n.name"}, {"query": "Please tell me about the Peaches Island in the Sanctuary.", "cypher": "match (:ENTITY{name:'Pink Island'}) --(m) return distinct m.name"}, {"query": "Can you tell me the name of the relationship in the three layers that Ai Weiwei is involved in?", "cypher": "The following is a list of all the links in the search results for Unwind relationships."}, {"query": "The word \"Yay\" is a Chinese word that means \"to be\".", "cypher": "match (:ENTITY{name:'Relationship{name:'from'}]->(m) return distinct m.name"}, {"query": "The Chinese Air Force has been involved in many battles.", "cypher": "match (p:ENTITY{name:'CNAF'}) <- [:Relationship{name:'the warring parties'}]- (h) return distinct h.name"}, {"query": "Do you know the name of the Economic and Trade Forum organized by the Ministry of Commerce of the People's Republic of China?", "cypher": "match (:ENTITY{name:' Ministry of Commerce of the People's Republic of China'}) <- [:Relationship{name:' Host'}]- (x) return x.name"}, {"query": "What is the position of the company that was awarded the title of Zhejiang New Venture Management Limited in 2016?", "cypher": "match (:ENTITY{name:'2016 founded Zhejiang New Venture Management Limited'}) <- [:Relationship{name:'main achievements'}]- ((m) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 1"}, {"query": "What is the name of your idol Jordan Archer and what team is he on?", "cypher": "match ((:ENTITY{name:'Jordan Archer'}) - [:Relationship{name:'Relationship team'}]-> (q) return q.name"}, {"query": "What chemical has a mole volume of 143.1?", "cypher": "match (:ENTITY{name:'143.1'}) <- [:Relationship{name:'Moor volume'}]- (h) return distinct h.name"}, {"query": "What chemical is C7H5N?", "cypher": "The name of the function is the same as the name of the function itself."}, {"query": "The main characters of the game are the devil, the demon, the fairy godmother, the dragon, etc.", "cypher": "match (:ENTITY{name:'devil, demon, fairy, fairy godmother, fairy godmother'}) <- [:Relationship{name:'main character'}]- (n) return n.name"}, {"query": "Can you list some of the noble professions that you can do?", "cypher": "match (:ENTITY{name:'Zhang Chong's}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'profession'}]->(m) return m.name order by m.name limit 1"}, {"query": "I wonder what Zhang Huiyuan does for a living? Can you list five jobs she does?", "cypher": "match (:ENTITY{name:'\u5f20\u6167'}) <- [:Relationship{name:' Chinese name'}]- ((p) - [:Relationship{name:' profession'}]->(x) return distinct x.name limit 5"}, {"query": "Tell me about the personal relationship of football player Mejibel Samal in the 5th level?", "cypher": "match (n:ENTITY{name:'Mejibel Samal'}) - [*1..5]->(x) where x.name <> 'football' return distinct x.name limit 5"}, {"query": "Can anyone give me a list of magnitude 4.0 earthquakes?", "cypher": "match (:ENTITY{name:'4.0 level'}) <- [:Relationship{name:'seismic level'}]- (p) return distinct p.name"}, {"query": "The news is that the company is now offering a new version of the service.", "cypher": "match (:ENTITY{name:'106 channel'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'technology product' return q.name"}, {"query": "Please find the two main awards of Hunan Financial Industry Professional Technology College, but apart from the Hunan Province's only finance-oriented, literate and blended higher education institution and Hunan Province's exemplary higher education institution, Hunan Province's Excellence Higher Education Institute.", "cypher": "match (n:ENTITY{name:'Hunan Institute of Finance and Industry'}) -[:Relationship{name:'main award'}]->(h) where h.name <> 'Hunan Province's only finance, literature and education-oriented higher education institution' and h.name <> 'Hunan Province's exemplary higher education institution, Hunan Province's excellent higher education institution' return distinct h.name limit 2"}, {"query": "What weapons does the PLA have?", "cypher": "match (:ENTITY{name:'People's Liberation Army of China'}) <- [:Relationship{name:'Equipment condition'}]- (p) return distinct p.name"}, {"query": "Can you tell me the Chinese name of the first 10 hadiths of the Euripides?", "cypher": "match (:ENTITY{name:'Eri Rios of Hadith'}) - [:Relationship{name:'Chinese name'}]-> (n) with n order by n.name return distinct n.name limit 10"}, {"query": "I would like to know what the relationship is between the five levels involved in the Ryong Village in Ningxia County?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you name the top 10 news stories for 2006?", "cypher": "match (:ENTITY{name:'2006 all new Hokage'}) --(n) with n order by n.name return n.name limit 5"}, {"query": "How many classes are there in the girls' class? Who is the main character?", "cypher": "Match (:ENTITY{name:'Relationship{name:'main character'}}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'episode'}}) ->(m) return m.name as name"}, {"query": "The 20km long distance race, when did it start, do you remember?", "cypher": "match ((:ENTITY{name:'20 km running away'}) - [:Relationship{name:'origin time'}]-> (p) return p.name"}, {"query": "What is the most representative work of the writer born in 1927?", "cypher": "match (:ENTITY{name:'1927'}) <- [:Relationship{name:'date of birth'}]-(p),(p) - [:Relationship{name:'representative work'}]->(q) return distinct q.name limit 2"}, {"query": "Do you know anything else besides rock music? Help me find 6 information in 3 layers.", "cypher": "match (:ENTITY{name:'want my life'}) - [*1..3]-(p) where p.name <> 'rock music' return p.name limit 6"}, {"query": "What is the name of the relationship between the three levels of the Japanese Embassy in the UK?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Embassy of Japan to the United Kingdom'}) UNWIND relations(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "Can you get me two books for $150?", "cypher": "The following is a list of the most commonly used keywords in the search results."}, {"query": "Please tell me the top 10 articles about Zhang Jianming.", "cypher": "match (:ENTITY{name:'Zhang Family'}) --(n) return n.name order by n.name limit 10"}, {"query": "What is the label for the 1.10 Long Beach Evening News shooting?", "cypher": "match (:ENTITY{name:'1.10 Chansa Evening News Avenue shooting case'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "What is the type and rating of Xuzhou Observation International Airport?", "cypher": "match (:ENTITY{name:'Xuzhou Observation International Airport'}) - [:Relationship{name:'Airport type'}]->(n) return n.name as name union all match (:ENTITY{name:'Xuzhou Observation International Airport'}) - [:Relationship{name:'Airfield level'}]->(m) return m.name as name"}, {"query": "The names of the people who were born in the same time period as the people of the Jiangxi and Vietnamese empires, and what labels each of them has.", "cypher": "match (n:ENTITY{name:' Jiang Vieng's Dynasty'}) - [:Relationship{name:' birthplace'}]->(:ENTITY) <- [:Relationship{name:' birthplace'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC"}, {"query": "Can you find me two movies that were shot in the US?", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'Place of filming'}]-(n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 3"}, {"query": "This is the book you are looking at for a 0-2 year old: Black and White 2, which publisher?", "cypher": "match ((:ENTITY{name:'0-2 years old babybook: black and white 2'}) - [:Relationship{name:'publisher'}]-> (m) return m.name"}, {"query": "Do you know what chemical is called 6-hydroxy-2-hydroxy-methyl?", "cypher": "match (:ENTITY{name:'6-methan-2-methan-methan'}) <- [:Relationship{name:'other name'}]- (p) return p.name"}, {"query": "Please introduce me to 101 Management Fables that affect the world 101 Management Fables that affect the world The Managers book?", "cypher": "match (:ENTITY{name:'101 management proverbs that affect the world'}) --(h) with h order by h.name where h.name <> 'manage books' return h.name"}, {"query": "Do you know this place called 15 Neighborhoods?", "cypher": "match (:ENTITY{name:'15 community'}) --(x) with x order by x.name where x.name <> 'location' return x.name"}, {"query": "Please list the top five advanced schools in the state of Zhejiang.", "cypher": "match (:ENTITY{name:'Advanced school at the level of the Yangzhou Municipal School'}) --(h) return h.name order by h.name limit 10"}, {"query": "Can you tell us about the kind of relationships that the tidal flavor involves in the four layers?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Rela"}, {"query": "I would like to know about five contemporary works that contain mercury seeds in a vase, covered with mud, and flowered to give this gift.", "cypher": "match (n:ENTITY{name:'put mercury seed in a vat, covered with mud, flower placed to give this gift'}) - [:Relationship*]->(x) where x.name <>'contemporary work' return distinct x.name limit 5"}, {"query": "What information do you know about Qingdao Micro-Viewpoint Cultural Media Co., Ltd. other than its headquarters in Shandong Qingdao?", "cypher": "match (:ENTITY{name:'Qingzhou Microscope Cultural Media Co. Ltd'}) - [*1..2]-(p) where p.name <> 'Sandong Qingzhou' return p.name limit 10"}, {"query": "What is the shortest relationship path between LCA and HF-24 fighters in the 3rd level?", "cypher": "The aircraft was also known as the HF-24 (HF-24) and the HF-24 (HF-24) (HF-24)."}, {"query": "Can you recommend 10 online novels for me?", "cypher": "match (:ENTITY{name:'network novel'}) <- [:Relationship{name:'properties'}]- (q) return q.name limit 10"}, {"query": "Can you look at this 1-hydroxybenzyl, can you calculate the molecular weight?", "cypher": "match ((:ENTITY{name:'1-methacrylate'}) - [:Relationship{name:'molecular mass'}]-> (p) return p.name"}, {"query": "List an actor who has appeared in films like Filthy Love.", "cypher": "match (:ENTITY{name:'sweet love'}) --(m) return distinct m.name limit 3"}, {"query": "Please tell me what kind of profession he has since he was born in February 1960?", "cypher": "match (:ENTITY{name:'February 1960'}) <- [:Relationship{name:'date of birth'}]-(n),(n) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 3"}, {"query": "Please tell me the Chinese name of my shop for doing yoga.", "cypher": "match (:ENTITY{name:' shop little ii practice god'}) - [:Relationship{name:' Chinese name'}]-> (n) with n order by n.name return n.name"}, {"query": "I'm wondering if you can tell me which metal is heat treated to burn back to burn?", "cypher": "match (:ENTITY{name:'right fire plus backfire'}) <- [:Relationship{name:'heat treatment'}]- (n) return n.name"}, {"query": "Can you tell me the name of the relationship within the three layers that the Huawei G730 is involved in?", "cypher": "The following pages link to the list of UNWIND relationships:"}, {"query": "Do you know about the Sichuan Province Mombasa Middle School? What information is there besides the public middle school, please find the other 8 information in the 2nd layer", "cypher": "match (:ENTITY{name:'Shanghai Secondary School'}) - [*1..2]->(p) where p.name <> 'public secondary school' return p.name limit 8"}, {"query": "I'm not sure what you mean by \"perfume\".", "cypher": "match (:ENTITY{name:'sweet'}) --(n) return distinct n.name"}, {"query": "Who is the singer of the song that susan mentioned?", "cypher": "match (:ENTITY{name:'susan says'}) - [:Relationship{name:'song originally sung'}]->(n) return n.name as name union all match (:ENTITY{name:'susan says'}) - [:Relationship{name:'associated album'}]->(m) return m.name as name"}, {"query": "Can you provide a CAS number for 2-nitrogen N-oxide salts?", "cypher": "match ((q:ENTITY{name:'2-N-oxide salt'}) - [:Relationship{name:'CAS log number'}]-> (p) return p.name"}, {"query": "What does Jo-Jin do?", "cypher": "match (:ENTITY{name:'Joe'}) <--(h),(h) - [:Relationship{name:'profession'}]->(p) return distinct p.name"}, {"query": "Can you tell me what the relationship is between the three layers of the beauty of the zodiac?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations)"}, {"query": "What can you say about the five types of relationships that Noel Coward talks about?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Noel Coward'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you list one violent terrorist attack?", "cypher": "match (:ENTITY{name:'violent terrorist attack'}) <- [:Relationship{name:'nature of case'}]- (h) return h.name"}, {"query": "The 10/1 Las Vegas casino shooting reported in the newspapers was so horrific, where was the location?", "cypher": "match ((:ENTITY{name:'10\u00b71 Las Vegas casino shooting'}) - [:Relationship{name:'place of the incident'}]-> (q) return q.name"}, {"query": "There is a 302-page book, can you tell me the top 5 information about its price?", "cypher": "The following is a list of the most commonly used tags for the game:"}, {"query": "Can you name three synonyms for plants in this genus?", "cypher": "match (:ENTITY{name:'flower'}) <- [:Relationship{name:'species'}]-(m),(m) - [:Relationship{name:'synonyms'}]->(n) return n.name order by n.name limit 3"}, {"query": "The following is a list of 5 famous people who have worked in the leaf industry and in the book trade.", "cypher": "match (n:ENTITY{name:'shop and bookstore'}) - [*1..5]->(x) where x.name<>'shop' return distinct x.name limit 5"}, {"query": "What is a stomach bug? Please give me the first three facts about it.", "cypher": "match (:ENTITY{name:'belly button general'}) --(n) return n.name order by n.name limit 3"}, {"query": "What is the magnetometer used for?", "cypher": "match (:ENTITY{name:'magnetometer'}) - [:Relationship{name:'use'}]->(m) return distinct m.name"}, {"query": "The man is described as Su-yeon, a model, on October 22, 2011 at 10 pm Xu, Su-yeon posted several microblogs, live-streamed the suicide process, and uploaded photos of sleeping pills saying that he was going to eat it lightly and walk quietly.", "cypher": "match (:ENTITY{name:'Sou-chan, model, 22 October 2011 at 10 pm, Su-chan sent several microblogs, live-streamed the suicide process, and uploaded sleeping pill photos that said that she wanted to eat it lightly, and quietly walk away."}, {"query": "When was Yang Kang born?", "cypher": "Match ((:ENTITY{name:'spoon'}) - [:Relationship{name:'date of birth'}]-> (n) return n.name"}, {"query": "What is the synonym of high-end?", "cypher": "match (:ENTITY{name:'highly skilled'}) - [:Relationship{name:'near term'}]->(m) return distinct m.name"}, {"query": "What honorary awards has the current principal, Yang Jinlock, received? Can you name three?", "cypher": "match (:ENTITY{name:'metal lock'}) <- [:Relationship{name:'currently rector'}]-(x),(x) - [:Relationship{name:'main award'}]->(n) return distinct n.name limit 3"}, {"query": "Give me the 298-page series on higher education planning materials, computer science and technology, and the information within the two-tier relationship.", "cypher": "match (n:ENTITY{name:' Higher education planning materials; computer science and technology series'}) - [:Relationship*1..2]->(x) where x.name <>'298 pages' return distinct x.name"}, {"query": "What are the names of the top five Belgian nationals and how do they weigh?", "cypher": "match (:ENTITY{name:'Belgium'}) <- [:Relationship{name:'nationality'}]-(x) - [:Relationship{name:'weight'}]->(n) return x.name,n.name skip 2 limit 10"}, {"query": "What are the books by the author of Holenbeck and what are they classified as?", "cypher": "match (:ENTITY{name:'Holbenbeck'}) <- [:Relationship{name:'author'}]-(h),(h) - [:Tag{name:'tag'}]->(q) return distinct h.name,q.name"}, {"query": "Please share who Daniel Greaves is.", "cypher": "match (:ENTITY{name:'Daniel Greaves'}) --(q) return q.name order by q.name limit 3"}, {"query": "What were the people born on March 20, 1820? Can you tell me their main achievements?", "cypher": "match (:ENTITY{name:'20 March 1820'}) <- [:Relationship{name:'time of birth'}]-(h),(h) - [:Relationship{name:'main achievement'}]->(q) return distinct h.name,q.name"}]