[{"query": "Please tell me the name of the movie starring Liu Yiu, Matsusaka Michili, Yuyun Mi-Li, Murakami Yuming and others is Liu Yi?", "cypher": "match (:ENTITY{name:'Yun Yu, Matsusaka Michili, Yuki, and Yuki's name}) <- [:Relationship{name:'starring'}]- (p) return p.name"}, {"query": "Which five publishers publish all the medical books?", "cypher": "match (:ENTITY{name:' medical books'}) <- [:Tag{name:' labels'}]-(x),(x) - [:Relationship{name:' publishing house'}]->(q) return distinct q.name limit 5"}, {"query": "Please list the white-tailed eagles in France.", "cypher": "match (:ENTITY{name:' French'}) <- [:Relationship{name:' distribution area'}]- (mn) - [:Relationship{name:' species'}]->(n:ENTITY{name:' white frog'}) return mn.name"}, {"query": "Can you list three other descriptions of Tang Yifu, including Jingdong, and the Han Chinese?", "cypher": "match (n:ENTITY{name:'Tong's'}) - [:Describe{name:'description'}]->(h) with h order by h.name where h.name <> 'Jilin Dong-Tong' and h.name <> 'Han' return h.name limit 3"}, {"query": "What is the 1-bit EINECS login number?", "cypher": "The following is a list of all the different ways The Winner is credited in the database:"}, {"query": "What are the 10 areas of application of substances in medical science?", "cypher": "match (:ENTITY{name:'medicine'}) <- [:Relationship{name:'applied discipline'}]-(x),(x) - [:Relationship{name:'scale of application'}]->(p) return x.name order by x.name,p.name limit 10"}, {"query": "Tell me, what are the awards that people who are 185 have won?", "cypher": "match (n:ENTITY{name:'185cm'}) <- [:Relationship{name:'height'}]- ((q) - [:Relationship{name:'main award'}]->(x) return distinct x.name limit 5"}, {"query": "Do you know which songs are composed by Guo Shi? Can you tell me 10 songs?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database:"}, {"query": "There is a game that is entirely in English called 101-in-1 Games, what is its name in Chinese?", "cypher": "Match (:ENTITY{name:'101-in-1 Games'}) <- [:Relationship{name:'other names'}]- (n) return n.name"}, {"query": "In addition to Sun Liong, the author of this book provides me with six pieces of information in the second layer of the book, which is a study of the international trend of accounting standards under economic globalization.", "cypher": "match (:ENTITY{name:' Research on international convergence under accounting standards under economic globalization'}) - [*1..2]-(p) where p.name <> 'Sun Liyong' return distinct p.name limit 6"}, {"query": "Do you know the types of relationships within the five levels of the two Jiangsu City Prisons in Jilin?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Jilin City Jiang City Prison'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 2"}, {"query": "What is the music composed by Chow Chow?", "cypher": "match (:ENTITY{name:'sweet'}) <- [:Relationship{name:'sweet'}]- (x) return x.name"}, {"query": "Do you know the name of the combination where Joan Gr\u00e0cia is located?", "cypher": "match (:ENTITY{name:'Joan Gr\u00e0cia'}) <- [:Relationship{name:' member'}]- (x) return x.name"}, {"query": "I want three of you to be human April Day: Lin Feng, because of this work, information in the two-tier relationship?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' you are human April Fools'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "What language teachers do you know?", "cypher": "match (:ENTITY{name:' language teacher'}) <--(n) return n.name"}, {"query": "Do you know what chemical formula is C3H6Br2?", "cypher": "match (:ENTITY{name:'C3H6Br2'}) <- [:Relationship{name:'chemical formula'}]- (h) return distinct h.name"}, {"query": "I remember a case involving three miners, what was the name of it?", "cypher": "match (:ENTITY{name:'3 miners'}) <- [:Relationship{name:'person'}]- (n) return n.name"}, {"query": "I want to know what are the characteristics of textile primary school?", "cypher": "match (:ENTITY{name:'Textile first secondary school'}) - [:Relationship{name:'attributes'}]-> (p) return p.name skip 2"}, {"query": "And what will explain to you the time of the cold-blooded?", "cypher": "match (:ENTITY{name:'Cold War'}) - [:Relationship{name:'Author'}]->(n) return n.name as name union all match (:ENTITY{name:'Cold War'}) - [:Relationship{name:'Year'}]->(m) return m.name as name"}, {"query": "Which TV series won the BAFTA Award for Best Television Series? Name one.", "cypher": "match (:ENTITY{name:' British Academy of Film and Television Arts BAFTA Award for Best Television Series'}) --(m) return m.name order by m.name limit 1"}, {"query": "The recent Guangzhou International Food Expo 2011 was good, do you know which supporting unit?", "cypher": "match ((:ENTITY{name:'2011 Guangzhou International Food Fair'}) - [:Relationship{name:'support unit'}]-> (m) return m.name"}, {"query": "Do you have any information about some of the major achievements of Lin Qian? Can you give me 5?", "cypher": "match (:ENTITY{name:' in the link'}) <- [:Relationship{name:' in Chinese name'}]- ((q) - [:Relationship{name:' major achievements'}]->(n) return n.name order by n.name limit 5"}, {"query": "Can you tell me what kind of relationships are covered in the three layers of the novel?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'Santa Muerte'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3 This is a list of all the different ways REL is credited in the database."}, {"query": "Can you list the three competitions that are controlled by Huynh?", "cypher": "match (:ENTITY{name:'Hoon'}) <- [:Relationship{name:'regulation'}]- (m) return m.name limit 3 The name of the game is the same as the name of the game itself"}, {"query": "Can you tell me about the three-tiered relationship in the Chinese border travel map published by Haitian Press?", "cypher": "match (n:ENTITY{name:'China's border crossing map'}) - [:Relationship*1..3]->(x) where x.name <>'Hai Tian Publishing' return distinct x.name"}, {"query": "The following is a detailed description of the three-tier relationship of the 80.24 square kilometers of Lode Ark:", "cypher": "match (n:ENTITY{name:'Ludiarch'}) - [*1..3]->(x) where x.name <>'80.24 sq km' return distinct x.name"}, {"query": "Please help me find out 5 other information about the horror movie killer girls in the second floor of the dormitory.", "cypher": "match (:ENTITY{name:'murdered girl's dorm'}) - [:Relationship*1..2]-(p) where p.name <> 'surprise movie' return p.name limit 5"}, {"query": "How about a 10,000-word English dictionary?", "cypher": "match (:ENTITY{name:'10000 common English words'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name"}, {"query": "Please tell me what exhibition dates are available for 2012-12-22 - 2012-12-24?", "cypher": "The following is a list of the most popular games on the Wii U."}, {"query": "Please list the 10 principals who are the main departments of Chen's school.", "cypher": "match (:ENTITY{name:'Chen Zhen'}) <- [:Relationship{name:'currently rector'}]-(n),(n) - [:Relationship{name:'main faculty'}]->(q) return q.name order by q.name limit 10"}, {"query": "What are the publications published by the Central Literature Publishing House and what is his price range?", "cypher": "match (:ENTITY{name:'Central Literature Publishers'}) <- [:Relationship{name:'Publishers'}]-(h),(h) - [:Relationship{name:'Pricing'}]->(q) return distinct h.name,q.name"}, {"query": "Do you know that the book literature is published by Electronic Industries Publishing?", "cypher": "match (:ENTITY{name:'electronic industry publisher'}) <- [:Relationship{name:'publisher'}]- (x) return x.name limit 10"}, {"query": "What are the categories of skating and what equipment is required?", "cypher": "match (:ENTITY{name:'Skiing'}) - [:Relationship{name:'Classification'}]->(n) return n.name as name union all match (:ENTITY{name:'Skiing'}) - [:Relationship{name:'Skiing equipment'}]->(m) return m.name as name"}, {"query": "What songs are sung by Lin Xie, Liang Wenhong and Lin Xie?", "cypher": "The song is also known as \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Rela"}, {"query": "What is the name of the chicken?", "cypher": "match (:ENTITY{name:'': 1950), born in Hunan, Hunan, No. black bean, National level artist, member of Chinese calligraphers association, member of China Union of Writers' Book Painting Center, member of the Helangyang calligraphers association, member of the Chinese Academy of Sciences, member of the World Organization of UNESCO."}, {"query": "What other labels does the CDC have besides publications? (list no more than ten)", "cypher": "match (:ENTITY{name:'0-3 years old Infant and toddler disease prevention and care overall'}) - [:Tag{name:'label'}]-> (m) with m order by m.name where m.name <> 'publication' return m.name limit 10"}, {"query": "I would like to know the full contents of the 121-page classic literature called Treasury: Education of Love?", "cypher": "match (n:ENTITY{name:'Classical literature named Treasury: Education of Love'}) - [:Relationship*]->(x) where x.name <>'121 pages' return distinct x.name"}, {"query": "What are the types of relationships that are involved in the two layers of the shopping cart?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'shopping cart'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "The question is, how do you do it in the three-layer relationship of the single-cooking green leather steamer that breaks freeze?", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'breaking the gas freeze' return distinct x.name"}, {"query": "Look at the software information within the three-layer relationship of a 2MB software-sized GPS thermometer.", "cypher": "match (n:ENTITY{name:'GPS thermometer'}) - [:Relationship*1..3]->(x) where x.name <>'2 MB' return distinct x.name"}, {"query": "Please help me find 5 books for $18.80 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'18.80\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Tell me about the three-layered relationship between the reborn computer clouds of midnight smoking creators and the fictional information bubble.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <>'midnight smoking' return distinct x.name"}, {"query": "Find me 7 places to see in the Khothai Desert, besides 100 tickets and the address in Nanchang City, Jiangxi Province.", "cypher": "match (n:ENTITY{name:'Kuta Desert Scenic Area'}) -->(h) with h order by h.name where h.name <> '100\u5143' and h.name <> 'Jiangxi Province Nanchang City' return h.name limit 7"}, {"query": "Do you know which school is the main achievement of the National School of Advanced Research in Education and Science in Hohhot and the Advanced School of Educational Science and Research in Hont City?", "cypher": "match (:ENTITY{name:'National Institute of Advanced Studies in Education and Research in Germany and the University of Kent's School of Education and Research'}) <- [:Relationship{name:'main award'}]- (p) return distinct p.name"}, {"query": "What website sells such cheap snacks?", "cypher": "match (:ENTITY{name:'thing cheap snacks'}) <- [:Relationship{name:'provided'}]- (m) return m.name"}, {"query": "Can I get three books on management to read?", "cypher": "The following is a list of the most commonly used tags in the database:"}, {"query": "The Chinese language name of the Beijing-based company is Liu Xiaobo.", "cypher": "match (:ENTITY{name:'Beijing Liu Shandjian Da Technology Books Ltd'}) <- [:Relationship{name:'brand'}]-(n) - [:Relationship{name:'foreign language name'}]->(x) return distinct x.name limit 1"}, {"query": "The college was founded in 2004 and its five main departments are in addition to the E-IT.", "cypher": "match (m:ENTITY{name:'2004'}) <- [:Relationship{name:'time of founding'}]-(q) - [:Relationship{name:'main faculty'}]->(h) where h.name <> 'electronic information technology' return distinct h.name limit 5"}, {"query": "Find out 5 personal details about footballers that are also on the list.", "cypher": "match (n:ENTITY{name:' upper force also'}) - [*]->(x) where x.name <> 'footballer' return distinct x.name limit 5"}, {"query": "What is the shortest distance between Shenyang City College and Dalian University of Technology?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Shenyang City College'}) - [*..2]-(b:ENTITY{name:'Dalyane University of Technology'})) return count ((p)"}, {"query": "Show me the two books in plain text and tell me who wrote them.", "cypher": "match (:ENTITY{name:'plain'}) <- [:Relationship{name:'plain'}]-(h),(h) - [:Relationship{name:'author'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "Do you know what the label attributes are about the historic 12/24 library jumping in the Great Western District of China?", "cypher": "match (:ENTITY{name:'12\u00b724 Central Central District Library West Tower Jump Event'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> ' historical event' return m.name"}, {"query": "Can you say that a representative work is someone you meet?", "cypher": "match (:ENTITY{name:'meet'}) <- [:Relationship{name:'represent the work'}]- (x) return x.name limit 1"}, {"query": "Help me find the 10 species of molluscs", "cypher": "match (:ENTITY{name:' soft animal'}) <- [:Relationship{name:' gate'}]-(m) return distinct m.name limit 10"}, {"query": "What is the name of the old-time song sung by Liu Shaofeng and Liu Yifei?", "cypher": "match (:ENTITY{name:'Shang Shao's'}) <- [:Relationship{name:'song originally sung'}]-(m), (m) - [:Relationship{name:'song style'}]->(n) where n.name='Goldwind' return distinct m.name"}, {"query": "What is this thing called 1-Kestose?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What are the main achievements of Pyotr Vladimir Mitrofanovich?", "cypher": "match (:ENTITY{name:'Petrov Vladimir Mitrofanovich--1920 born in Astrakhan\u3002'}) <- [:Describe{name:'description'}]-(m) - [:Relationship{name:'main achievements'}]->(n) return distinct n.name"}, {"query": "Is it true that people born in the Hebei province of T\u014dky\u014d are dry?", "cypher": "match (:ENTITY{name:'Todoga, Hebei Province'}) <- [:Relationship{name:'Born'}]-(m),(m) - [:Relationship{name:'Profession'}]->(n) return distinct n.name"}, {"query": "What are the works of the Chinese language and literature publishing house?", "cypher": "match (:ENTITY{name:'Chinese pronunciation: like publishing house'}) <- [:Relationship{name:'publishing house'}]-(h),(h) - [:Relationship{name:'publication time'}]->(q) return distinct h.name,q.name"}, {"query": "Do you know what the name of the relationship is that involves the essential elements of entrepreneurship in the three layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' business essential'}) UNWIND relationships(path) AS rel return distinct rel.name limit 5"}, {"query": "The date of death of the official from Nanchang, Kang Yong-ho, is written in the history books?", "cypher": "match ((:ENTITY{name:'\u5eb7\u690d'}) - [:Relationship{name:'date of death'}]-> (x) return x.name"}, {"query": "I want to know what the relationship is between the three levels of the Royal University of Cavendish?", "cypher": "The following pages link to The University of the Pacific:"}, {"query": "Can you help me find 10 free tickets to the sights?", "cypher": "Match (n:ENTITY{name:' free'}) <- [:Relationship{name:' ticket'}]- (mn) return mn.name limit 10"}, {"query": "Please tell us about the personal information of the third level relationship of Qatar's Dorzadeh Valid Nahng.", "cypher": "match (n:ENTITY{name:'Dorzadeh Valid Nahng'}) - [*1..3]->(x) where x.name<>'Qatar' return distinct x.name"}, {"query": "What events and exhibitions have been held in Shanghai, China? Can you name six?", "cypher": "match (:ENTITY{name:'China Shanghai'}) <- [:Relationship{name:'location'}]- (h) return h.name limit 6"}, {"query": "Did you know that the 1983 Panda Gold, Silver and Bronze commemorative coin was issued in a few sets?", "cypher": "match ((:ENTITY{name:'1983 Panda Gold and Silver Bronze Commemorative Coin'}) - [:Relationship{name:' quantity'}]-> (x) return x.name"}, {"query": "Can you tell me what the most popular profession is?", "cypher": "match (x:ENTITY{name:'\u7f72\u6e10\u95fb'}) <- [:Relationship{name:' alias'}]- ((p) - [:Relationship{name:' profession'}]->(m) return distinct m.name"}, {"query": "Can you name three species of plants in the family Parrots?", "cypher": "match (x:ENTITY{name:'Crow's nest'}) <-[:Relationship{name:'Crow's nest'}]- (h) return h.name limit 3 This is a list of all the different ways Crow's nest is credited in the database."}, {"query": "Which company makes the A-5 attack aircraft?", "cypher": "match (:ENTITY{name:'A-5 attacker'}) - [:Relationship{name:'production unit'}]->(m) return distinct m.name"}, {"query": "What else is there besides the gift of the white horse king?", "cypher": "match (:ENTITY{name:'Five-word classic'}) <- [:Relationship{name:'Literary genre'}]-(m), (m) - [:Relationship{name:'Author'}]->(:ENTITY{name:' Cao\u690d'}) where m.name <>'gifted white horse king' return m.name limit 3"}, {"query": "On the advanced worker, the third grade of memory, awarded the best secondary school language teacher in Shandong province, his representative is the language characteristics of the practical language of the language.", "cypher": "match (:ENTITY{name:' advanced worker, third grade credential, awarded as the best secondary school language teacher in Shandong Province'}) <- [:Relationship{name:' major achievement'}]-(x),(x) - [:Relationship{name:' representative work'}->(h) where h.name <> 'linguistic characteristics of the tang tang tang' return distinct h.name limit 5"}, {"query": "Help me find a soup made with golden needles.", "cypher": "match (:ENTITY{name:'soup'}) <- [:Relationship{name:'main ingredient'}]- ((m), (m) - [:Relationship{name:'category'}]->(n) where n.name='soup' return distinct m.name"}, {"query": "Please help me check out the simple Chinese for grain oil machinery: Leaf turret windshield 2 layer relationship?", "cypher": "match (n:ENTITY{name:'grain oil machinery: leaf wheel closed winder'}) - [:Relationship*1..2]->(x) where x.name <>'simplified Chinese' return distinct x.name"}, {"query": "Can you find a tag for June 24?", "cypher": "match (:ENTITY{name:'June 24'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name limit 1"}, {"query": "Can you recommend 5 books weighing 798g?", "cypher": "The following is a list of the most commonly used parameters for the calculation of the mass of a particle."}, {"query": "Are you looking for a career in attending a Genghis Khan?", "cypher": "match (:ENTITY{name:'\u5e2d\u6052'}) <- [:Relationship{name:'Chinese name'}]- ((m) - [:Relationship{name:'profession'}]->(h) return distinct h.name"}, {"query": "Can you help me find two schools that have been awarded the Sichuan Provincial School of Experimental Teaching Model Award?", "cypher": "match (:ENTITY{name:'School of experimental teaching in Sichuan Province'}) <- [*]-(m), (m) - [:Relationship{name:' category'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "What is the meaning of the word 1976 apart from economic?", "cypher": "match (:ENTITY{name:'1976'}) --(m) with m order by m.name where m.name <> 'economy' return m.name limit 5"}, {"query": "Can you find me someone who has been a net singer, a radio host, and his school?", "cypher": "match (:ENTITY{name:' network singer, radio host\u3002'}) <- [:Describe{name:' description'}]-(h),(h) - [:Relationship{name:' graduate school'}]->(q) return distinct h.name,q.name"}, {"query": "You said 21 Days of Happiness: What is the label of my other life?", "cypher": "match (:ENTITY{name:'21 days of happiness: my other life'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name"}, {"query": "0375 Capital, is there a rubber tag in this place?", "cypher": "match (:ENTITY{name:'0375 capital'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'location' return n.name"}, {"query": "Do you have a nickname for someone who has been a member of the party, a librarian, a national level screenwriter, etc.?", "cypher": "match (:ENTITY{name:'party member, director, national level screenwriter etc'}) <- [:Relationship{name:'profession'}]-(n),(n) - [:Relationship{name:'alias'}]->(p) return distinct p.name"}, {"query": "Can you ask me about the nature of the 100 Christmas gifts?", "cypher": "match (:ENTITY{name:'100 Christmas presents'}) - [:Tag{name:'tags'}]-> (p) with p order by p.name return p.name"}, {"query": "I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie, and I'm going to be a techie.", "cypher": "match (n:ENTITY{name:'friendly'}) - [*1..4]->(x) where x.name <> 'technology product' return distinct x.name"}, {"query": "Which of the Magic Blue Svanes is rock music?", "cypher": "match (p:ENTITY{name:'Mother of Magic Blue Swan'}) <--(x) -->(q:ENTITY{name:'rock'}) return x.name"}, {"query": "What are the items or places that are related to the building materials?", "cypher": "match (:ENTITY{name:' building material'}) <- [:Relationship{name:' attribute'}]- (h) return h.name limit 5"}, {"query": "In five words, tell me what is the first album?", "cypher": "match (:ENTITY{name:'1st Album'}) --(n) with n order by n.name return n.name limit 5"}, {"query": "Can you find three characters in the story and help me introduce them?", "cypher": "match (:ENTITY{name:'Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return m.name, n.name limit 3"}, {"query": "What else do you know about the M110 203mm self-propelled grenade besides the weaponry?", "cypher": "match (:ENTITY{name:'M110 type 203mm self-propelled grenade gun'}) - [*1..3]-(p) where p.name <> 'weapon equipment' return distinct p.name limit 5"}, {"query": "What are the events in Seattle, USA? Can you name six?", "cypher": "match (:ENTITY{name:' Seattle, USA'}) <- [:Relationship{name:' location'}]- (n) return n.name limit 6"}, {"query": "What are the types of relationships within the three layers of the problem you talk about Zhang Xiaoming?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) ("}, {"query": "How does 139 PushEmail understand?", "cypher": "match (:ENTITY{name:'139 PushEmail'}) --(q) with q order by q.name return q.name"}, {"query": "Help me find three senior agricultural experts, where are they from?", "cypher": "match (:ENTITY{name:' senior agricultural expert'}) <- [*]-(m), (m) - [:Relationship{name:' place of birth'}]->(n) return m.name, n.name limit 3"}, {"query": "Can you show me a representative work of this man who died in 1989?", "cypher": "match (:ENTITY{name:'1989'}) <- [:Relationship{name:'date of death'}]-(m) - [:Relationship{name:'represented work'}]->(x) return x.name order by x.name limit 1"}, {"query": "What Bronze Age artifacts have been found in Henan Province?", "cypher": "match (:ENTITY{name:' Henan Province'}) <- [:Relationship{name:'Outland Province'}]-(m), (m) - [:Relationship{name:'Dynasty'}]->(n) where n.name='Bronze Age' return distinct m.name"}, {"query": "Can you say that the three representative works are the characters of the mineral crystal () () (1906)?", "cypher": "match (:ENTITY{name:'Crystalline mineral clay ((1906) '}) <- [:Relationship{name:'represents work'}]- (p) return distinct p.name limit 3"}, {"query": "I want to know which publisher is the science fiction show Hello Aliens?", "cypher": "match ((:ENTITY{name:'Hi Aliens'}) - [:Relationship{name:'Issuing company'}]-> (m) return m.name"}, {"query": "Who has a list of five-letter words?", "cypher": "match (:ENTITY{name:' word count\u3002'}) <- [:Describe{name:' description'}]-(q) return distinct q.name limit 5"}, {"query": "Can you say one more label about the horror movie 13 Monsters Island?", "cypher": "match (:ENTITY{name:'13 weird island'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'surprise movie' return h.name limit 1"}, {"query": "The following 1100-ton alloy?", "cypher": "match (:ENTITY{name:'1100 ton alloy'}) --(h) with h order by h.name return h.name"}, {"query": "Help me find two 5A tourist spots in Nanjing.", "cypher": "match (:ENTITY{name:'Nanjing'}) <- [:Relationship{name:'city'}]-(m), (m) - [:Relationship{name:'attraction level'}]->(n) where n.name='national tourist attraction of level 5A' return distinct m.name limit 2"}, {"query": "Do you know which earthquake was the one that struck on October 23, 2004 at 17:56 (JST)?", "cypher": "match (p:ENTITY{name:'2004-10-23 17:56(JST) '}) <- [:Relationship{name:'moment of the quake'}]- (h) return distinct h.name"}, {"query": "Can you tell me 5 of the 5 people in a relationship that are related to Clements Chris who is 1.75m tall?", "cypher": "match (n:ENTITY{name:'Clements Chris'}) - [*1..5]->(x) where x.name <>'1.75 m' return distinct x.name limit 5"}, {"query": "The 11th Degree Children's series has a drama film label and what other labels?", "cypher": "match (:ENTITY{name:'11 degree children's series microfilm'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'drama film' return n.name"}, {"query": "Where is the Shanghai Botanical Garden? How much are the tickets?", "cypher": "match (:ENTITY{name:'Shanghai Botanical Garden'}) - [:Relationship{name:'Location'}]->(n) return n.name as name union all match (:ENTITY{name:'Shanghai Botanical Garden'}) - [:Relationship{name:'Ticket price'}]->(m) return m.name as name"}, {"query": "Can you list five Japanese anime films?", "cypher": "The game is based on the manga series of the same name by Hiroaki Nakamura."}, {"query": "Tell me about how many businesses have been started in 96 years?", "cypher": "match (p:ENTITY{time:'1996'}) return count ((p)"}, {"query": "10 Corso Como is the world's first fashion design concept store, do you know where it was founded?", "cypher": "match ((:ENTITY{name:'10 Corso Como'}) - [:Relationship{name:'place of creation'}]-> (x) return x.name"}, {"query": "Do you know of any earthquakes that have a depth of 12 kilometers?", "cypher": "match (:ENTITY{name:'12 km'}) <- [:Relationship{name:'depth of the quake'}]- (m) return distinct m.name"}, {"query": "Give me a list of Venezuelan footballers, I want five, okay?", "cypher": "match (p:ENTITY{name:'Venezuela'}) <--(x) -->(q:ENTITY{name:'footballer'}) return x.name limit 5"}, {"query": "I wonder which book's ISBN is 9787308054591?", "cypher": "The following is a list of all the different ways The Greatest Showman is credited in the database."}, {"query": "I'm wondering if you can tell me which sub-type/class of aircraft is E-Fan 4.0?", "cypher": "match (:ENTITY{name:'E-Fan4.0'}) <- [:Relationship{name:'subtype'}]- (p) return distinct p.name"}, {"query": "A travel strategy that is all about the daily life in East Africa, with specific themes and expresses the spirit of hospitality, regional unity and spiritual experience, is called \"What's Up?\"", "cypher": "match (:ENTITY{name:'Hospitality, spiritual experience of regional unity\u3002'}) <- [:Relationship{name:'East African daily life has a specific theme'}]- (q) return distinct q.name"}, {"query": "The game is a game that offers a little game of memory stone in three layers of relationships.", "cypher": "match (n:ENTITY{name:' memory stone'}) - [:Relationship*1..3]->(x) where x.name <> 'wisdom game' return distinct x.name"}, {"query": "Do you know the company brands that were founded in 2014?", "cypher": "match (:ENTITY{name:'2014'}) <- [:Relationship{name:'time of establishment'}]- (x) return x.name limit 2"}, {"query": "Where is the address of Guangdong Postal and Telecommunication Vocational Technical College? What are the major departments?", "cypher": "match (:ENTITY{name:'Canton Postal and Telecommunications Vocational College'}) - [:Relationship{name:'School address'}]->(n) return n.name as name union all match (:ENTITY{name:'Canton Postal and Telecommunications Vocational College'}) - [:Relationship{name:'Main Faculty'}]->(m) return m.name as name"}, {"query": "Do you know what kind of activity has 13,000 volunteers?", "cypher": "match (:ENTITY{name:'13000+ volunteers'}) <- [:Relationship{name:'number'}]- (q) return q.name"}, {"query": "Is there another Chinese name for the Klingon word for \"hate\"?", "cypher": "match (h:ENTITY{name:'Relationship{name:'Chinese name'}]-> (m) with m order by m.name where m.name <> 'Relationship{name:'Chinese name'} return m.name"}, {"query": "Can you recommend a game for Android (version 2.1 and above)?", "cypher": "match (n:ENTITY{name:'Android (versions 2.1 and above) '}) <- [:Relationship{name:' applicable'}]- (m) return distinct m.name"}, {"query": "Do you know which earthquake had a magnitude of 31.54 degrees north latitude and 100.48 degrees east longitude?", "cypher": "match (:ENTITY{name:'Northeast 31.54 degrees, East 100.48 degrees'}) <- [:Relationship{name:'Earthquake in the Nebula'}]- (h) return distinct h.name"}, {"query": "Can you list the five places where 92 Yangtze scholars have their PhDs?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)."}, {"query": "Do you know which novels are available on the free novel online?", "cypher": "match (:ENTITY{name:' free novel network'}) <- [:Relationship{name:' connecting platform'}]- (p) return distinct p.name"}]