[{"query": "Check out what the rare foreign name in the past is called and where it originated.", "cypher": "match (:ENTITY{name:'Relationship{name:'foreign language name'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'work originated'}) ->(m) return m.name as name"}, {"query": "What chemical is CAS number 528-29-0?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What is the difference between a close-up and a counter-clockwise?", "cypher": "The name of the game is \"Relationship\" (Relationship) - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - [Relationship] - ["}, {"query": "Do you know how many Chinese-written works are representative?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(x),(x) - [:Relationship{name:'representative work'}]->(p) return distinct p.name limit 5"}, {"query": "I wonder who will be performing at the 2012 Goku Kin Naning Concert?", "cypher": "Match (s) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) (m) ("}, {"query": "How to find the 5 most unlikely cat-mocking works in the 6th level of relationships?", "cypher": "match (n:ENTITY{name:'mocking cat'}) - [*1..6]->(x) where x.name <>'square' return distinct x.name limit 5"}, {"query": "The ancient tombs are also crazy and what is the shortest path to the two levels of the village?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Ancient Tombs are also crazy'}) - [:Relationship*..2]-(b:ENTITY{name:'Zodiac Legend'})) return count ((p)"}, {"query": "Which exhibitions are organized by Beijing Global Bowie International Exhibition Co., Ltd?", "cypher": "match (:ENTITY{name:'Beijing Global Bowie International Exhibition Co. Ltd'}) <- [:Relationship{name:' organizational unit'}]- (n) return n.name"}, {"query": "What can be made with pork rind and potatoes?", "cypher": "match (:ENTITY{name:' pork rind, potatoes, oatmeal'}) <- [:Relationship{name:' main ingredient'}]-(m) return distinct m.name"}, {"query": "Can you tell me who the representative of the Dream Sky Turtles is?", "cypher": "match (:ENTITY{name:'Relationship{name:'representative work'}}) - (x) return x.name skip 4"}, {"query": "What is the name of the beach in the easternmost corner of Shenzhen?", "cypher": "match (:ENTITY{name:'the easternmost tip of the Shenzhen Peninsula'}) <- [:Relationship{name:'geographical location'}]- ((m) return m.name"}, {"query": "What is the shortest connection path between the two levels of the Tianjin Zhenjiang Anhui Football Club and the Tianjin Xiangyang Park Football Club?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Tangjiang Central An Football Club'}) - [*..2]-(b:ENTITY{name:'Shian An Park Football Club'})) return count ((p) The match was played at the same venue as the match."}, {"query": "Do you know of any accidents where one person died? Can you name five?", "cypher": "match (:ENTITY{name:'1 dead'}) <- [:Relationship{name:'casualty'}]- (q) return q.name limit 5"}, {"query": "The width of the car is 1695 mm, is that a brake?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What are the main departments of the National Higher Education Institution? Can I list 3 categories?", "cypher": "match (:ENTITY{name:'National Higher Education Institution'}) <- [:Relationship{name:'category'}]- ((x),(x) - [:Relationship{name:'main faculty department'}]->(q) return distinct q.name limit 3"}, {"query": "What country is Song Won-Pah-Sung an actor from?", "cypher": "match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'\u56fd\u7c4d'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship'}) - [:Relationship{name:'representative work'}]->(m) return m.name as name"}, {"query": "I need two copies of the summer paperback Bamboo boutique, other than Chongqing Press, please.", "cypher": "match (:ENTITY{name:'Summer ink bamboo boutique book'}) --(m) with m order by m.name where m.name <> 'Chongqing Publishing' return distinct m.name limit 2"}, {"query": "What company was founded by Matthew Prince?", "cypher": "match (:ENTITY{name:'Matthew Prince'}) <- [:Relationship{name:'founder'}]- (p) return distinct p.name"}, {"query": "What chemical has a flash point at 230\u00b0F?", "cypher": "match (:ENTITY{name:'&gt;230\u00b0F'}) <- [:Relationship{name:'flashpoint'}]- (h) return distinct h.name"}, {"query": "I would like to know about the other 8 articles published by Yellow River Water Press, the dam and the dam station on the second floor.", "cypher": "match (:ENTITY{name:' pump and pump station'}) - [*1..2]-(p) where p.name <> 'Yellow River Hydro Publishing' return distinct p.name limit 8"}, {"query": "Do you have any other information besides the organizing body? Help me find 4 information in 2 layers.", "cypher": "match (:ENTITY{name:'official road junction'}) -[*1..2]-(p) where p.name <> 'organization' return p.name limit 4"}, {"query": "Can you name a ceremony for the Olympic Games?", "cypher": "match (:ENTITY{name:'Olympic award ceremony'}) <- [:Relationship{name:'event'}]- (n) return distinct n.name"}, {"query": "Do you know three famous alumni of Tanjung Primary School?", "cypher": "Match (:ENTITY{name:'Tang's Primary School'}) - [:Relationship{name:'Known Alumni'}]-> (n) return distinct n.name limit 3"}, {"query": "Can you tell me about a movie about politics, economics, military, technology?", "cypher": "match (:ENTITY{name:'political, economic, military, scientific and technological'}) <- [:Relationship{name:'about'}]-(p) - [:Relationship{name:'film'}]->(n) return distinct n.name limit 1"}, {"query": "What companies are open in Fujairah?", "cypher": "match (p:ENTITY{location:'Fuzhou'}) return p.name"}, {"query": "What books are priced at 58 dollars? Can you help me find three?", "cypher": "match (:ENTITY{name:'58\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' book name'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "Do you have any information on the names of the five people who are behind the attack?", "cypher": "match (:ENTITY{name:'\u91d1\u6cf0'}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'alpha name'}]->(x) return x.name order by x.name limit 5"}, {"query": "How many lines are the shortest paths between K208 and K128 for all levels not exceeding 5?", "cypher": "match?p=allshortestpaths (((a:ENTITY{name:'step by step K208'}) - [*..5]-(b:ENTITY{name:'step by step K128'}))?return?count(p)"}, {"query": "Who are the founders of the company that was founded in August 2014?", "cypher": "match (h:ENTITY{name:'August 2014'}) <- [:Relationship{name:'time of creation'}]-(n) - [:Relationship{name:'founder'}]->(p) return distinct p.name limit 3"}, {"query": "Can you describe the three-tiered relationships that are associated with the term \"belly yellow\" for me?", "cypher": "match (n:ENTITY{name:'same as the name of the game}) - [*1..3]->(x) where x.name <> 'life term' return distinct x.name"}, {"query": "Can you tell me some nicknames for Camaro TF4?", "cypher": "match (:ENTITY{name:'Camaro TF4'}) - [:Relationship{name:' alias'}]-> (x) return x.name order by x.name"}, {"query": "What is the shortest relationship path between athlete Francois Mungo and Vila Bospislova in the 3rd level?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Fran\u00e7ois Mbongo'}) - [*..3]-(b:ENTITY{name:'Vila Bospislova'})) return count ((p) The number of paths that are returned is the number of paths that are returned."}, {"query": "Do you have any Chinese novels, can you find 10?", "cypher": "The following is a list of characters that appear in the game The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of the Wild: The Legend of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Zelda: Breath of Z"}, {"query": "The ZF10*42 is a wide-angle telescope with a wide-angle lens.", "cypher": "match (:ENTITY{name:'ZF10*42 type telescopic viewfinder'}) --(p) with p order by p.name return p.name"}, {"query": "Can you tell me which novels are published in Jinjiang Literary City?", "cypher": "match (:ENTITY{name:'Jingjiang City'}) <- [:Relationship{name:'connecting platform'}]- (p) return p.name limit 10"}, {"query": "Can you find me two publications published by Beijing Koh Hai Group?", "cypher": "match (:ENTITY{name:'Beijing Koh Hai Group Co. Ltd'}) <- [:Relationship{name:'publishing house'}]-(x),(x) - [:Relationship{name:'book name'}]->(q) return distinct q.name limit 2"}, {"query": "Please list the top three representative works of this person with type A blood.", "cypher": "match (:ENTITY{name:'A'}) <- [:Relationship{name:'Blood type'}]-(h) - [:Relationship{name:'represents work'}]->(n) return n.name skip 1 limit 3"}, {"query": "The Shandong University (Weihai) Chess Society has won 10 honors in addition to winning the second Shandong Provincial University Chess Championship.", "cypher": "match (m:ENTITY{name:'Santongo University ((Weihai) Association of Chess Friends, a college student society of Santongo University ((Weihai) emerged in the 21st century\u3002'}) <-[:Describe{name:'description'}]-(q),(q) -[:Relationship{name:'main award'}]->(h) where h.name <> ' Second Santongo University Chess Championship, Go group first place\u3002' return distinct h.name limit 5"}, {"query": "I would like to know who the pig in the zodiac is and what his main works are. Can you list five?", "cypher": "match (:ENTITY{name:' pig'}) <- [:Relationship{name:' zodiac sign'}]- ((n) - [:Relationship{name:' main work'}]->(x) return n.name,x.name skip 1 limit 5"}, {"query": "Can you name the main departments of the Royal Military College of Sunchester?", "cypher": "match (:ENTITY{name:'Sunchester Royal Military College'}) <- [:Relationship{name:'Chinese name'}]-(q),(q) - [:Relationship{name:'main faculty'}]->(n) return n.name order by n.name limit 1"}, {"query": "I'm curious if any of the authors born on August 28, 1993 have a great work?", "cypher": "match (:ENTITY{name:'August 28, 1993)) <- [:Relationship{name:'date of birth'}]-(n),(n) - [:Relationship{name:'represents work'}]->(h) return distinct n.name"}, {"query": "The school in Guangzhou, which won the 2008 China Beauty Top 10 Gold Medal Makeup School, will introduce another award.", "cypher": "match (:ENTITY{name:'China Guangzhou'}) <- [:Relationship{name:'area'}]-(n) - [:Relationship{name:'main award'}]->(m) where m.name <> '2008 China-America top ten gold medalist makeup school' return distinct m.name limit 1"}, {"query": "Do you know who is the current secretary of the Board of Directors of the Institute of Accountancy?", "cypher": "match (:ENTITY{name:' current secretary of the departmental committee of the Institute of Accountancy...'}) <--(n) return n.name"}, {"query": "Check out the 5 pieces of information about the Ryu-Zen mythology in the article below.", "cypher": "match (n:ENTITY{name:' small over the square'}) - [*]->(x) where x.name <> '' return distinct x.name limit 5"}, {"query": "Can you find me two doctors from the first people's hospital in Sundar and tell me their job title?", "cypher": "match (:ENTITY{name:'Sundem I People's Hospital'}) <- [:Relationship{name:'Hospital'}]-(h),(h) - [:Relationship{name:'official title'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "Can you help me find three literary people, a poet, a writer and her school?", "cypher": "match (:ENTITY{name:' literature  poet  writer'}) <- [:Relationship{name:' profession'}]-(h),(h) - [:Relationship{name:' graduate school'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "Can you find the five professional attributes of men?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(h),(h) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 5"}, {"query": "The 2012 China International Web Printing Industry Expo in Shenzhen, which approval unit can you find?", "cypher": "match ((:ENTITY{name:'2012 China [Shenzhen] International Internet Printing Industry Exhibition'}) - [:Relationship{name:' Approved Unit'}]-> (h) return h.name"}, {"query": "Can you give me five links to this person Laoufi in the 2nd level of relationships?", "cypher": "The following is a list of all the different ways Laoufi is credited in the database:"}, {"query": "Do you know what the work of Shannepyeong is?", "cypher": "match (:ENTITY{name:'\u5c71\u5185 \u862d\u300f\u3084\u307e\u3046\u3061 \u3059\u305a\u3089\u3093, born December 8, 1994) is a member of the Japanese idol girl group SKE48 Team s."}, {"query": "Can you tell me what a profession is for a Liang Wen Zhen?", "cypher": "match (:ENTITY{name:'Liang Wenling'}) <- [:Relationship{name:'Chinese name'}]-(n) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 1"}, {"query": "I'm wondering which companies are headquartered in Beijing? Can you tell me 19?", "cypher": "match (:ENTITY{name:'Beijing'}) <- [:Relationship{name:'Hall of Residence'}]- (n) return n.name limit 19"}, {"query": "Susie Susira What kind of jobs did this person have? Name three.", "cypher": "match (:ENTITY{name:'Susie Susira'}) - [:Relationship{name:'profession'}]-> (n) with n order by n.name return n.name limit 3"}, {"query": "I would like to know what are the main ingredients of the Leche Crown Pound cake besides egg yolk and sour cream?", "cypher": "match (n:ENTITY{name:'Legume crown mold pound cake'}) - [:Relationship{name:'main ingredient'}]->(h) where h.name <> 'egg yolk' and h.name <> 'sour cream' return distinct h.name limit 2"}, {"query": "What else do you know about the thermal design quick reference manual for electronic equipment, other than that published by the Electronic Industry Publishing House?", "cypher": "match (:ENTITY{name:' Electronic device thermal design quick search manual'}) - [*1..3]-(p) where p.name <> 'electronic industry publisher' return distinct p.name limit 6"}, {"query": "What is the name of the Korean dish made with pork tenderloin?", "cypher": "match (:ENTITY{name:'Korea'}) <- [:Relationship{name:'category'}]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) where n.name='pig five-sided flowery' return distinct m.name"}, {"query": "What is the name of the new TV series directed by Zhu Jian, starring Mak Chul-shan and Chen Daoming?", "cypher": "match (:ENTITY{name:'Ma Kisan, Chen Daoming, Lee Hye, Yellow Sea Ice, Guo Jinglin, Ho Sei Fei, Lin Sheng, Liu Jun, Liu Chunje, Fuan Shu'}) <-[:Relationship{name:'starring'}]-(m), (m) -[:Relationship{name:'director'}]->(n) where n.name='Ju Jian New, Zhou Zhou' return distinct m.name"}, {"query": "The following is a list of the top 10 most popular Chinese political figures in the world:", "cypher": "match (n:ENTITY{name:'\u5cb3\u58eb\u660e'}) - [*1..4]->(x) where x.name <> 'political figure' return distinct x.name"}, {"query": "Can anyone tell me what kind of jobs he has in the past?", "cypher": "match (:ENTITY{name:'Zhang Longwan'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'profession'}]->(n) return distinct n.name limit 3"}, {"query": "Where is the location of the Shanghai IoT Technology and Applications Expo 2011 that was reportedly held?", "cypher": "match ((m:ENTITY{name:'2011 Shanghai IoT Technology and Applications Exhibition'}) - [:Relationship{name:' Location'}]-> (n) return n.name"}, {"query": "What is the origin of the name Apple Cider Vinegar?", "cypher": "Match (:ENTITY{name:'Apple clam beef slices'}) - [:Relationship{name:'category'}]->(m) return distinct m.name"}, {"query": "What do you know about the alias of Enrikon?", "cypher": "Match (:ENTITY{name:'Relationship{name:'alias'}]-> (p) return p.name skip 4"}, {"query": "Do you know how much hydrogen is in the 1Cr5Mo oil-cracking tube used by the plant?", "cypher": "match ((:ENTITY{name:'1Cr5Mo oil shale pipeline'}) - [:Relationship{name:'nitrogen content'}]-> (x) return x.name"}, {"query": "Can you tell me what else is related to the second tier of the oil palm sub-family?", "cypher": "Match (n) <- [Relationship*2{name:'subspecies'}]- ((p:ENTITY{name:'subspecies'}) RETURN distinct n.name"}, {"query": "What is the chemical formula of C25H30N3-Cl?", "cypher": "match (:ENTITY{name:'C25H30N3-Cl'}) <- [:Relationship{name:'molecular'}]-(m) return distinct m.name"}, {"query": "Can you recommend two songs in Mandarin for me?", "cypher": "match (:ENTITY{name:'Mandarin'}) <- [:Relationship{name:'Language of the song'}]- (q) return q.name limit 2"}, {"query": "I can't find the chemical formula for 4-amino-1-cholesterol-hydroxyacetate, can you tell me?", "cypher": "match ((x:ENTITY{name:'4-amino-1-cholesterol-oxygen-based chlorophyll salts'}) - [:Relationship{name:'chemical formula'}]-> (q) return q.name"}, {"query": "The two-tiered relationship between the sweet and salty water and the East Asian pickled vegetables?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'sweet to sweet to sweet' return distinct x.name"}, {"query": "How many A-level sites are there in Sofia Cathedral?", "cypher": "match (:ENTITY{name:'Sofia Church [Harbin Architecture and Art Museum]'}) - [:Relationship{name:'Sightseeing level'}]->(n) return n.name as name union all match (:ENTITY{name:'Sofia Church [Harbin Architecture and Art Museum]'}) - [:Relationship{name:'Ticket price'}]->(m) return m.name as name"}, {"query": "Please tell me what the name of the exhibition that will be held in March 2012 in other countries?", "cypher": "match (:ENTITY{name:'March 2012'}) <- [:Relationship{name:' Exhibition time'}]- (m) return m.name"}, {"query": "Which law firms and Beijing Hengto Law Firm are under the jurisdiction of a competent judicial authority, and what are their respective labels?", "cypher": "match (n:ENTITY{name:'Beijing Hengto Law Firm'}) - [:Relationship{name:'Department of Justice'}]->(:ENTITY) <-[:Relationship{name:'Department of Justice'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c DESC "}, {"query": "When was the start of the multi-cloud company?", "cypher": "match (p:ENTITY{name:'multi-cloud company'}) return p.time"}, {"query": "Do you know what kind of accident happened on October 3, 2010?", "cypher": "match (:ENTITY{name:'October 3, 2010'}) <- [:Relationship{name:' time of occurrence'}]- (q) return q.name"}, {"query": "Did you know that yoga is a million-person game?", "cypher": "match (:ENTITY{name:'Million people's game'}) --(q) with q order by q.name return q.name limit 10"}, {"query": "Share your story about the award.", "cypher": "match (n:ENTITY{name:'s) --(m) return m.name skip 5"}, {"query": "Please tell me what company is this in Beijing, Beijing, Beijing, Beijing, Shanghai, Shanghai, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, and other places.", "cypher": "match (:ENTITY{name:'4th floor of B6 Road, North East, Beijing, in the Beijing area of the Daegu District)"}, {"query": "What is the shortest path between the two layers of the relationship you want and the one you want from your heart?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'You want it for'}) - [*..2]-(b:ENTITY{name:'You want it from [Chinese pronunciation]'})) return count ((p))"}, {"query": "The first three labels describe the Type 03 automatic rifle in the automatic long-barreled rifle?", "cypher": "match (:ENTITY{name:'03 type automatic rifle]'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 3"}, {"query": "The children of the school are being taught to be kind and to be kind.", "cypher": "match (:ENTITY{name:'Kindergarten'}) --(n) return n.name skip 2 This is a list of all the different ways Kindergarten is credited in the database."}, {"query": "The three mercury-white streak viruses are given nicknames, but be careful not to mention silver streak or silver virus disease.", "cypher": "match (:ENTITY{name:'Mercury virus'}) <- [:Relationship{name:'Chinese name of the pathogen'}]-(m) - [:Relationship{name:'alias'}]->(h) where h.name <> 'Silver stripe or silver virus disease' return distinct h.name limit 3"}, {"query": "Can you help me check the magnitude of the earthquake in Jiangsu?", "cypher": "match ((n:ENTITY{name:'1\u00b71 Jiangsu Xinjiang Lake earthquake'}) - [:Relationship{name:'seismic grade'}]-> (x) return x.name"}, {"query": "I want to know what is the relationship between the two layers of the work of Zhou Zhou's Dong Lianmen?", "cypher": "match (n:ENTITY{name:'Relationship*1..2]->(x) where x.name<>'showdown' return distinct x.name"}, {"query": "Do you know what kind of relationships are involved in the three levels of Guangdong's Shaanmei Street?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Guangdong Shaanmei Street'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "What are the locations in Li Yuanmu and the area of Li Tai City? What are the labels for each location? Please list the labels in order from small to large by number of points.", "cypher": "match (n:ENTITY{name:'Li Yuan\u6751'}) - [:Relationship{name:'the area'}]->(:ENTITY) <-[:Relationship{name:'the area'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "What are the three representative works of Jean-Pierre Danney?", "cypher": "match (:ENTITY{name:'Jean-Pierre-Danie'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'represents work'}]->(x) return distinct x.name limit 3"}, {"query": "Please tell me the name of the exhibition that you are participating in from October 27 to 29, 2015.", "cypher": "match (:ENTITY{name:'October 27, 2015-29th'}) <- [:Relationship{name:'attendance time'}]- (n) return distinct n.name"}, {"query": "Do you know which tournament is being held in Basel?", "cypher": "match (:ENTITY{name:'Basel'}) <- [:Relationship{name:'Running city'}]- (m) return distinct m.name"}, {"query": "What are the works of the national publishers? When are they published? Can you tell me five lines?", "cypher": "match (:ENTITY{name:'national publisher'}) <- [:Relationship{name:'publisher'}]-(h),(h) - [:Relationship{name:'publication time'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "What information do you know about the two-tier relationship between Southwest Agricultural University and other universities outside Chongqing?", "cypher": "match (:ENTITY{name:'Southwest Agricultural University'}) - [*1..2]->(p) where p.name <> 'Chongqing city' return distinct p.name limit 10"}, {"query": "What is the category of pork chops and what ingredients are needed?", "cypher": "match (:ENTITY{name:'chicken pork'}) - [:Relationship{name:'category'}]->(n) return n.name as name union all match (:ENTITY{name:'chicken pork'}) - [:Relationship{name:'main ingredient'}]->(m) return m.name as name"}, {"query": "List the relationship between the two layers of the book called China Packaging Yearbook 1993?", "cypher": "match (n:ENTITY{name:'China Packaging Yearbook 1993'}) - [:Relationship*1..2]->(x) where x.name <>'China Packaging Yearbook 1993' return distinct x.name"}, {"query": "The doctor's office is located in the city of San Francisco, California.", "cypher": "match (:ENTITY{name:''}) -[:Relationship*1..3]-(p) where p.name <> 'doctor' return p.name limit 7"}, {"query": "Do you have the label information of the two Chinese Meteorological Service Associations, but not the organizing and scientific research organizations?", "cypher": "match (n:ENTITY{name:'China Meteorological Service Association'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'organizing agency' and h.name <> 'scientific research agency' return distinct h.name limit 2"}, {"query": "Do you know what kind of events the Ministry of Publicity, the Press Office, the Press Association and the Women's Union have organized?", "cypher": "match (:ENTITY{name:'propaganda ministry, media outlet, media union, women's union'}) <- [:Relationship{name:'organizing unit'}]- (q) return distinct q.name"}, {"query": "What is the shortest path between the two floors of the village of Longtai and the village of Bamboo Mountain?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Relationship*..2]-(b:ENTITY{name:'Bamboo Mountain Village'})) return count ((p)"}, {"query": "Does anyone know what Hal Needham does for a living?", "cypher": "match (:ENTITY{name:'Hal Needham'}) <- [:Relationship{name:'foreign language name'}]-(m),(m) - [:Relationship{name:'profession'}]->(p) return distinct p.name"}, {"query": "Where can I find the Ericsson Company?", "cypher": "match (p:ENTITY{name:' Achebe Corporation'}) return p.location The name of the company is a reference to the name of the company."}, {"query": "Can you find the 10 species of shrimp in the family?", "cypher": "match (:ENTITY{name:'seagull family Nephropidae'}) <- [*]-(m), (m) - [:Relationship{name:' distribution area'}]->(n) return distinct m.name,n.name limit 10"}, {"query": "What is the nationality of Yang Pao Rong? What is his nationality? Where was he born?", "cypher": "Match (:ENTITY{name:'Relationship{name:'nationality'}) ->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'ethnicity'}) ->(m) return m.name as name union all match (:ENTITY{name:'Relationship{name:'birthplace'}) ->(r) return r.name as name"}, {"query": "What other career can Jiangsu Nantung people do if they don't want to be entrepreneurs?", "cypher": "match (:ENTITY{name:'Jiangsu Nantoung'}) <- [:Relationship{name:'birthplace'}]-(m) - [:Relationship{name:'profession'}]->(x) where x.name <> 'entrepreneur' return distinct x.name limit 1"}, {"query": "Do you have any information about the novel 3 and the third level of the label?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'cloudsword and evil knife'}) return distinct n.name limit 3"}, {"query": "I would like to know what are the main achievements of Cao Lei Yu, can you list three?", "cypher": "match (:ENTITY{name:' Cao\u4e50\u4f59'}) <- [:Relationship{name:' Chinese name'}]-(m),(m) - [:Relationship{name:' major achievements'}]->(n) return distinct n.name limit 3"}, {"query": "What is the name of the company Beijing Co-Germany Technology Limited?", "cypher": "match (q:ENTITY{name:'Beijing and Germany Technology Co. Ltd'}) - [:Relationship{name:' abbreviated '}]-> (x) return distinct x.name"}, {"query": "The following is a list of the three levels of relationship in the work of the artist.", "cypher": "match (n:ENTITY{name:' and \u5143\u660e\u96ea\u4e2d\u89c1\u793c'}) - [:Relationship*1..2]->(x) where x.name <> '' return distinct x.name"}, {"query": "Can you tell me which teams this player born on April 13, 1987 has played for?", "cypher": "match (:ENTITY{name:'1987-04-13'}) <- [:Relationship{name:'date of birth'}]- ((q) - [:Relationship{name:'former team'}]->(h) return h.name order by h.name limit 3"}, {"query": "Do you know what the Beatles' original songs are?", "cypher": "Match (:ENTITY{name:'The Beatles'}) <- [Relationship{name:'The song was originally performed by The Beatles'}]- (n) return distinct n.name"}, {"query": "Find out where the six Chinese restaurants are located.", "cypher": "match (:ENTITY{name:'Chinese restaurant'}) <- [*]-(m), (m) - [:Relationship{name:'address'}]->(n) return m.name, n.name limit 6"}, {"query": "Can you name five facts about British athlete Watkins Murray?", "cypher": "match (n:ENTITY{name:'Wotkins Murray'}) - [*]->(x) where x.name <>'Wotkins Murray, English footballer\u3002' return distinct x.name limit 5"}, {"query": "What are the two labels of Roberto Santa Maria besides football and sports?", "cypher": "match (n:ENTITY{name:'Roberto Santa Maria'}) - [:Tag{name:'tag'}]->(h) where h.name <> 'football' and h.name <> 'sports' return distinct h.name limit 2"}, {"query": "What is the plant Phoebebournei (Hemsl.) Yang?", "cypher": "match (:ENTITY{name:'Phoebebournei ((Hemsl.) Yang'}) --(x) return distinct x.name"}, {"query": "Can you name a show in the tech category?", "cypher": "match (:ENTITY{name:'technology'}) <- [:Relationship{name:'exhibition category'}]- (x) return distinct x.name"}, {"query": "Can you tell me what kind of relationships the Little White Rats novel covers in the three layers?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' experimental white rat'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "I want to tell you some news about HB.", "cypher": "match (:ENTITY{name:'HB'}) --(p) return p.name skip 3 is not possible"}, {"query": "Do you have a five-line rhyme for the morning? Help me find ten.", "cypher": "match (:ENTITY{name:'\u671d'}) <- [:Relationship{name:'creation year'}]- (mn) - [:Relationship{name:'literary genre'}]->(n:ENTITY{name:'five-word string'}) return mn.name limit 10"}, {"query": "When did the bombs become popular?", "cypher": "match (n:ENTITY{name:' explosion head [hair type]'}) - [:Relationship{name:' pop era'}]-> (h) return h.name"}, {"query": "Can you list 11 companies that were photographed on July 08, 2016?", "cypher": "match (q:ENTITY{name:'08 July 2016'}) <- [:Relationship{name:'Shot time'}]- (m) return m.name limit 11"}, {"query": "Where are the people of Seri Shikoku and what are their main achievements?", "cypher": "match (:ENTITY{name:'Serious'}) - [:Relationship{name:'Born'}]->(n) return n.name as name union all match (:ENTITY{name:'Serious'}) - [:Relationship{name:'Major achievement'}]->(m) return m.name as name"}, {"query": "List the other three-day properties besides the natural ones?", "cypher": "match (:ENTITY{name:'(S) -(-)-4-\u53d4\u4e01\u57fa-2-\u6076'}) --(h) with h order by h.name where h.name <> 'natural' return h.name limit 3"}]