[{"query": "The New Zealand South Island earthquake of 11/14 summarized in five tags:", "cypher": "match (:ENTITY{name:'11\u00b714 New Zealand South Island earthquake'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 5"}, {"query": "The following is a list of articles about Fulbright's work in the United States:", "cypher": "match (:ENTITY{name:'Fulberto Yulu'}) - [:Relationship{name:'profession'}]-> (x) return x.name order by x.name"}, {"query": "The film, Intellect and Emotion, cost him how much to make?", "cypher": "match (:ENTITY{name:'Reasonable and Emotional'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'Production cost'}]->(n) return distinct n.name"}, {"query": "The following are the five features of the tag that are not tech products.", "cypher": "match (:ENTITY{name:'155 browser'}) --(m) with m order by m.name where m.name <> 'technology product' return m.name limit 5"}, {"query": "I want to know about the author's simulated circuit and its application to the other 6 layers of this book.", "cypher": "match (:ENTITY{name:'Analog circuits and their applications'}) - [*1..2]-(p) where p.name <> 'HopeBoshy' return p.name limit 6"}, {"query": "The following is a list of some of the most popular and well-known names in the business world.", "cypher": "match (:ENTITY{name:' Josh Trunk'}) - [:Relationship{name:' profession'}]-> (p) return p.name order by p.name"}, {"query": "When was Meijin born?", "cypher": "match (n:ENTITY{name:'Melissa'}) return n.born"}, {"query": "Please list a small and medium-sized profession for me.", "cypher": "match (:ENTITY{name:' small and medium-sized}) - [:Relationship{name:' profession'}]-> (q) return distinct q.name limit 1"}, {"query": "Find out what the six engineers represent.", "cypher": "match (:ENTITY{name:' engineer'}) <- [*]-(m), (m) - [:Relationship{name:' representing work'}]->(n) return m.name, n.name limit 6"}, {"query": "How much are the books of Lefty Ivender priced?", "cypher": "match (:ENTITY{name:'Zoefeld K.W.'}) <-[:Relationship{name:'author'}]-(n) -[:Relationship{name:'pricing'}]->(q) return distinct q.name limit 2"}, {"query": "What are the occupations of graduates of the business school of Suzhou University?", "cypher": "match (:ENTITY{name:'Suzhou University Business School'}) <- [:Relationship{name:'Graduate School'}]-(p),(p) - [:Relationship{name:'Profession'}]->(m) return distinct m.name"}, {"query": "Do you know how much the book written by Ansoo and Lei Ming is worth?", "cypher": "match (:ENTITY{name:'Anzo, Ray Min'}) <- [:Relationship{name:'author'}]- ((x),(x) - [:Relationship{name:'pricing'}]->(q) return distinct q.name"}, {"query": "What is the shortest path between the two layers of integrated electronics design and practice and industrial communication technology principles and applications?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Integrated electronic design and practice'}) - [*..2]-(b:ENTITY{name:'Principles and applications of industrial communications technology'})) return count ((p)"}, {"query": "Find out who is the main character in two Thai dramas.", "cypher": "match (:ENTITY{name:'Thailand'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'Starred in'}]->(n) return m.name,n.name limit 2"}, {"query": "What are the main awards that 13+ rated movies have won?", "cypher": "match (:ENTITY{name:'??? ? 13+'}) <- [:Relationship{name:' ranking'}]- ((h),(h) - [:Relationship{name:' major award'}]->(q) return distinct q.name"}, {"query": "Help me find 20 sports projects", "cypher": "match (:ENTITY{name:'sports project'}) <- [:Tag{name:'tag'}]-(m) return distinct m.name limit 20"}, {"query": "I asked if there were any other tags besides the subject of the post, Ms. Fork.", "cypher": "match (:ENTITY{name:'forked waist'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'topical person' return p.name limit 1"}, {"query": "Who is the author of the book? Where did he come from?", "cypher": "match (:ENTITY{name:'the author'}) - [:Relationship{name:'the work originated'}]->(n) return n.name as name union all match (:ENTITY{name:'the author'}) - [:Relationship{name:'the author'}->(m) return m.name as name"}, {"query": "The main department of Hubei's BPO Construction School is Engineering Measurement and Construction Construction Management.", "cypher": "match (n:ENTITY{name:'Hubei Real Estate Construction School'}) - [:Relationship{name:'main faculty'}]->(h) where h.name <> 'engineering measurement specialist' and h.name <> 'building construction management specialist' return distinct h.name limit 1"}, {"query": "Which two labels are God's pain pills besides life?", "cypher": "match (:ENTITY{name:'God grant pain'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'life' return p.name limit 2"}, {"query": "Where is the area of the village of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of", "cypher": "match (:ENTITY{name:'Gangzhou county's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port town's main port's main port's main port's main port's main port's main port's main port's main port's port's main port's port's port's port's port's port's port's port's port's port's port'"}, {"query": "Recommend 5 other representative actors as witches", "cypher": "match (:ENTITY{name:'actor'}) <- [:Relationship{name:'profession'}]-(m) - [:Relationship{name:'representative work'}]->(h) where h.name <> 'witch's urgency' return distinct h.name limit 5"}, {"query": "Which tournament was held from September 18 to October 1, 1983?", "cypher": "match (:ENTITY{name:'September 18, 1983 to October 1, 1983)) <- [:Relationship{name:'match time'}]- (m) return distinct m.name"}, {"query": "Do you know what accident happened at the intersection of Yiwu Futa Street Mall and 310 Provincial Road?", "cypher": "match (:ENTITY{name:'Yuu Fueda Street Mall Avenue and 310 Provincial Road junction'}) <- [:Relationship{name:'Accident location'}]- (m) return distinct m.name"}, {"query": "Find out if there are two primary schools in Yangzhou County, Anhui Province, public or private schools.", "cypher": "match (:ENTITY{name:'Anhui Province'}) <- [*]-(m), (m) - [:Relationship{name:' category'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "The school, which was founded in 1984, won the main award for its work and told me one thing.", "cypher": "match (:ENTITY{name:'1984'}) <- [:Relationship{name:'time of creation'}]- ((m),(m) - [:Relationship{name:'main award'}]->(q) return q.name skip 3 limit 1"}, {"query": "I'm not sure if you can tell me about the three main achievements of Kyan Tan.", "cypher": "match (:ENTITY{name:'Keng Tan Chun'}) <- [:Relationship{name:'Chinese name'}]-(m),(m) - [:Relationship{name:'main achievement'}]->(q) return q.name order by q.name limit 3"}, {"query": "What is the shortest distance between Beijing Kimwan Weng Technology Development Co. Ltd. and Sichuan Huayang Real Estate Development Co. Ltd. within the two levels?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Beijing Kim Vong Technology and Development Co. Ltd'}) - [*..2]-(b:ENTITY{name:'Sichuan Huayang Real Estate Development Co. Ltd'})) return count ((p) The name of the company is not known."}, {"query": "Please list the first 3 characters.", "cypher": "match (:ENTITY{name:'Dora public pronunciation: \u6749\u7530\u667a and '}) <- [:Relationship{name:'sounding'}]- (p) return p.name order by p.name limit 3"}, {"query": "The book is a five-sentence summary of the growth of the 0-6 year old.", "cypher": "match (:ENTITY{name:'0-6 years growth assessment'}) --(n) with n order by n.name where n.name <> 'books' return n.name limit 5"}, {"query": "What is the content of the selection activity of Chan Si-sen: National Spine? Yang En-Zhen: Life is like a mirror? Sheng Yan-Shan: Is there a mirror? Zhong Tieng-Rong, Hu Xue-Li: Reng Rin-Li? Chen Xiaolan: Doctors?", "cypher": "match (:ENTITY{name:'Chang Shih-Soon: National Spine ? Liu En-Zhen: Life is like a motherfucker ? Sheng Yan-Shan: Is there a link ? Zhong-Ting-Rung , Hu Xue-Li: Reng Rin-Li ? Chen Xiaolan: Da-Doctor-Doctor-Heart '})"}, {"query": "Ask the National Institute of Administration; what is the report released by the National Information Center?", "cypher": "match (:ENTITY{name:'National School of Administration; National Information Center'}) <- [:Relationship{name:'Founding Unit'}]- (q) return distinct q.name"}, {"query": "Can you recommend some import-grade SUVs?", "cypher": "match (:ENTITY{name:'import level attributes of SUV'}) <- [:Relationship{name:'domain attributes'}]- (p) return distinct p.name"}, {"query": "Find out five personal details about this man named Novikov Yevgeni in Russian.", "cypher": "match (n:ENTITY{name:'Novikov Jevgeni'}) - [*]->(x) where x.name <>' foreign name m' return distinct x.name limit 5"}, {"query": "What is the main ingredient of soap?", "cypher": "match (:ENTITY{name:'Shu Skinny'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'main ingredient'}]->(n) return distinct n.name"}, {"query": "Do you know what the match is on June 28th and September 15th?", "cypher": "match (:ENTITY{name:'June 28th to September 15th'}) <- [:Relationship{name:'time of the match'}]- (x) return distinct x.name"}, {"query": "Do you know what art-themed activities are going on?", "cypher": "match (:ENTITY{name:' artwork'}) <- [:Relationship{name:' subject'}]- (m) return distinct m.name"}, {"query": "0551 is a real estate company, do you know who is the president of this company?", "cypher": "match ((:ENTITY{name:'0551 enterprise'}) - [:Relationship{name:'president'}]-> (x) return x.name"}, {"query": "Can you name the five main works of this person Ben Wong Tin-Dok?", "cypher": "match (:ENTITY{name:'Ben Wong Tin-Dok'}) <- [:Relationship{name:'foreign language name'}]-(m),(m) - [:Relationship{name:'main work'}]->(x) return x.name skip 1 limit 5"}, {"query": "Can you list the photography awards that were presented in October?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What are the films directed by Huang Zhiyuan? Can you tell me about five?", "cypher": "The film was released on DVD in the United States on July 15, 2010, by Columbia Pictures."}, {"query": "Who is the coach of the young lady?", "cypher": "match (:ENTITY{name:' [Chinese swimmer]'}) - [:Relationship{name:'coach'}]->(r) return r.name"}, {"query": "Can you recommend five films made in mainland China?", "cypher": "match (:ENTITY{name:'Mainland China'}) <- [:Relationship{name:'Manufacturing area'}]- (x) return distinct x.name limit 5"}, {"query": "What is the area code for the city with the postal code 675,000?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "I want to read the two-layer relationship between Chinese and Sanskrit poetry.", "cypher": "match (n:ENTITY{name:'reading Chinese and Sanskrit poetry'}) - [:Relationship*1..2]->(x) where x.name <>'poetry' return distinct x.name"}, {"query": "I'm not sure if you're familiar with the game, but I'm interested in the game itself.", "cypher": "match (n:ENTITY{name:'Warship'}) - [*1..3]->(x) where x.name <> 'game' return distinct x.name"}, {"query": "Please tell me which hurricane season has 6 major hurricanes in total?", "cypher": "match (:ENTITY{name:'6'}) <- [:Relationship{name:' total number of major hurricanes'}]- (n) return n.name"}, {"query": "What is David Rogers's role in the film?", "cypher": "match (q:ENTITY{name:'David Rogers'}) - [:Relationship{name:'representing work'}]-> (h) with h order by h.name return h.name"}, {"query": "Can you tell us about the personal information within the four-tier relationship related to Langiagne Cassim in Grenada?", "cypher": "match (n:ENTITY{name:'Langiagne Cassim'}) - [*1..3]->(x) where x.name<>'Grenada' return distinct x.name"}, {"query": "The Chinese version of the online novel, \"The Battle of the Sheep\", was published on which platform?", "cypher": "match ((:ENTITY{name:'Yingchuang[link in original Chinese]'}) - [:Relationship{name:'Yingchuang'}]-> (n) return n.name"}, {"query": "I'm not sure what you mean by that, but I'm not sure what you mean by that, but I'm not sure what you mean by that.", "cypher": "match (:ENTITY{name:'enemy forest'}) <--(m) - [:Relationship{name:'profession'}]->(x) return x.name order by x.name limit 3"}, {"query": "Can you give me 5 words about 3-ethyl-4-vinylcarbazole 95 in English?", "cypher": "match (n:ENTITY{name:'3-ethyl-4-methacrylate acetate'}) - [*]->(x) where x.name<>'N-ETHYL-2-VINYLCARBAZOLE 95' return distinct x.name limit 5"}, {"query": "Can you tell me the first three things about Lake Beidou?", "cypher": "match (p:ENTITY{name:'Beidou Lake'}) --(x) return x.name order by x.name limit 3"}, {"query": "I learned that the rectangular leafy green belongs to the rat family Li, and is distributed in Guangdong, Anhui, Zhejiang and other places.", "cypher": "match (n:ENTITY{name:'rectangular leafy green'}) -->(h) with h order by h.name where h.name <> 'distributed in Guangdong, Anhui, Zhejiang and other places\u3002' and h.name <> 'Rat Lee Ko' return h.name limit 5"}, {"query": "Where is the county of Yangon located? What tourist attractions are there?", "cypher": "match (:ENTITY{name:'\u53bf'}) - [:Relationship{name:'geographical location'}]->(n) return n.name as name union all match (:ENTITY{name:'\u53bf'}) - [:Relationship{name:'famous attractions'}]->(m) return m.name as name"}, {"query": "Can you name five profiles of Australian head coach Corika Steve in no less than five levels of relationships?", "cypher": "match (n:ENTITY{name:'Corica Steve'}) - [*1..5]->(x) where x.name <>'Corica Steve, Australian head coach\u3002' return distinct x.name limit 5"}, {"query": "Do you know what Jarrell Benimmon's foreign name is? What kind of athlete is he? What position does he play in the game?", "cypher": "match (:ENTITY{name:'Jerry Benimmon'}) - [:Relationship{name:'foreign name'}]->(n) return n.name as name union all match (:ENTITY{name:'Jerry Benimmon'}) - [:Relationship{name:'sporting project'}]->(m) return m.name as name union all match (:ENTITY{name:'Jerry Benimmon'}) - [:Relationship{name:'place on the field'}->(r) return r.name as name"}, {"query": "I wonder if you have a 188 salon in your eyes?", "cypher": "match (:ENTITY{name:'188salon'}) --(q) with q order by q.name return q.name"}, {"query": "He is a Yang Liang (now Henan Open) man, a Changyang (now Zhejiang Hangzhou) man, a painter of iterations, please describe his representation?", "cypher": "match (m:ENTITY{name:'Suhang ((1094-1172), Liu Liang ((now Henan opened) man, first said to be a money-lender ((now Zhejiang Hangzhou) man, period painter\u3002'}) <-[:Describe{name:'describe'}]-(x),(x) -[:Relationship{name:'represents works'}]->(nameq) return distinct q."}, {"query": "Help me find two soldiers.", "cypher": "match (:ENTITY{name:' military'}) <- [:Relationship{name:' profession'}]-(m) return distinct m.name limit 2"}, {"query": "Find a simplified Chinese textbook in the city of Guangzhou; Primary language extension reading training: 2nd grade 3rd level relationship materials?", "cypher": "match (n:ENTITY{name:'Tongqing school textbook\u00b7 Primary language extension reading training: 2nd grade'}) - [:Relationship*1..3]->(x) where x.name<>'simplified Chinese' return distinct x.name"}, {"query": "Can you help me find the exhibition in Shanghai in 2014?", "cypher": "match (:ENTITY{name:'2014'}) <- [:Relationship{name:'exhibition time'}]- (mn) - [:Relationship{name:'exhibition location'}]->(n:ENTITY{name:'Shanghai City'}) return mn.name"}, {"query": "Tell me about the relationship between the three layers of the folk tale of Taejo-chun?", "cypher": "match (n:ENTITY{name:'Taizu Chun'}) - [*1..3]->(x) where x.name <> 'folk legend' return distinct x.name"}, {"query": "Can you tell me about the five novels that are still in print?", "cypher": "match (:ENTITY{name:'in the connection'}) <- [:Relationship{name:'in the connection'}]- (m) return m.name limit 5"}, {"query": "Can you provide me with the link to Chia Michael, born in Bolzano, in the 1-3rd floor?", "cypher": "match (n:ENTITY{name:'Chia Michael'}) - [*1..3]->(x) where x.name <>'Bolzano' return distinct x.name"}, {"query": "I'm not sure what kind of job Kong Min-jung does.", "cypher": "match (:ENTITY{name:'Khongming Rong'}) <- [:Relationship{name:'Chinese name'}]- ((m) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 3"}, {"query": "I want to know the details of the 85kg Halfpenny Leigh 5th floor relationship.", "cypher": "match (n:ENTITY{name:'Halfpenny Leigh'}) - [*1..5]->(x) where x.name <>'85 kg' return distinct x.name limit 5"}, {"query": "Can you recommend me 5 places to visit for 1-2 hours?", "cypher": "match (n:ENTITY{name:'1-2 hours'}) <- [:Relationship{name:'recommended playing time'}]- (mn) return mn.name limit 5"}, {"query": "I would like to know which of the three representative works are published by Brazilian authors?", "cypher": "match (:ENTITY{name:'Brazil'}) <- [:Relationship{name:'nationality'}]-(m),(m) - [:Relationship{name:'representing work'}]->(x) return distinct x.name limit 3"}, {"query": "Which three major awards have been given to films and TV productions shot in Yunnan, China?", "cypher": "match (q:ENTITY{name:'China Yunnan'}) <- [:Relationship{name:' location of filming'}]- ((h) - [:Relationship{name:' major award'}]->(m) return distinct m.name limit 3"}, {"query": "Please tell me who this Korean is and what he has done to represent him.", "cypher": "match (:ENTITY{name:'Korea'}) <- [:Relationship{name:'nationality'}]-(x),(x) - [:Relationship{name:'representing work'}]->(h) return x.name,h.name skip 2 limit 1"}, {"query": "What is the first representation of a type A person?", "cypher": "match (:ENTITY{name:'A'}) <- [:Relationship{name:'Blood type'}]-(x) - [:Relationship{name:'represents work'}]->(q) return q.name order by q.name limit 1"}, {"query": "The series is called \"The Five Books of the Golden Chain\".", "cypher": "match (n:ENTITY{name:' fantasy master series: platinum chain'}) - [:Relationship*]->(x) where x.name <>'Chen-Yue-Ming' return distinct x.name limit 5"}, {"query": "Can you find five songs that are inspired by the music of the original song?", "cypher": "Match (:ENTITY{name:'witch's enlightenment'}) <- [:Relationship{name:'original song'}]- (mn) - [:Tag{name:'tag'}]->(n:ENTITY{name:'musical work'}) return mn.name limit 5"}, {"query": "In which year was the Faculty of Mechanical and Electrical Engineering of Fujian Agricultural Forest University established?", "cypher": "match (:ENTITY{name:'Food and Agriculture University of Fujian's School of Mechanical and Electrical Engineering'}) - [:Relationship{name:'time of creation'}]-> (m) return distinct m.name"}, {"query": "Find another school with a 30,000 square meter building outside the computer department.", "cypher": "match (:ENTITY{name:'30,000 square metres'}) <- [:Relationship{name:'building area'}]-(p) - [:Relationship{name:'main faculty'}]->(h) where h.name <> 'computer' return distinct h.name limit 1"}, {"query": "Do you know what kind of relationships are involved in the three layers of good morning?", "cypher": "The following is a list of all the different ways Match path=(n) <- [:Relationship*3]-(p:ENTITY{name:'good morning'}) UNWIND relationships(path) AS rel return rel.name limit 3"}, {"query": "What is the name of the 1987th album by mainland musician Liang Xiaosheng, written and sung by Liang Xiaosheng?", "cypher": "match ((:ENTITY{name:'1987th'}) - [:Relationship{name:' album to which belongs'}]-> (q) return q.name"}, {"query": "Can you name a person known as Yuan Wen, one of his representative works?", "cypher": "match (p:ENTITY{name:'\u60a0\u626c\u7434\u98ce'}) <-[:Relationship{name:' alias'}]-(h),(h) -[:Relationship{name:' representing work'}]->(n) return n.name order by n.name limit 1"}, {"query": "Do you know what happened at 7pm on October 31, 2014?", "cypher": "match (:ENTITY{name:'31 October 2014 at 7pm'}) <- [:Relationship{name:'event'}]- (m) return distinct m.name"}, {"query": "The following are some of the main achievements of the man who is originally named Tang.", "cypher": "match (:ENTITY{name:'Tang'}) <- [:Relationship{name:'original name'}]-(m) - [:Relationship{name:'main achievement'}]->(n) return n.name order by n.name limit 3"}, {"query": "Can you tell me about the 106 petrol, the industrial product?", "cypher": "match (p:ENTITY{name:'106 gasoline'}) --(h) with h order by h.name where h.name <> 'industrial product' return h.name"}, {"query": "I need to know 5 personal information about the 1.83m Pedrosa, OK?", "cypher": "match (n:ENTITY{name:'Pedrosa'}) - [:Relationship*]->(x) where x.name <>'1.83 m' return distinct x.name limit 5"}, {"query": "Where is the production area of the left bank of the river where Chen Changyu directed the TV series in 2014?", "cypher": "match ((:ENTITY{name:'On the Left Bank of the River [2014 TV series directed by Chen Changming]'}) - [:Relationship{name:'Production Area'}]-> (n) return n.name"}, {"query": "How old is Busan Pottery?", "cypher": "match (:ENTITY{name:'Boshan Ceramics'}) - [:Relationship{name:'History'}]-> (m) return distinct m.name"}, {"query": "Can you tell us about all the relationships that are contained in the six layers?", "cypher": "match path=(n) <- [:Relationship*6]- ((p:ENTITY{name:'\u4f59\u6d0b'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "Can you tell me everything you know about South Korean Prime Minister Park Geun-hye?", "cypher": "match (:ENTITY{name:'Park's column'}) - [:Relationship*1..3]-(p) return p.name limit 10"}, {"query": "Do you know who's representative is Julia?", "cypher": "match (:ENTITY{name:'Juliet'}) <- [:Relationship{name:'representing work'}]- (m) return distinct m.name"}, {"query": "I need to know the information from Christopher Kimball. Do you have it?", "cypher": "match (:ENTITY{name:'Christopher Kimball'}) --(h) return distinct h.name"}, {"query": "I would like to know which school won the main prize for the Civilization Unit of the whole of the Yangon county.", "cypher": "match (:ENTITY{name:'Tonghua County Civilization Unit'}) <- [:Relationship{name:'Main award'}]- (h) return h.name order by h.name"}, {"query": "You see what the newspapers say about the cause of the fire in the 12/19 Turungalau Hotel in the Philippines?", "cypher": "match ((:ENTITY{name:'12\u00b719 Philippines Turungalau Hotel fire'}) - [:Relationship{name:'cause of fire'}]-> (p) return p.name"}, {"query": "Can you tell me who Sunny Red is?", "cypher": "The name of the game is \"Skype\""}, {"query": "What five films has the director from Liaoning directed besides \"The Day of the Red Dragon\"?", "cypher": "match (n:ENTITY{name:'Lang-ning'}) <- [:Relationship{name:'place of birth'}]-(m) - [:Relationship{name:'representative work'}]->(x) where x.name <> 'red days' return distinct x.name limit 5"}, {"query": "What is the opposite of the near and far equivalent of peaches?", "cypher": "match (:ENTITY{name:'Relationship{name:'near term'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'counter term'}]->(m) return m.name as name"}, {"query": "I love racing cars so much, do you know what the top speed of this 1968 Lamborghini Espada is?", "cypher": "The game is played from a first-person perspective."}, {"query": "What are the next five works by Liu Bei that will be presented in the four relationships related to the Far East?", "cypher": "match (n:ENTITY{name:' distant\u4ead'}) - [*1..4]->(x) where x.name <>'square' return distinct x.name limit 5"}, {"query": "I would like to know the 103 pages of world literature titled: Tea Flower Girl and Related Information on the Two Levels of Relationships?", "cypher": "match (n:ENTITY{name:' difficult to fold children's paper size'}) - [:Relationship*1..2]->(x) where x.name <>'103 pages' return distinct x.name"}, {"query": "Please let me know about this person, Mick Foley.", "cypher": "match (:ENTITY{name:'Mick Foley'}) --(p) return distinct p.name"}, {"query": "Do you know the details of the book Nutritional Recipes for Infants 0-3 years old?", "cypher": "match (x:ENTITY{name:'0-3 years old infant and toddler nutritional supplement'}) --(n) with n order by n.name where n.name <> 'books' return n.name"}, {"query": "Can you find me the name of a doctor by profession?", "cypher": "match (:ENTITY{name:'doctor'}) <- [:Relationship{name:'profession'}]-(n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 3"}, {"query": "What movies have been released in 2016/9/23? Can you name eight?", "cypher": "Match (:ENTITY{name:'September 23, 2016'}) <- [:Relationship{name:'release time'}]- (h) return h.name limit 8"}, {"query": "Please list five representative works of this person born on July 22, 1976.", "cypher": "match (h:ENTITY{name:'22 July 1976'}) <- [:Relationship{name:'date of birth'}]-(n),(n) - [:Relationship{name:'represents work'}]->(m) return m.name skip 1 limit 5"}, {"query": "I would like to know the English name of the white-eye fungus, can you help me?", "cypher": "match ((:ENTITY{name:' white-colored rickets'}) - [:Relationship{name:' English alias'}]-> (n) return n.name"}, {"query": "I'm asking you, VIP Lover 2: Again, what is the first lady's novel genre?", "cypher": "Match ((:ENTITY{name:'VIP Lover 2: Meet the First Lady'}) - [:Relationship{name:'novel type'}]-> (n) return n.name"}, {"query": "Can you tell us about the professions of Jim Abrams?", "cypher": "match (:ENTITY{name:'Jim Eberly Hamms'}) - [:Relationship{name:'profession'}]-> (x) return x.name order by x.name"}, {"query": "Which dynasty was Li Xue emperor?", "cypher": "match (:ENTITY{name:'Lee Seung-Yu'}) - [:Relationship{name:'profession'}]-> (m) return distinct m.name"}, {"query": "Can you list the explosions that have caused one person to be injured?", "cypher": "match (:ENTITY{name:'1 person injured'}) <- [:Relationship{name:'injured'}]- (q) return distinct q.name"}, {"query": "Black and white format company?", "cypher": "match (p:ENTITY{name:' black and white format company'}) return p.location"}, {"query": "I would like to know all the information about the technical regulations for the functional zoning of nature reserves published by the National Forestry Administration.", "cypher": "match (n:ENTITY{name:'Technical protocol for functional demarcation of nature reserves'}) - [:Relationship*]->(x) where x.name <> 'National Forestry Bureau' return distinct x.name"}, {"query": "Can you describe in three sentences a model of excellence in performance management that achieves 100% of the goals?", "cypher": "match (:ENTITY{name:'100% achieving the goal'}) --(m) with m order by m.name return m.name limit 3"}, {"query": "What is the nature of the initial cash flow and what funds are included?", "cypher": "match (:ENTITY{name:' initial cash flow]'}) - [:Relationship{name:' essence'}]->(n) return n.name as name union all match (:ENTITY{name:' initial cash flow'}) - [:Relationship{name:' including '}]->(m) return m.name as name"}, {"query": "Help me find five species of animals that fall under the category of membrane-winged.", "cypher": "match (:ENTITY{name:' membrane wing'}) --(x) return distinct x.name limit 5"}, {"query": "The Chinese government has been trying to get the Chinese to leave the country.", "cypher": "match (:ENTITY{name:'Hangul'}) <- [:Relationship{name:'ethnicity'}]-(p),(p) - [:Relationship{name:'profession'}]->(q) return q.name skip 1 limit 1"}, {"query": "Can you tell me about the author of this book, who is building and managing digital cities?", "cypher": "match (:ENTITY{name:'Digital City Building and Management'}) <- [:Relationship{name:'Book name'}]- ((p) - [:Relationship{name:'author'}]->(n) return distinct n.name"}, {"query": "Can you tell me about the three companies that were founded in 2017?", "cypher": "match (:ENTITY{name:'2017'}) <- [:Relationship{name:'time of establishment'}]-(n) - [:Relationship{name:'company name'}]->(q) return distinct q.name limit 3"}, {"query": "Who is the songwriter and publisher of crazy?", "cypher": "match (:ENTITY{name:'crazy[original song]'}) - [:Relationship{name:'original song'}]->(n) return n.name as name union all match (:ENTITY{name:'crazy[original song]'}) - [:Relationship{name:'issue company'}]->(m) return m.name as name"}, {"query": "Can you find information on the three levels of relationship between your aunt and uncle?", "cypher": "match (n:ENTITY{name:'presented as aunt and uncle'}) - [*1..3]->(x) where x.name <> '' return distinct x.name"}, {"query": "Is there any other information documented about the 12 core single-mode optical cable technology?", "cypher": "match (:ENTITY{name:'12 core mono-mode optical cable'}) --(q) with q order by q.name where q.name <> 'technology' return q.name"}, {"query": "What are the attributes of the tags that should be matched 100 days ago?", "cypher": "match (:ENTITY{name:'100 days ago'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}]