[{"query": "Do you know of any other names for ants besides the whitefly and the caterpillar?", "cypher": "match (n:ENTITY{name:''}) - [:Relationship{name:'alias'}]->(h) where h.name <> 'whites' and h.name <> 'parasites' return distinct h.name limit 2"}, {"query": "Do you know what the English name for oral thrush is?", "cypher": "match ((:ENTITY{name:' mouthpiece'}) - [:Relationship{name:' English name'}]-> (n) return n.name"}, {"query": "Please tell me what event is going to be held on September 3, 4, and 9.", "cypher": "match (q:ENTITY{name:'March, April, September'}) <- [:Relationship{name:'time of holding'}]- (h) return distinct h.name"}, {"query": "Tell me more about the King and Queen in person?", "cypher": "match (:ENTITY{name:'The King and I's in Love'}) --(h) with h order by h.name return h.name"}, {"query": "Can anyone tell me what famous places are in Jiangnan? Can I recommend two?", "cypher": "match (:ENTITY{name:'Jiangnan, literally meaning south of the Yangtze, in the human geographical concept of south of the lower reaches of the Yangtze River\u3002'}) <-[:Describe{name:'description'}]-(q) -[:Relationship{name:'famous attractions'}]->(m) return distinct m.name limit 2"}, {"query": "The article also highlighted the importance of the fact that the Chinese government has not yet given any official information about the activities of the company.", "cypher": "match (:ENTITY{name:'Jining Peak Consultancy Co. Ltd'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'organization' return p.name limit 1"}, {"query": "What is the shortest relationship path between the two layers of the poem Autumn and Dream Day?", "cypher": "The following pages link to List of all-time shortest paths in the history of the world:"}, {"query": "Can you name some of the characters representing the work on the road?", "cypher": "match (:ENTITY{name:'on the way'}) <- [:Relationship{name:'representing work'}]- (m) return m.name order by m.name limit 5"}, {"query": "(S) -3-aminodinol has a very good labeling characteristic?", "cypher": "match (:ENTITY{name:'(S)-3-aminobutyric acid'}) - [:Tag{name:'label'}]-> (q) with q order by q.name return q.name"}, {"query": "I would like to know the introduction of the four layers of relations between the research of the book and the development of IP policy.", "cypher": "match (n:ENTITY{name:' Intellectual property development policy research'}) - [*1..4]->(x) where x.name <> 'book name' return distinct x.name"}, {"query": "Do you know what this guy does who graduated from Southwest Transportation University? Can you name five?", "cypher": "match (:ENTITY{name:'Southwest Transportation University'}) <- [:Relationship{name:' Graduate School'}]-(m),(m) - [:Relationship{name:' Career'}]->(q) return q.name skip 2 limit 10"}, {"query": "What is the shortest relationship path between the Greek men's national football team and the Argentine men's national football team in the two tiers?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'The Greek national men's football team'}) - [:Relationship*..2]-(b:ENTITY{name:'The Argentine national men's football team'})) return count ((p)"}, {"query": "What are the main works of people born on April 22, 1988?", "cypher": "match (:ENTITY{name:'22 April 1988'}) <- [:Relationship{name:'date of birth'}]-(p) - [:Relationship{name:'main work'}]->(h) return distinct h.name"}, {"query": "You sure don't know about UFOs?", "cypher": "match (n:ENTITY{name:'UFO'}) where n is not null return 1"}, {"query": "In addition to the city of Simfon, what other areas have license plates for vehicles with the number \"B\"?", "cypher": "match (:ENTITY{name:' B'}) <- [:Relationship{name:'plate code'}]-(m) where m.name <> 'Chenfeng County' return distinct m.name"}, {"query": "Besides being a private university, can you tell me about the six things you know about the Hunan Transportation Engineering College on the second floor?", "cypher": "match (:ENTITY{name:' International Sports Information Association'}) - [:Relationship*1..2]->(p) where p.name <> 'private university' return p.name limit 6 The name of the university is not known"}, {"query": "Can you help me find out which companies have a turnover of \u20ac19.3 billion next year and tell me how many employees they have?", "cypher": "match (:ENTITY{name:'193 billion euros'}) <- [:Relationship{name:'yearly turnover'}]-(h),(h) - [:Relationship{name:'number of employees'}]->(q) return distinct h.name,q.name"}, {"query": "What is the shortest path between the two levels of Moon Village and Kiru Village?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'\u6708\u7259\u6751[Yunnan Province, Changchun County, Jiangsu Province]'}) - [*..2]-(b:ENTITY{name:'Kiru village'})) return count ((p)"}, {"query": "What is Zhang Yiwei's first name?", "cypher": "match (:ENTITY{name:'s) - [:Relationship{name:'s}]-> (x) return distinct x.name"}, {"query": "What else do you know about it besides the fact that the ELISA test box was invented in the 60s and 70s?", "cypher": "match (:ENTITY{name:'elisa test box'}) - [*1..3]-(p) where p.name <> '60-70s' return p.name limit 6"}, {"query": "Tell me a simple introduction to the software within the two-tier relationship of Chinese software wholesale assistant?", "cypher": "match (n:ENTITY{name:' wholesale assistant'}) - [:Relationship*1..2]->(x) where x.name<>'simplified Chinese' return distinct x.name"}, {"query": "Please help me find the names of 10 companies in Chengdu.", "cypher": "match (:ENTITY{name:'\u6210\u90fd'}) <--(m) ,(m) - [:Relationship{name:' company name'}]->(n) return n.name limit 10"}, {"query": "I'm not sure if you can find a name for this animal species.", "cypher": "match (q:ENTITY{name:'animal domain'}) <-[:Relationship{name:'animal domain'}]-(h),(h) -[:Relationship{name:'alias'}]->(x) return distinct x.name limit 1"}, {"query": "Did you have trouble asking about the two-tier relationship of Uzamukunda Elias, who weighs 77 kg?", "cypher": "match (n:ENTITY{name:'Uzamukunda Elias'}) - [*1..2]->(x) where x.name <>'77 kg' return distinct x.name"}, {"query": "The last chapter of the book is the chapter of the book of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, the last chapter is the chapter of the dead, how many words are there, the writing progress is what progress is?", "cypher": "match (:ENTITY{name:'thing is not yesterday'}) - [:Relationship{name:'last chapter'}]->(n) return n.name as name union all match (:ENTITY{name:'thing is not yesterday'}) - [:Relationship{name:'word'}]->(m) return m.name as name union all match (:ENTITY{name:'thing is not yesterday'}) - [:Relationship{name:'writing progress'}]->(r) return r.name as name"}, {"query": "Which books and which books are published by the same publisher and what are the labels?", "cypher": "The following is a list of all the different ways The Great Wall of China is credited in the database: [https://www.theworldwarfare.org/wiki/The Great Wall of China]"}, {"query": "Who among us is a French-born illusionist?", "cypher": "match (:ENTITY{name:'philosopher'}) <- [:Relationship{name:'profession'}]- ((m), (m) - [:Relationship{name:'place of birth'}]->(n) where n.name='French Maisons-Laffitte' return m.name"}, {"query": "Can you recommend me some topics for the National Practitioner Qualification Test series?", "cypher": "match (:ENTITY{name:' National Practising Physician Qualification Exam Test Series'}) <- [:Relationship{name:'spoonful name'}]- (m) return m.name"}, {"query": "Can you find me the names of the five associate professors and their colleges?", "cypher": "match (:ENTITY{name:'adjunct professor'}) <- [:Relationship{name:'profession'}]-(h),(h) - [:Relationship{name:'graduate college'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "I would like to share with you the top 5 articles.", "cypher": "match (:ENTITY{name:'Lio City Experimental Secondary School'}) --(q) return q.name order by q.name limit 5"}, {"query": "The group was also named the most visible group in the 2014 \"Media of the Year\" by the BBC.", "cypher": "match (:ENTITY{name:'2014 Silicon Media - most visible group'}) <- [:Relationship{name:' major achievements'}]- (h) return distinct h.name"}, {"query": "The film premiered on August 29, 2014 and is titled What's Your Name?", "cypher": "Match (:ENTITY{name:'August 29, 2014'}) <- [:Relationship{name:'premiere time'}]- (p) return distinct p.name"}, {"query": "What do people in Fujian do?", "cypher": "match (:ENTITY{name:'Fujiang Yuen'}) <- [:Relationship{name:'\u7c4d\u8d2f'}]- ((m) - [:Relationship{name:'profession'}]->(n) return distinct n.name"}, {"query": "Is it a good idea to fight?", "cypher": "match (n:ENTITY{name:'Zhang Zhang'}) --(x) return distinct x.name"}, {"query": "Can you name three people or works related to Laos?", "cypher": "match (:ENTITY{name:'spoon'}) --(n) return distinct n.name limit 3"}, {"query": "The first is the idea of a new kind of literature, a new kind of literature, a new kind of literature, a new kind of literature.", "cypher": "match (n:ENTITY{name:' and rich'}) - [:Relationship*1..3]->(x) where x.name <> 'literary work' return distinct x.name"}, {"query": "Do you know the area code of Taihara, a city in the former Shaanxi province?", "cypher": "match (:ENTITY{name:'the area code of Taihara City, Taihara Prefecture, Hasanasi Province'}) <- [:Relationship{name:'0351'}]- (p) return p.name"}, {"query": "The female role in the film is?", "cypher": "match (p:ENTITY{name:'Please six-man lineup'}) <--(x) -->(q:ENTITY{name:'woman'}) return x.name"}, {"query": "I heard that there were many babies at the first boutique jewelry fair in 2013 in Shanxi, do you know the scope of the exhibition?", "cypher": "match ((:ENTITY{name:'2013 Shanxi Grand Prix at the first boutique jewelry exhibition'}) - [:Relationship{name:'scale of exhibition'}]-> (p) return p.name"}, {"query": "Please help me find out what are the three desserts and their ingredients?", "cypher": "match (:ENTITY{name:' dessert'}) <- [*]-(m), (m) - [:Relationship{name:' accessory'}]->(n) return m.name, n.name limit 3 The name of the game is not available in English"}, {"query": "I wonder what the relationship is between the five levels involved in the Villa Beach Hotel?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'Bivilla Beach Hotel'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What is the shortest path between the twin boys and the rose dance on the 2nd floor?", "cypher": "Match p=allshortestpaths (((a:ENTITY{name:'Both boys'}) - [:Relationship*..2]-(b:ENTITY{name:'The dance of the flowers'})) return count ((p)"}, {"query": "Where are the 168 people doing? Write three I's", "cypher": "match (:ENTITY{name:'168cm'}) <- [:Relationship{name:'height'}]-(q),(q) - [:Relationship{name:'profession'}]->(p) return p.name order by p.name limit 3"}, {"query": "What is the shortest path between the two levels of the village and the training camp?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:' to replace block village'}) - [*..2]-(b:ENTITY{name:' to teach camp'})) return count ((p)"}, {"query": "Can you tell us about some of the most representative works of Lu Xun?", "cypher": "match (:ENTITY{name:'Landlock'}) - [:Relationship{name:'representing work'}]-> (m) return m.name skip 2"}, {"query": "Do you know which legal books are available? Please introduce me to 5 of them.", "cypher": "match (:ENTITY{name:' legal books'}) <- [:Tag{name:' labels'}]-(x),(x) - [:Relationship{name:' book names'}]->(q) return distinct q.name limit 5"}, {"query": "The book is a collection of short stories, including a book about the life of the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a book about the sea, a sea, a book about the sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a sea, a", "cypher": "match (n:ENTITY{name:'Marine literature encyclopedia 53: The Yellow Book of the House of Liu'}) - [*]->(x) where x.name <>'470 pages' return distinct x.name limit 5"}, {"query": "Can you tell me about the 1000 border label?", "cypher": "match (:ENTITY{name:'1000 boundary'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 1"}, {"query": "Do you have any information about the names of the relationships at the two levels involved?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'\u67f3\u5c0f\u5c0f'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "The Chinese and foreign joint ventures are all called what?", "cypher": "match (:ENTITY{name:' limited liability company ((China and foreign joint venture) '}) <--(n) return n.name limit 5"}, {"query": "The main achievements of Maren Ad are mentioned.", "cypher": "match (:ENTITY{name:'Marlon Ad'}) - [:Relationship{name:'major achievement'}]-> (x) return x.name skip 1"}, {"query": "What is the name of a spinach made from flowers, cherries, and oranges?", "cypher": "match (:ENTITY{name:'flower, field pepper'}) <- [:Relationship{name:'main ingredient'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='spinach' return distinct m.name"}, {"query": "Do you know the language used in this film and other films to describe the same as the one used in The Exorcist 2015? Tell me what the labels are for each of these films, and how they are listed in order of the number of labels for each film?", "cypher": "match (n:ENTITY{name:'ghostdriver2015'}) - [:Relationship{name:'for white language'}]->(:ENTITY) <-[:Relationship{name:'for white language'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) BY ORDER c"}, {"query": "Tell me about the Shandong Civil Service Exam Network?", "cypher": "match (n:ENTITY{name:'Santon Civil Servants Examination Network'}) --(x) return distinct x.name"}, {"query": "What are the films produced in Poland? Can you tell me five lines?", "cypher": "match (:ENTITY{name:'Poland'}) <- [:Relationship{name:'production area'}]- (n) return n.name limit 5"}, {"query": "Tell me more about the 125 buy-in?", "cypher": "match (:ENTITY{name:'125 group purchase'}) --(x) with x order by x.name return x.name"}, {"query": "Can you tell me about the relationship between the two layers of the four infinite holy heavens?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:' the infinite nearness of heaven'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 4"}, {"query": "Can you tell me the Chinese name of Zarah's child?", "cypher": "match (:ENTITY{name:'Zarah kid'}) <- [:Relationship{name:'author'}]-(n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 1"}, {"query": "I need to know him.", "cypher": "match (:ENTITY{name:'Peter Helm'}) --(p) return distinct p.name"}, {"query": "Who can find the 5 tags for 18/22?", "cypher": "match (:ENTITY{name:'18/22'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name return h.name limit 5"}, {"query": "What are the 3GPP standards?", "cypher": "match (:ENTITY{name:'3GPP'}) - [:Relationship{name:'standard'}]->(m) return distinct m.name"}, {"query": "What happened in the collapse of a demolition house in Beijing's Soyang district on 12/23?", "cypher": "match ((:ENTITY{name:'12\u00b723 Beijing Xiaoying area demolition house collapse accident'}) - [:Relationship{name:' incident'}]-> (m) return m.name"}, {"query": "Do you know how many 26th volume of the manga series are there? Can you recommend 6?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "Which companies and which brands of clothes were founded on the same day as RIZAN SHINA Clothing Ltd. in Manchuria? Please list the companies in order of number of labels, from large to small.", "cypher": "match (n:ENTITY{name:'Rizhanshina Clothing Limited'}) - [:Relationship{name:'time of establishment'}]->(:ENTITY) <-[:Relationship{name:'time of establishment'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count ((r) as c, collect ((r.name) ORDER BY DESC "}, {"query": "What is the shortest path between the two layers of learning, Marxist political economy innovation and the construction of a contemporary harmonious society and communication principles?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Marxist political economy innovation and the construction of a contemporary harmonious society'}) - [*..2]-(b:ENTITY{name:'Communication principles learning guidance'})) return count ((p)"}, {"query": "Do you know which chemical has the symbol Xi for danger?", "cypher": "match (:ENTITY{name:'Xi'}) <- [:Relationship{name:'danger symbol'}]- (x) return distinct x.name"}, {"query": "Don't talk to strangers Do you know the time of the movie?", "cypher": "match (:ENTITY{name:'Do not talk to strangers'}) <- [:Relationship{name:'Chinese name'}]-(p) - [:Relationship{name:'release time'}]->(n) return distinct n.name"}, {"query": "I want to go to the company of the head of the company, where should I go?", "cypher": "match (p:ENTITY{name:'Pinkhead Company'}) return p.location The name of the company is P.P.P.P."}, {"query": "Can you recommend 9 TV series that are on Eastern Television?", "cypher": "match (:ENTITY{name:'Eastern Defence'}) <- [:Relationship{name:' broadcast platform'}]- (q) return q.name limit 9"}, {"query": "The year the Trojans were developed?", "cypher": "match (:ENTITY{name:'Cherokee-type hydrogen anti-tank missile'}) - [:Relationship{name:'Research and development'}]->(m) return distinct m.name"}, {"query": "The following is a list of the four levels of relationships that the fisherman Ao has with the word \"alcohol\" when he advises the worker to use it.", "cypher": "match (n:ENTITY{name:' fisherman arrogant; admonishes the customer to drink when singing'}) - [*1..4]->(x) where x.name <> 'word' return distinct x.name limit 5"}, {"query": "Can you tell me what kind of relationships are covered in the paint job network in the 3 layers? Can you list 3?", "cypher": "The following pages link to the list of UNWIND relationships:"}, {"query": "Please help me find two books for $10.8 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'10.8\u5143'}) <- [:Relationship{name:' priced'}]-(h),(h) - [:Relationship{name:' time of publication'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "How do you describe the appearance of Kangaroo net semihydrate in physical terms?", "cypher": "match ((:ENTITY{name:'Cangler net semihydrate'}) - [:Relationship{name:' appearance'}]-> (m) return m.name"}, {"query": "The party committee chairman, who is in charge of the overall work of the party, asked Li Xiaozhuo to give 10 different types of job titles.", "cypher": "match (:ENTITY{name:'Presiding over the overall work of the Party Committee, contacting Li Xiaozhi Village'}) <-[:Relationship{name:'work'}]-(q) -[:Relationship{name:'profession'}]->(h) where h.name <> 'person big chairman' return distinct h.name limit 10"}, {"query": "Besides the wax, can you tell me three things you know about the two layers of the Chinese Western mother-of-pearl painting?", "cypher": "match (:ENTITY{name:'Changzhou's painting of the Western mother-child's painting'}) - [*1..2]->(p) where p.name <> 'Changzhou' return distinct p.name limit 3"}, {"query": "What events have been held at the Dalian Star Bay Expo Center?", "cypher": "match (:ENTITY{name:'Dalian Star Sea Convention Centre'}) <- [:Relationship{name:'Holding place'}]- (q) return q.name"}, {"query": "It's interesting to hear about the 2012 China International Health and Beauty Expo, do you know the date?", "cypher": "match ((:ENTITY{name:'2012 China International Health and Beauty Fair'}) - [:Relationship{name:' Exhibition date'}]-> (x) return x.name"}, {"query": "Can you list the main works of the three actors who graduated from the acting department of the 2007 JNU?", "cypher": "match (x:ENTITY{name:'2007 class of performing arts department'}) <- [:Relationship{name:'graduate school'}]-(q),(q) - [:Relationship{name:'main works'}]->(h) return distinct h.name limit 3"}, {"query": "Did you find the three tags for 12345?", "cypher": "match (:ENTITY{name:'12345 fuel'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 3"}, {"query": "Can you recommend two completed novels?", "cypher": "match (:ENTITY{name:' completed'}) <- [:Relationship{name:' connected state'}]- (h) return h.name limit 2"}, {"query": "And what will explain to you the story of the Quraysh?", "cypher": "match (n:ENTITY{name:'cheng da xing'}) where n is not null return 1"}, {"query": "Can you tell me about the five most prominent jobs in Pan?", "cypher": "match (:ENTITY{name:'Pan Zhong'}) <--(x) -[:Relationship{name:'Profession'}]->(m) return m.name order by m.name limit 5"}, {"query": "What is the Chinese name of Revelation 11?", "cypher": "match (:ENTITY{name:'11 Revelation'}) - [:Relationship{name:'Chinese name'}]-> (q) with q order by q.name return distinct q.name"}, {"query": "The incident in the Sichuan city of Xiamen, on the other hand, is a major social event.", "cypher": "match (:ENTITY{name:'11.27 Sichuan Huizhou fort collapse accident'}) --(x) with x order by x.name where x.name <> 'social event' return x.name"}, {"query": "Where is the collection of the King's Musical Works? How many are there?", "cypher": "match (:ENTITY{name:'Shanghai's Songbook'}) - [:Relationship{name:'Collected in '}]->(n) return n.name as name union all match (:ENTITY{name:'Shanghai's Songbook'}) - [:Relationship{name:'Shanghai's Songbook'}]->(m) return m.name as name"}, {"query": "Can you tell me the three professions of this man? He is of the Great Khmer Nation.", "cypher": "match (:ENTITY{name:'big and ethnic'}) <-[:Relationship{name:'ethnic'}]-(q) -[:Relationship{name:'profession'}]->(n) return n.name skip 2 limit 10"}, {"query": "I wonder who was born in Augsburg, Bavaria?", "cypher": "match (:ENTITY{name:'Bavaria Augsburg'}) <- [:Relationship{name:'place of birth'}]-(p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name"}, {"query": "Find me one of the biggest Southeast Asian regional sports events that is held every few years.", "cypher": "match (:ENTITY{name:'Big comprehensive regional sporting event in Southeast Asia'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'every gap'}->(n) return m.name,n.name limit 1"}, {"query": "Pick three types of openings [starting platinum-selling novel by a dancing writer] that are relevant to the author other than dancing?", "cypher": "match (:ENTITY{name:'Thanks for the help]}) --(m) with m order by m.name where m.name <> 'dance' return distinct m.name limit 3"}, {"query": "What kind of song language is used in the solo single Ringa Linga by the singing group BigBang member Sun?", "cypher": "match ((:ENTITY{name:'Ringa Linga'}) - [:Relationship{name:'Language of the song'}]-> (m) return m.name"}, {"query": "Can you tell us about the two-tiered relationship of the Little Witch's Legend published by Jinnan Publishing?", "cypher": "match (n:ENTITY{name:'Little Witch Legend'}) - [:Relationship*1..2]->(x) where x.name <>'Jinan Publishing' return distinct x.name"}, {"query": "What is the main ingredient of rabbit meat?", "cypher": "Match (:ENTITY{name:'crow's nest'}) - [:Relationship{name:'main ingredient'}]-> (m) return distinct m.name"}, {"query": "What are some of the most iconic works of Carrie King?", "cypher": "match (:ENTITY{name:'Kelly Kim'}) - [:Relationship{name:'representing work'}]-> (m) return distinct m.name"}, {"query": "Please help me find three books published by China Standard Publishing, who are the authors?", "cypher": "match (:ENTITY{name:'China Standard Publishing'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'author'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Can you name the occupations of Chinese people? Name three, please?", "cypher": "match (n:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]-(p),(p) - [:Relationship{name:'profession'}]->(q) return distinct q.name limit 3"}, {"query": "In addition to Kingdom Hearts, which other films has Libra actors been in?", "cypher": "match (:ENTITY{name:'Libra'}) <- [:Relationship{name:'star'}]-(x),(x) - [:Relationship{name:'representative work'}]->(n) where n.name <> 'Heavenly love' return distinct n.name limit 1"}, {"query": "What are the exhibition activities on luxury goods? Name eight?", "cypher": "match (:ENTITY{name:'luxury'}) <- [:Relationship{name:'industry'}]- (h) return h.name limit 8"}, {"query": "Tell me about the three-tiered relationship between the five Tang Dynasty suburb lyrics, Prince Zhou Zhenzong and this piece.", "cypher": "match (n:ENTITY{name:' suburbia lyrics\u00b7 enjoy the secret prince's orchestra\u00b7 sincerity and '}) - [*1..5]->(x) where x.name <>'\u5510' return distinct x.name limit 5"}, {"query": "I'm not sure if you're familiar with the story, but I'm not sure if you're familiar with the story.", "cypher": "match (:ENTITY{name:'Ousmane [Senegalese novelist]'}) --(h) return h.name order by h.name"}, {"query": "What brands of tobacco are used in the Long Spring cigarette factory?", "cypher": "match (:ENTITY{name:'Changchun Tobacco Factory'}) <- [:Relationship{name:'Affiliated company'}]- (mn) - [:Relationship{name:'Affiliated industry'}]->(n:ENTITY{name:'Tobacco'}) return mn.name"}, {"query": "Tell us about five things about Yang Liyun, a Beijing-born Chinese writer.", "cypher": "match (n:ENTITY{name:'Yun'}) - [*]->(x) where x.name<>'Beijing' return distinct x.name limit 5"}, {"query": "Can you tell me some of the tricks?", "cypher": "match (:ENTITY{name:'Third Party'}) <- [:Relationship{name:'Program type'}]- (n) return distinct n.name"}, {"query": "Can you help me find the ICP file number for 028 Chengdu Training Network?", "cypher": "match ((:ENTITY{name:'028 Chengdu training network'}) - [:Relationship{name:'ICP file number'}]-> (h) return h.name"}, {"query": "Check out the personal information in Diack Robbie's six-level relationship in South Africa.", "cypher": "match (n:ENTITY{name:'Diack Robbie'}) - [*1..6]->(x) where x.name <> 'South Africa' return distinct x.name limit 5"}, {"query": "The article was written by a journalist from the city of Chiang Mai, who is also a journalist.", "cypher": "match (x:ENTITY{name:'Patrick Mario Bernard'}) - [:Relationship{name:'profession'}]-> (m) return distinct m.name"}, {"query": "The author of the book Science and Art, written by Liu Xiaobo, born in September 1938, recommends another of his works to me.", "cypher": "match (:ENTITY{name:'September 1938'}) <- [:Relationship{name:'date of birth'}]-(q) - [:Relationship{name:'representative work'}]->(p) where p.name <> 'Relationship' return distinct p.name limit 1"}, {"query": "Can you find me five publications published by the People's Court Press?", "cypher": "match (:ENTITY{name:'People's Court Publishing House'}) <- [:Relationship{name:'People's Court Publishing House'}]-(h),(h) - [:Relationship{name:'Book name'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Who was the historical figure born on March 30, 1764?", "cypher": "match (:ENTITY{name:'30 March 1764'}) <- [:Relationship{name:'date of death'}]- (m) return m.name"}, {"query": "Can you tell me how many songs ZENTA has written?", "cypher": "match (:ENTITY{name:'ZENTA'}) <- [:Relationship{name:'compiled'}]- (m) return distinct m.name"}, {"query": "I'm going to ask you about the artistic activities of the artists' category. Can you list five?", "cypher": "match (:ENTITY{name:' artist'}) <- [:Tag{name:' tag'}]- ((h) - [:Relationship{name:' activity'}]->(x) return distinct x.name limit 5"}, {"query": "Can you name one thing that 1-methylglycerol has that is not natural?", "cypher": "match (:ENTITY{name:'1-methanal glycerol'}) --(p) with p order by p.name where p.name <> 'natural' return p.name limit 1"}, {"query": "What is the profession of people born on November 21?", "cypher": "match (:ENTITY{name:'November 21'}) <- [:Relationship{name:' date of birth'}]- ((q),(q) - [:Relationship{name:' profession'}]->(p) return distinct p.name"}, {"query": "Which two authors' books were published by Sichuan University of Electronics and Technology?", "cypher": "match (:ENTITY{name:' Sichuan University of Electronics and Technology'}) <- [:Relationship{name:' publisher'}]-(x),(x) - [:Relationship{name:' author'}]->(q) return distinct q.name limit 2"}, {"query": "What is the purpose of the pronoun that provides the necessary information?", "cypher": "match (:ENTITY{name:' provided necessary information'}) <- [:Relationship{name:' purpose'}]- (q) return distinct q.name"}, {"query": "What is the name of the yellow-bellied parrot in English?", "cypher": "match (:ENTITY{name:' yellow ventricle'}) <- [:Relationship{name:' species'}]- ((x) - [:Relationship{name:' English name'}]->(q) return distinct q.name limit 1"}, {"query": "Are you familiar with the material properties of 18Mn2CrMoBA?", "cypher": "match ((:ENTITY{name:'18Mn2CrMoBA'}) - [:Relationship{name:'material properties'}]-> (n) return n.name"}, {"query": "Please check out the main awards that this person, Selena Peak, has won, I will give you two awards in addition to the Swedish Masters Mixed Doubles Championship in 2015 and the Dutch Grand Prix Women's Doubles Championship in 2014.", "cypher": "match (n:ENTITY{name:'Selena Pick'}) - [:Relationship{name:'main award'}]->(h) where h.name <> '2015 Swedish Badminton Masters mixed doubles champion' and h.name <> '2014 Dutch Badminton Grand Prix women's doubles champion' return distinct h.name limit 2"}, {"query": "Can you see the 281 pages of the bi-layered relationship between life sentence and environmental crime research?", "cypher": "match (n:ENTITY{name:' Life Criminal Law and Environmental Criminal Law Research'}) - [:Relationship*1..2]->(x) where x.name <>'281 pages' return distinct x.name"}, {"query": "Can you help me find 50 works of literature with 16 pages?", "cypher": "The following is a list of all the characters that appear in the game."}, {"query": "The 15th century is the 15th century in history.", "cypher": "Match (:ENTITY{name:'15th century'}) <- [:Relationship{name:'century'}]- (n) return n.name"}]