[{"query": "I would like to know what happened at 11am on December 29, 2017?", "cypher": "match (:ENTITY{name:'December 29, 2017 at 11 am'}) <- [:Relationship{name:'time of occurrence'}]- (n) return distinct n.name"}, {"query": "The Type 039B submarine we are using now is made by which country?", "cypher": "The name of the sub is \"Relationship\" (Relationship)"}, {"query": "Do you know who is a master's student tutor? Can you name three?", "cypher": "match (:ENTITY{name:'master's student's tutor'}) <- [:Relationship{name:'profession'}]- (n) return distinct n.name limit 3"}, {"query": "168 Life Net is something other than a technical label?", "cypher": "match (:ENTITY{name:'168 lifenet'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'technology' return x.name"}, {"query": "Can you put a label on the accident at the construction site of the tunnel collapse in Guangxi on October 10?", "cypher": "match (:ENTITY{name:'10.10 Guangxi German Security during tunnel collapse'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name return p.name limit 1"}, {"query": "Can you recommend a novel for me in the social/official category?", "cypher": "match (:ENTITY{name:' social/official fiction'}) <- [:Relationship{name:' category'}]- (n) return n.name"}, {"query": "So let me calculate what is the molecular weight of 7-diamethylsanoic acid-4-acetate?", "cypher": "match ((:ENTITY{name:'7-diamethylbenzoyl-4-acetyl'}) - [:Relationship{name:'molecular mass'}]-> (p) return p.name"}, {"query": "The following is a list of the top ten websites with the name 110BBS.", "cypher": "match (q:ENTITY{name:'110BBS URL navigation'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'website' return n.name limit 10"}, {"query": "In 4 sentences, what is the 11/24 Quizhou coal mine disaster?", "cypher": "match (:ENTITY{name:'11\u00b724 Guangzhou Chongqing coal mine accident'}) --(p) with p order by p.name return p.name limit 4"}, {"query": "What is the content of the book D for children aged 0 to 2?", "cypher": "match (:ENTITY{name:'0-2 years old doll book D'}) --(q) with q order by q.name return q.name"}, {"query": "Do you know which author's works are representative of the Gr?s?nklingar?", "cypher": "match (:ENTITY{name:' Gr?s?nklingar ?? etc'}) <- [:Relationship{name:'represents work'}]- (m) return m.name"}, {"query": "The project covers 20 provincial cities and is called \"The Plan\".", "cypher": "match (:ENTITY{name:'20 provincial municipalities'}) <- [:Relationship{name:'coverage'}]- (p) return p.name"}, {"query": "Do you know his main achievements? Can you name 10?", "cypher": "match (:ENTITY{name:'???'}) <- [:Relationship{name:'foreign language name'}]-(n),(n) - [:Relationship{name:'main achievement'}]->(m) return m.name order by m.name limit 10"}, {"query": "So what's the factorization of 22 times 31?", "cypher": "match (:ENTITY{name:'22\u00d731'}) <- [:Relationship{name:'factored'}]- (m) return m.name"}, {"query": "A word about the 123 Slimmm Weight Loss Forum?", "cypher": "match (:ENTITY{name:'123 lean mm weight loss forum'}) --(n) with n order by n.name where n.name <> 'website' return n.name skip 1 limit 1"}, {"query": "And what will anyone know of what the noble ones did?", "cypher": "match (:ENTITY{name:'was noble'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'profession'}]->(h) return distinct h.name limit 1"}, {"query": "What is an electronic device with a maximum input power of 1W (average)?", "cypher": "match (:ENTITY{name:'1 W(average value) '}) <- [:Relationship{name:'maximum input power'}]- (x) return x.name"}, {"query": "Tell me about the four or five species you recognize?", "cypher": "match (:ENTITY{name:'04 in view1'}) --(q) with q order by q.name where q.name <> 'species' return q.name"}, {"query": "Can you name the names of the five people who died on July 15, 2010?", "cypher": "match (:ENTITY{name:'15 July 2010'}) <- [:Relationship{name:'date of death'}]-(h),(h) - [:Relationship{name:'alias'}]->(p) return distinct p.name limit 5"}, {"query": "Help me find the words next to the five arrows.", "cypher": "match (:ENTITY{name:'bow'}) <- [:Relationship{name:'part'}]-(m) return distinct m.name limit 5"}, {"query": "Can you help me find 10 of them, where are they located?", "cypher": "match (:ENTITY{name:'public office college'}) <- [*]-(m),(m) - [:Relationship{name:'area'}]->(n) return m.name,n.name limit 10"}, {"query": "The emperor's reign seems to be over after his cold rejection, you tell me?", "cypher": "match (:ENTITY{name:' freeze-dumped to take the throne'}) --(q) with q order by q.name where q.name <> 'completed' return q.name"}, {"query": "Can you please check out the developer and software platform of the corn helper?", "cypher": "match (:ENTITY{name:'corn assistant'}) - [:Relationship{name:'developer'}]->(n) return n.name as name union all match (:ENTITY{name:'corn assistant'}) - [:Relationship{name:'software platform'}]->(m) return m.name as name union all match (:ENTITY{name:'corn assistant'}) - [:Relationship{name:'category'}]-(r>) return r.name as name"}, {"query": "Do you know who the most representative of the water cannon is? Can you name five?", "cypher": "match (m:ENTITY{name:'Relationship{name:'representative work'}]) - (p) return distinct p.name limit 5"}, {"query": "Do you know which games don't have a time stamp? Name three?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What software is updated on 2016-10-05?", "cypher": "match (:ENTITY{name:'2016-10-05'}) <- [:Relationship{name:'updated time'}]- (m) return distinct m.name"}, {"query": "How many of you are the founders of the Student Volunteer Fire Department at the Sichuan Vocational Technical University?", "cypher": "match (:ENTITY{name:'Shaanxi Vocational Technical College College College Student Volunteer Firefighters'}) - [:Relationship{name:'founder'}]-> (x) return distinct x.name"}, {"query": "What else do you know about gossip besides being the second Prime Minister of Singapore?", "cypher": "match (:ENTITY{name:'Relationship*1..2]-(p) where p.name <> 'Singapore's second Prime Minister' return p.name limit 10"}, {"query": "What are the main departments of the Wuhan School of Law and Political Economy at South Central University?", "cypher": "match (:ENTITY{name:'Wuhan College of Law and Political Science of South China University'}) - [:Relationship{name:'main faculty'}]-> (h) return distinct h.name"}, {"query": "Can you recommend five novels for the youth class?", "cypher": "match (:ENTITY{name:'youth campus'}) <- [:Relationship{name:'novel type'}]- (q) return distinct q.name limit 5"}, {"query": "Did you have trouble telling me what Steven does for a living?", "cypher": "match (:ENTITY{name:'Shyun'}) <- [:Relationship{name:'Chinese name'}]- ((q) - [:Relationship{name:'profession'}]->(p) return distinct q.name"}, {"query": "Tell me, what is the top 10 career draw of Dan Castellaneta?", "cypher": "match (:ENTITY{name:'Dan Castellaneta'}) - [:Relationship{name:'profession'}]-> (h) with h order by h.name return h.name limit 10"}, {"query": "I'm not sure if you can tell me about the three messages that you have for me besides the passion films.", "cypher": "match (:ENTITY{name:'\u9b45\u964c\u53cc'}) --(m) with m order by m.name where m.name <> 'Dramatic film' return distinct m.name limit 3"}, {"query": "Do you know which schools are the provincial priority primary schools, the national exemplary experimental primary schools?", "cypher": "match (:ENTITY{name:' Primary school of priority province, national model experimental primary school'}) <- [:Relationship{name:' school attribute'}]- (p) return p.name"}, {"query": "I wonder if there are any other people who have been involved in the accident, including Li Zhenbao, SJ, Zhang Xilong, and Liu Yusung?", "cypher": "match (n:ENTITY{name:'Li Zhenbo, SJ, Chao-Lun, Liu Yusung'}) <- [Relationship{name:'Saviour'}]- (x) return distinct x.name"}, {"query": "I recently bought a 2008 Santana Shijun 2.0AT luxury car, can you help me check what engine model it has?", "cypher": "The following pages link to List of aircraft of the United States Navy:"}, {"query": "Can you tell me about the types of relationships within the six layers that Ingmar Carr is involved in?", "cypher": "match path=(n) <- [:Relationship*6]- ((p:ENTITY{name:'English-speaking'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What else do you know about her besides that she is the chairperson of the Zheng He Estate?", "cypher": "match (:ENTITY{name:'Mazinfin'}) - [*1..2]-(p) where p.name <> 'Chairman of the Orange Estate' return p.name limit 3"}, {"query": "Do you know the address of the 2012 China Boutique Fair in Zhejiang?", "cypher": "match ((:ENTITY{name:'2012 China [Bungzhou] Boutique Yearly Fair'}) - [:Relationship{name:' location'}]-> (p) return p.name"}, {"query": "What is the relationship between the two layers of the relationship with Dr. Huumen?", "cypher": "The following pages link to The Unknown:"}, {"query": "In which regions is the blue arrowhead primarily distributed?", "cypher": "match (:ENTITY{name:'Relationship{name:'distribution area'}]-> (m) return distinct m.name"}, {"query": "The first foreign member of the Japan National Electronic Keyboard Association to be removed from the list of double-reed organists, what are his other three identities?", "cypher": "match (:ENTITY{name:'first foreign member of the Japan National Electronic Keyboard Association'}) <- [:Relationship{name:'main achievement'}]- ((q) - [:Relationship{name:'profession'}]->(p) where p.name <> 'dual-key electronic organ player' return distinct p.name limit 3"}, {"query": "Tell me what is 3-isopropyl methylate?", "cypher": "match (:ENTITY{name:'3-isopropyl methylate'}) --(n) with n order by n.name return n.name"}, {"query": "Can you name two different professions that are available to American citizens?", "cypher": "match (:ENTITY{name:'United States'}) <- [:Relationship{name:'nationality'}]-(x),(x) - [:Relationship{name:'profession'}]->(p) return distinct p.name limit 2 The name of the match is not available in English"}, {"query": "Do you know which schools have a business administration department?", "cypher": "match (m:ENTITY{name:'Economic Management'}) --(x) return x.name order by x.name limit 3"}, {"query": "Do you know when the Super Nintendo will be released?", "cypher": "match (x:ENTITY{name:'SFC(also known as Super Nintendo) }) <- [:Relationship{name:'Chinese name'}]- ((m) - [:Relationship{name:'listing time'}]->(q) return distinct q.name limit 1"}, {"query": "What are the relationships between the two levels of the North Primary School?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Northern Primary School'}) UNWIND relationships(path) AS rel RETURN rel.name"}, {"query": "Can you tell me about the two companies that were founded in 2001?", "cypher": "match (:ENTITY{name:'2001'}) <- [:Relationship{name:'time of establishment'}]-(n) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 2"}, {"query": "The actor who won the Golden Bell Award for Best Supporting Actor in a Drama Program on Taiwanese TV, who is the representative of the other actor besides My 30 Laws?", "cypher": "match (:ENTITY{name:'Taiwan Television Golden Bell Award Drama Program Male Supporting Actor Award Nominated'}) <- [:Relationship{name:' Major achievement'}]- ((x) - [:Relationship{name:' Representative work'}]->(q) where q.name <> 'My 30 laws' return distinct q.name limit 1"}, {"query": "The 64 books in the open bookcase are all from where?", "cypher": "match (:ENTITY{name:'64 open'}) <- [:Relationship{name:'dressed'}]-(h),(h) - [:Relationship{name:'publisher'}]->(q) return distinct h.name,q.name"}, {"query": "Let me know about some of the representative works of Erwin Godschalk. Can I say the first one?", "cypher": "match (:ENTITY{name:'Erwin Godschalk'}) - [:Relationship{name:'represents work'}]-> (q) return q.name order by q.name limit 1"}, {"query": "Is there any problem with the following introduction to the four layers of the relationship between the island of Java and the island of Jujuyuri?", "cypher": "match (n:ENTITY{name:'Jupiter Island'}) - [*1..4]->(x) where x.name<>'\u3072\u3081\u3058\u307e \u3057\u3085\u308a\u59eb\u5cf6 \u6731\u7483' return distinct x.name limit 5"}, {"query": "What other positions can male members of the Party of the Environmental Protection Agency of Dazhou, Sichuan, do? List 10 of them.", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(n) - [:Relationship{name:'profession'}]->(x) where x.name <> 'Member of the Party of the Yangtze County Environmental Protection Agency of Dazhou City, Sichuan' return distinct x.name limit 10"}, {"query": "Can you tell me if there is a person who is related to Sun Feng in the second tier of the label?", "cypher": "The name of the game is \"Skype\" (Skype) and the name of the game is \"Skype\" (Skype)."}, {"query": "In 10 sentences, give 100 details of healthy growth for babies aged 0-3 years old.", "cypher": "match (x:ENTITY{name:'100 details of healthy growth of 0-3 year old baby'}) --(h) with h order by h.name where h.name <> ' publications' return h.name limit 10"}, {"query": "I'm curious about his three professions.", "cypher": "match (:ENTITY{name:' arbitrarily good'}) - [:Relationship{name:' profession'}]-> (p) return distinct p.name limit 3"}, {"query": "This property is for a school with a normal undergraduate degree, what are its main departments?", "cypher": "match (:ENTITY{name:'common undergraduate college'}) <- [:Relationship{name:'school attributes'}]- ((q),(q) - [:Relationship{name:'main faculty'}]->(h) return h.name order by h.name limit 3"}, {"query": "Is there any benefit to eating a pie?", "cypher": "match (:ENTITY{name:'cake'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'mainly consumed function'}]->(n) return distinct n.name"}, {"query": "Tell me, what historical work comes from the Key of Solomon?", "cypher": "match (:ENTITY{name:'Relationship{name:'source'}}) - (x) return distinct x.name"}, {"query": "Please tell me if there is another label for Jerrold Benemon besides footballer?", "cypher": "match (:ENTITY{name:'Jerry Benimmon'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'footballer' return p.name limit 1"}, {"query": "In 10 words, how about 009-1?", "cypher": "match (:ENTITY{name:'009-1'}) --(x) with x order by x.name return x.name limit 10"}, {"query": "What chemical is used in petrochemical, coal conversion, nuclear power?", "cypher": "match (:ENTITY{name:' Manufacturing petrochemicals, coal conversion, nuclear power'}) <- [:Relationship{name:' field of application'}]- (n) return n.name"}, {"query": "Please tell me about the product introduction within the two-tier relationship of the SENP8 technology product.", "cypher": "match (n:ENTITY{name:'SENP8'}) - [:Relationship*1..2]->(x) where x.name<>'technology product' return distinct x.name"}, {"query": "What is the shortest path between the two floors of Shaanxi Village and Sheyang Village?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Sheshwe village'}) - [*..2]-(b:ENTITY{name:'Sheshwe village'})) return count ((p)"}, {"query": "Do you have any news about 007 China?", "cypher": "match (:ENTITY{name:'007 China Barter Network'}) --(h) with h order by h.name return h.name"}, {"query": "Check out the company information in the two-tier relationship of this organization, Business Information Consulting Ltd.", "cypher": "match (n:ENTITY{name:'Hippotechnic's Business Information Consulting Ltd'}) - [*1..2]->(x) where x.name <> 'organization' return distinct x.name"}, {"query": "The man named Flower Gundam is a cook?", "cypher": "match (:ENTITY{name:'\u82b1\u521a\u8a00'}) <- [:Relationship{name:' Chinese name'}]- ((h),(h) - [:Relationship{name:' profession'}]->(x) return distinct x.name"}, {"query": "You know 90 - Angel, besides the species label, are there any other tags?", "cypher": "match (:ENTITY{name:'90-angel'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name where x.name <> 'species' return x.name limit 10"}, {"query": "Do you know what reports were published on June 1, 2006?", "cypher": "match (:ENTITY{name:'01 June 2006'}) <- [:Relationship{name:'release date'}]- (m) return distinct m.name"}, {"query": "The teacher wants us to calculate the molecular mass of the nitroglycerin, can you help me write the chemical formula first?", "cypher": "match ((:ENTITY{name:'Relationship{name:'chemical formula'}]-> (q) return q.name)"}, {"query": "I want a list of Jewish immigrants?", "cypher": "match (:ENTITY{name:' Jewish immigrant'}) <--(n) return n.name"}, {"query": "Can you tell me about any spy films you have?", "cypher": "match ((:ENTITY{name:'spy'}) - [:Relationship{name:'film'}]-> (n) return n.name"}, {"query": "The following is a list of the top 10 most popular Chinese words for \"swimming\" in the world.", "cypher": "match (:ENTITY{name:'(S2B) exercise book height/2/2 Shanghai edition Oxford English [plain]'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 1"}, {"query": "I want to know the top 2 professional attributes of V. Sundaram?", "cypher": "match (:ENTITY{name:'V. Sundaram'}) - [:Relationship{name:'profession'}]-> (h) with h order by h.name return h.name limit 2"}, {"query": "The problem is that the 118-kilogram Beccaris Lucas has no profile in more than three relationships.", "cypher": "match (n:ENTITY{name:'Beccaris Lucas'}) - [*1..3]->(x) where x.name <>'118 kg' return distinct x.name"}, {"query": "Which of the major universities in China has been awarded the A-Level Vocational Training Institute of Shenzhen, the Advanced Division of the Dongguan District, etc.?", "cypher": "match (:ENTITY{name:'Relationship: A-level vocational training institution in Shenzhen City, China, and other branches of the Dongbao-An area's Advanced Group's affiliate})"}, {"query": "Can you list seven cycles of awards that are given once a year?", "cypher": "match (:ENTITY{name:' year one'}) <- [:Relationship{name:' cycle'}]- (x) return x.name limit 7"}, {"query": "What can you tell me about this person, Nick Helen?", "cypher": "match (:ENTITY{name:' Nick Herron'}) --(p) return p.name skip 2 The name of the game is the same as the name of the game"}, {"query": "I want to ask you, what is the name of the chemical compound with the molecular formula C9H7NO6?", "cypher": "The name of the matching element is \"Relationship\" (q) return q.name"}, {"query": "Do you know of any other information about the rainbow flower besides the fact that it is a sub-plant of the mulberry tree? Help me find 10 information in 3 layers.", "cypher": "match (:ENTITY{name:' rainbow'}) - [*1..3]->(p) where p.name <> 'Milan tree ((by subplant tree) ' return p.name limit 10"}, {"query": "Who are the people who are the chief engineers in Hubei?", "cypher": "match (p:ENTITY{name:' chief engineer'}) <--(x) -->(q:ENTITY{name:' Hubei'}) return x.name"}, {"query": "Tell me about the work of Dong Da, which is a two-tiered relationship between the two.", "cypher": "match (n:ENTITY{name:'given a bunch of rosemary'}) - [:Relationship*1..2]->(x) where x.name<>'Don' return distinct x.name"}, {"query": "Help me find 10 different types of Jiangsu food.", "cypher": "match (:ENTITY{name:'Relationship{name:'category'}]-(m) return distinct m.name limit 10"}, {"query": "I learned that the BD32 Metro Electric Bus is a 2013 electric bus produced by Junky Equipment, do you know any other information about it?", "cypher": "match (n:ENTITY{name:'BD32 type metro electric bus'}) -->(h) with h order by h.name where h.name <> 'Junk car equipment' and h.name <> '2013' return h.name limit 5"}, {"query": "Help me find the famous sights and monks of Yummin Temple", "cypher": "match (:ENTITY{name:'\u4f51\u6c11\u5bfa'}) - [:Relationship{name:' famous sights'}]->(n) return n.name as name union all match (:ENTITY{name:'\u4f51\u6c11\u5bfa'}) - [:Relationship{name:' famous monk'}]->(m) return m.name as name"}, {"query": "What is the name of the volcano in the Andes Mountains of South America?", "cypher": "match (:ENTITY{name:' located in the Andes Mountains of South America'}) --(x) return distinct x.name"}, {"query": "Can you list any of the three levels of relationships involved in teaching the new curriculum?", "cypher": "The following pages link to the article: \"Relationship\" (WEB"}, {"query": "What are the two main ingredients of banana slime besides dried banana and motherwort?", "cypher": "match (n:ENTITY{name:' Banana Smoothie'}) - [:Relationship{name:' Main ingredient'}]->(h) where h.name <> 'Dry Banana' and h.name <> 'Mother Chicken' return distinct h.name limit 2"}, {"query": "Please help me find a Danlan Bruno representative, but except for Hurricane Rescue 3 and Hurricane Compensation.", "cypher": "match (n:ENTITY{name:'Danlan Bruno'}) - [:Relationship{name:'representative work'}]->(h) with h order by h.name where h.name <> 'Hurricane rescue 3' and h.name <> 'Relationship' return h.name limit 1"}, {"query": "What song was originally sung by Owl City?", "cypher": "match (:ENTITY{name:'Owl City(Owl City) }) <- [:Relationship{name:'song originally sung'}]- (p) return distinct p.name"}, {"query": "Bamboo fish soup is its main ingredient. Do you know what it is?", "cypher": "match ((:ENTITY{name:'Bamboo clam sushi'}) - [:Relationship{name:'main ingredient'}]-> (n) return n.name"}, {"query": "Born in Guizhou in 1974, what are the 10 identities of Rojaweed besides being a member of the National Religious Affairs Bureau of Guizhou's Udan District?", "cypher": "match (:ENTITY{name:'\u7f57\u5146\u536b,\u7537, born January 1974, undergraduate, born in Guangzhou\u3002'}) <- [:Describe{name:'description'}]-(h),(h) - [:Relationship{name:'profession'}]->(m) where m.name <> 'Uang District National Religious Affairs Bureau Party group member' return distinct m.name limit 10"}, {"query": "What other properties does the 19th floor flea market have besides the flea market properties?", "cypher": "match (:ENTITY{name:'19th floor flea market'}) --(n) with n order by n.name where n.name <> 'flea market' return n.name"}, {"query": "What other label attributes does the 0-3 parenting program have besides being a publication?", "cypher": "match (:ENTITY{name:'0-3 years old parenting program'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'publication' return h.name"}, {"query": "The 2013 Cologne International Food Fair in Germany is quite high-end, do you know the specific cycle?", "cypher": "match ((:ENTITY{name:'2013 Cologne International Food Fair'}) - [:Relationship{name:' Held cycle'}]-> (x) return x.name"}, {"query": "The men's first place finish?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(x),(x) - [:Relationship{name:'main achievement'}]->(n) return n.name order by n.name limit 1"}, {"query": "Can you name 10 of the films that this Beijing Film Academy graduate has represented?", "cypher": "match (:ENTITY{name:'Beijing Film Academy'}) <- [:Relationship{name:'Graduate School'}]-(x) - [:Relationship{name:'Major work'}]->(h) return h.name order by h.name limit 10"}, {"query": "Can you give me a place in the world heritage site of the city of Xi'an?", "cypher": "match (:ENTITY{name:' World Heritage Site'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:' period'}]->(n) return m.name,n.name limit 2 The name of the site is not known"}, {"query": "How long is the Hermes Glacier?", "cypher": "match ((:ENTITY{name:'Hermes Glacier'}) < - [:Relationship{name:' full length'}]-> (m) return m.name"}, {"query": "Can you help me find the chemical formula for 2-acetyl-hydroxyethyl acetate, if I need it right now?", "cypher": "match ((:ENTITY{name:'2-ethylhexybutyric acid'}) - [:Relationship{name:'chemical formula'}]-> (m) return m.name"}, {"query": "The case against the three sisters was filed on behalf of whom?", "cypher": "match (:ENTITY{name:' The new series starring: Yu-chan and Yu-chan's sisters's complaint}) <- [:Relationship{name:' Representative works'}]- (m) return m.name order by m.name"}, {"query": "What are the labels for each of the works? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:' blue elephant's nose'}) - [:Relationship{name:' author'}]->(:ENTITY) <- [:Relationship{name:' author'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Can you tell us about the types of relationships within the two layers of the Xi Jinping document?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'\u653f\u6587'}) UNWIND relationships(path) AS rel return distinct rel.name"}, {"query": "Find the software information within the 4 layers of the relationship of the cultural class APP step by step.", "cypher": "match (n:ENTITY{name:' step by step teaching drawing'}) - [*1..4]->(x) where x.name <> 'culture' return distinct x.name"}, {"query": "Can you tell me the names of 10 companies registered in the Dongguan City Business Administration in Guangdong Province?", "cypher": "match (:ENTITY{name:'Dongxiang City Industrial and Commercial Administration'}) <- [:Relationship{name:'Registration authority'}]- (n) return n.name limit 10"}, {"query": "The article is about the blog of the famous Brazilian writer, who was born in the city of S\u00e3o Paulo.", "cypher": "match (:ENTITY{name:'squish'}) --(x) return distinct x.name limit 3"}, {"query": "I want to know the basic relationship between five Welsh athletes, Tovey Jason and no less than six?", "cypher": "match (n:ENTITY{name:'Tovey Jason'}) - [*1..6]->(x) where x.name <>'Tovey Jason, Welsh athlete\u3002' return distinct x.name limit 5"}, {"query": "Can you name three species of ants and help me to identify them?", "cypher": "match (:ENTITY{name:'genus'}) <- [*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name, n.name limit 3"}, {"query": "Can you list any of the 85 inter-relationships that are involved in secondary schools?", "cypher": "The following pages link to The Unknown:"}, {"query": "What are the works of the China Times Economic Press and when are they published?", "cypher": "match (:ENTITY{name:'China Times Economic Press ((formerly China Audit Press) '}) <-[:Relationship{name:'Publishing Press'}]-(h),(h) -[:Relationship{name:'Publishing time'}]->(q) return distinct h.name,q.name"}, {"query": "Can you tell me all you know about Chongqing Humanities and Technology University?", "cypher": "match (:ENTITY{name:'Chongqing Humanities and Sciences College'}) - [:Relationship*1..2]-(p) return distinct p.name limit 10"}, {"query": "What does it mean to be angry and bitter?", "cypher": "Match (:ENTITY{name:'Relationship{name:' explained'}]->(n) return n.name"}, {"query": "I want to know about the relationship between the two layers of the word \"Jigsaw\" and \"Jigsaw\" in the work \"Jigsaw\".", "cypher": "match (n:ENTITY{name:'Relationship*2]->(x) where x.name <> 'word' return distinct x.name"}, {"query": "Can you name five works by a graphic designer who graduated from the University of Georgia?", "cypher": "match (n:ENTITY{name:'University of Georgia's Department of Graphic Design (on leave) '}) <- [:Relationship{name:' Graduate School'}]- ((x),(x) - [:Relationship{name:' Representative work'}]->(h) return distinct h.name limit 5"}, {"query": "What is the shortest path between the two levels of Wenling Village and Yangling Village?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Relationship*..2]-b:ENTITY{name:'Relationship:'Relationship')) return count ((p))"}, {"query": "Do you know what Cherry does for a living?", "cypher": "match (:ENTITY{name:'cherry'}) - [:Relationship{name:'profession'}]-> (h) return distinct h.name"}, {"query": "What are the characteristics of the yellow clouds and the golden dragonfly flower?", "cypher": "match (:ENTITY{name:'light yellow clouds gold dragonfly flower peel routine'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'feature'}]->(h) return distinct h.name"}, {"query": "Please introduce the film Come Out of the Shadows.", "cypher": "match (:ENTITY{name:' get out of the shadows'}) --(q) return q.name order by q.name limit 5"}, {"query": "What is the name of the online store owned by Beijing-based Toshiba Hongtou Network Technology Co., Ltd.?", "cypher": "match (:ENTITY{name:'Beijing Xinjiang Hont\u014d Network Technology Co., Ltd'}) <- [:Relationship{name:'belongs to'}]- (m) return m.name"}, {"query": "Trying to label a 1385 UV flatbed printer?", "cypher": "match (:ENTITY{name:'1385uv tablet printer'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "And what do you know about the characteristics of spy films?", "cypher": "match (:ENTITY{name:'spy'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'characteristics'}]->(n) return distinct n.name"}, {"query": "I found the Longan Multifunctional English-English Dual Interpretation Dictionary by British Peer Education Publishing Asia Limited, a 2807 page book, can you help me find 4 more information about this dictionary?", "cypher": "match (n:ENTITY{name:'Language-specific English-language dictionary'}) -->(h) with h order by h.name where h.name <> '2807 pages' and h.name <> 'British Peer Education Publishing Asia Limited' return h.name limit 4"}, {"query": "What are the definitions of the tags for 3DStudioMAX 3.0 Animation Production Selection?", "cypher": "match (:ENTITY{name:'3DStudioMAX3.0 Animation Production Selected'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Do you know what kind of company is Beijing Nanjing Village Software Limited?", "cypher": "match ((:ENTITY{name:'Beijing South Sumur Software Co. Ltd'}) - [:Relationship{name:'Company nature'}]-> (m) return m.name"}, {"query": "What chemical is YLZ348?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Do you have any information on the relationship between the two layers of my simple Chinese medical information research?", "cypher": "match (n:ENTITY{name:' medical information research'}) - [:Relationship*1..2]->(x) where x.name <>'simplified Chinese' return distinct x.name"}, {"query": "There is a movie called Kung Fu Girls in Chinese called \"Yue\"?", "cypher": "match (x:ENTITY{name:'Kung fu girls'}) <- [:Relationship{name:'foreign name'}]- (q) return q.name"}, {"query": "What is the name of the intense disturbance that occurs in the Earth's magnetic field?", "cypher": "match (:ENTITY{name:' intense disturbance of the Earth's magnetic field'}) --(x) return distinct x.name"}, {"query": "Listed below are the two clubs that Banfield Athletic have, but are not listed here except for football.", "cypher": "match (:ENTITY{name:'Banfield Athletic Club'}) - [:Tag{name:'tag'}]-> (p) with p order by p.name where p.name <> 'football' return p.name limit 2"}, {"query": "What is the shortest path between the three layers of the Yangbhui and Li-Li lines?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'\u7cfb\u989c\u7709'}) - [*..3]-(b:ENTITY{name:'\u674e\u653f\u9053\u4f20'})) return count ((p)"}]