[{"query": "What plants belong to the family of the toothpick? Name 20 species?", "cypher": "match (:ENTITY{name:'cinnamon group'}) <- [:Relationship{name:'group'}]- (q) return q.name limit 20"}, {"query": "Which hotels have TVs, gardens, pets, cots, etc?", "cypher": "match (:ENTITY{name:'TV, garden, carrying pets, child bed'}) <- [:Relationship{name:'facility services'}]- (x) return distinct x.name"}, {"query": "What ancient books have been unearthed in Loyang City, Henan Province?", "cypher": "match (:ENTITY{name:'Loiyang City, Henan Province}) <- [:Relationship{name:'Location'}]->(n) where n is not null return distinct n.name"}, {"query": "What is Kipchoge's most representative work?", "cypher": "match (:ENTITY{name:'Kip Hart'}) - [:Relationship{name:'representing work'}]-> (m) return distinct m.name"}, {"query": "Help me find 10 AAAAA-rated sites", "cypher": "match (:ENTITY{name:'AAAAA level'}) <- [:Relationship{name:'destination level'}]-(m) return distinct m.name limit 10"}, {"query": "The incident in which 21 people were injured was caused by a car accident.", "cypher": "match (:ENTITY{name:'21 people injured'}) <- [:Relationship{name:'casualty situation'}]- (q) return distinct q.name"}, {"query": "What tourist cities are there in the Peninsula?", "cypher": "match (:ENTITY{name:'Thailand'}) - [:Relationship{name:'Tourist city'}]->(m) return distinct m.name"}, {"query": "What is the name of the accident that happened in the Lido district of Liyuan City, Liyuan City, on the street of the pit mouth?", "cypher": "match (:ENTITY{name:'Lindu District Liyuan City Liyuan City Street Pit Gate Village'}) <- [:Relationship{name:'Location'}]- (x) return distinct x.name"}, {"query": "Do you know which novels are available in the Chinese language?", "cypher": "match (:ENTITY{name:' starting point Chinese web'}) <- [:Relationship{name:' website'}]- (p) return distinct p.name"}, {"query": "Tell me what are the two types of relationships between animals in the 3 layers and animal techniques?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:' Experimental animals and animal experimental technology'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 2"}, {"query": "Can you tell me about Huang Shan, the senior COSER in China, what is his profession?", "cypher": "match (:ENTITY{name:'\u9ec4\u5c71, domestic senior COSER\u3002'}) <- [:Describe{name:'description'}]-(h),(h) - [:Relationship{name:'profession'}]->(n) return n.name order by n.name limit 10"}, {"query": "I'm wondering if you can tell me which controller has humidity between 20 and 95%?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "Please help me find the other 5 information about actress Zheng Lin in the 2nd floor.", "cypher": "match (:ENTITY{name:'Zhiqinglin'}) -[*1..2]-(p) where p.name <> 'actor' return p.name limit 5"}, {"query": "Who gave the name to the red belt?", "cypher": "match (:ENTITY{name:' red belt'}) - [:Relationship{name:' names and dates'}]-> (m) return distinct m.name"}, {"query": "Can you tell me about the 009 Super Rescue in one sentence?", "cypher": "match (:ENTITY{name:'000 machine confrontation'}) --(h) with h order by h.name return h.name limit 1"}, {"query": "Do you have any content about the types of relationships within the five levels of foreign language schools in cities?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'city foreign language secondary school'}) UNWIND relationships(path) AS rel RETURN distinct rel.name"}, {"query": "What are the major awards of this school, founded in 1938? Do you know 10 of them?", "cypher": "match (:ENTITY{name:'1938'}) <- [:Relationship{name:'time of founding'}]-(x),(x) - [:Relationship{name:'main award'}]->(h) return h.name order by h.name limit 10"}, {"query": "What are the names of the films with the same date of filming as the New Wenshan film? What are the individual labels of these films? Please sort them by the number of labels in each of them from small to large.", "cypher": "match (n:ENTITY{name:'New Wenzhou man'}) - [:Relationship{name:'date of filming'}]->(:ENTITY) <-[:Relationship{name:'date of filming'}]-(m:ENTITY), (r:ENTITY) <-[:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "What is the name of the state of Zhejiang? When was it created? What is the classification of Zhejiang?", "cypher": "The name of the game is the same as the name of the game itself. The name of the game is the same as the name of the game itself."}, {"query": "Besides the weapons, can you tell me five things you know about the British Westerland Fighter II?", "cypher": "match (:ENTITY{name:' British Westland Flying Fortress'}) - [*1..2]->(p) where p.name <> 'weapons equipment' return p.name limit 5"}, {"query": "How can I find the attribute tags for 0377?", "cypher": "match (:ENTITY{name:'0377 group shopping'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Can you help me find 5 information about the 097 class nuclear submarine?", "cypher": "match (h:ENTITY{name:'097 tons class nuclear submarine'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name return n.name limit 5"}, {"query": "Can you explain to me three things about the International Silk Road Conference?", "cypher": "match (:ENTITY{name:'International Silk Road Congress'}) --(x) return distinct x.name limit 3 The name of the game is the same as the name of the game itself."}, {"query": "The total distance travelled in which sport is 3178 km?", "cypher": "Match (:ENTITY{name:'3178 km'}) <- [:Relationship{name:'all journeys'}]- (n) return n.name"}, {"query": "What is the skill of the Dominguez monk?", "cypher": "Match (:ENTITY{name:'Dawing demon monk'}) - [:Relationship{name:'skill'}]-> (x) return x.name skip 2"}, {"query": "Help me find a dish made with tofu and shrimp.", "cypher": "match (:ENTITY{name:'tofu drying, curry'}) <- [:Relationship{name:'main ingredient'}]-(m), (m) - [:Relationship{name:'categorized'}]->(n) where n.name='chayanese' return distinct m.name"}, {"query": "Please tell me which people have the same nationality as Yukiyama, and what other labels they have. Please order the number of labels from small to large by each character.", "cypher": "match (n:ENTITY{name:'\u5ddd\u9ebb\u5f25'}) - [:Relationship{name:'\u56fd\u7c4d'}]->(:ENTITY) <- [:Relationship{name:'\u56fd\u7c4d'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "How do you find out about the five foreign universities and when they were founded?", "cypher": "match (:ENTITY{name:'foreign university'}) <--(m), (m) - [:Relationship{name:'time of founding'}]->(n) return m.name, n.name limit 5"}, {"query": "And what have you done with the half-Lara and how it is written?", "cypher": "match (:ENTITY{name:'half-Lara'}) - [:Relationship{name:'outcome'}]->(n) return n.name as name union all match (:ENTITY{name:'half-Lara'}) - [:Relationship{name:'spelling'}]->(m) return m.name as name"}, {"query": "What are the theories proposed by Apollo Neos that apply to the field of study?", "cypher": "match (q:ENTITY{name:'Apollo Neos'}) <- [:Relationship{name:'proponent'}]- ((m) - [:Relationship{name:'scale of application'}]->(h) return distinct h.name limit 2"}, {"query": "I especially want to know when the 2012 Saudi Jeddah International Hotel and Hotel Supplies Show will be held, do you know?", "cypher": "match ((m:ENTITY{name:'2012 Saudi Arabia Jeddah International Hotel and Hotel Supplies Show'}) - [:Relationship{name:' Exhibition time'}]-> (q) return q.name"}, {"query": "List five web games and describe their game types.", "cypher": "match (:ENTITY{name:'web game'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'game type'}]->(n) return m.name,n.name limit 5"}, {"query": "The longest ISBN of Hitchcock's work is?", "cypher": "The following pages link to List of articles on the list of articles in the ISBN: [Relationship: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name: ISBN: [name]]]]]]]]]]"}, {"query": "Can you recommend a few lines of the novel that are being re-published?", "cypher": "match (:ENTITY{name:'in the link'}) <- [:Relationship{name:'updated status'}]- (n) return distinct n.name"}, {"query": "Can you tell me about the three layers of relationships that are contained in a male love song?", "cypher": "The following pages link to The Unknown:"}, {"query": "Public Health and Preventive Medicine is the main school of medicine you know?", "cypher": "match (:ENTITY{name:'Public health and preventive medicine'}) <- [:Relationship{name:'main faculty'}]- (n) return distinct n.name"}, {"query": "I'm looking for two low-toxic herbicides, any other names?", "cypher": "match (:ENTITY{name:' belongs to low toxic herbicides'}) <- [:Relationship*]-(m),(m) - [:Relationship{name:' other name'}]->(n) return distinct m.name,n.name limit 2"}, {"query": "What chemical is the cas number 335-27-3?", "cypher": "The name of the game is \"Relationship\" (m:ENTITY{name:'335-27-3'})"}, {"query": "Please tell me what kind of shows are there for the Barley Network? Can you list 10?", "cypher": "match (:ENTITY{name:'barley net'}) <- [:Relationship{name:'ticketing agent'}]- (p) return p.name limit 10"}, {"query": "Can you help me find out if there is a Chinese name for this guy named WangXun? (under 5)", "cypher": "match (:ENTITY{name:'Wang Xun'}) <- [:Relationship{name:' foreign language name'}]-(h),(h) - [:Relationship{name:' major works'}]->(n) return distinct n.name limit 5"}, {"query": "123 returns net is a website that can bet on tagging?", "cypher": "match (:ENTITY{name:'123 return net'}) - [:Tag{name:'tag'}]-> (n) with n order by n.name where n.name <> 'website' return n.name"}, {"query": "Do you know what the main achievements of the graduates of Nanjing University are?", "cypher": "match (:ENTITY{name:'Nanjing University'}) <- [:Relationship{name:'Graduate School'}]- ((q) - [:Relationship{name:'Major achievement'}]->(h) return distinct h.name limit 5"}, {"query": "What is the name of the music video directed by Tabitha Denholm, Peter Williams, Alex Koch?", "cypher": "The game is based on the video game series of the same name."}, {"query": "Help me find three other representative works of Liu Jing, other than the Wolf of War.", "cypher": "match (n:ENTITY{name:'Relationship{name:'representative work'}]->(h) with h order by h.name where h.name <> 'Wolf' and h.name <> 'Wolf II' return h.name limit 3"}, {"query": "Do you know which monument is about 5 meters high?", "cypher": "match (:ENTITY{name:'about 5 meters high'}) <- [:Relationship{name:'sign'}]- (q) return q.name"}, {"query": "Can you tell us about the following five information about the organization Tianjin Power Technology Development Co., Ltd.?", "cypher": "match (n:ENTITY{name:' Tianjin Electrical Engineering and Technology Development Co. Ltd'}) - [*]->(x) where x.name <> 'organizing entity' return distinct x.name limit 5"}, {"query": "Do you know which books are available for the exam? Can you give me five examples?", "cypher": "The following is a list of the most commonly used tags for the test:"}, {"query": "Please help me find out which album this song is from.", "cypher": "match (:ENTITY{name:'Heroes of the Burial'}) <- [:Relationship{name:'Chinese name'}]- ((x),(x) - [:Relationship{name:'of the album'}]->(q) return distinct q.name"}, {"query": "The man who is nominated as the secretary of the Party Committee of the Yup'e County, what other profession does he have?", "cypher": "match (:ENTITY{name:'man'}) <- [:Relationship{name:'gender'}]-(x) - [:Relationship{name:'profession'}]->(n) where n.name <> 'township president, to be nominated as the secretary of the Party Committee of Lambung county etc. ' return distinct n.name limit 1"}, {"query": "What is the most recent novel you have seen about the seven fairies in the underworld?", "cypher": "match ((:ENTITY{name:'Seven Fairies in the Otherworld'}) - [:Relationship{name:' Novel category'}]-> (x) return x.name"}, {"query": "Three words to introduce me to the first snow of 2006?", "cypher": "match (:ENTITY{name:'first snow of 2006'}) --(n) with n order by n.name return n.name limit 3"}, {"query": "What is the chemical formula and density of titanium?", "cypher": "match (:ENTITY{name:' titanium silver ore'}) - [:Relationship{name:' chemical composition'}]->(n) return n.name as name union all match (:ENTITY{name:' titanium silver ore'}) - [:Relationship{name:' density'}]->(m) return m.name as name"}, {"query": "Can you give me five AAAA-level sights?", "cypher": "match (:ENTITY{name:'AAAA'}) <- [:Relationship{name:'site level'}]-(p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 5"}, {"query": "Can you recommend some 2012 edition textbooks?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "Can you tell me about the type of relationship that the new openers are involved in in 5 layers?", "cypher": "match path=(n) <- [:Relationship*5]- ((p:ENTITY{name:'new opening man'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 3"}, {"query": "Can you find out what ingredients are used in the 10 Ways of Cooking?", "cypher": "match (:ENTITY{name:'\u5ddd\u83dc'}) <- [:Relationship*]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "Can you quickly say the three labeling points of 5-amino acids?", "cypher": "match (:ENTITY{name:'5-amino acid'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name limit 3"}, {"query": "What are the other names for the Lanning order?", "cypher": "match (:ENTITY{name:'Relationship{name:' alias'}-> (m) return m.name order by m.name"}, {"query": "Can you list any of the nine international games that are good?", "cypher": "match (:ENTITY{name:'9 ball international match'}) <- [:Relationship{name:'type of event'}]- (m) return distinct m.name"}, {"query": "Which companies are in the mobile internet industry? Can you name 10?", "cypher": "match (:ENTITY{name:' mobile internet'}) <- [:Relationship{name:' business scope'}]- (n) return n.name limit 10"}, {"query": "Do you know what regulations were issued on November 9, 2011?", "cypher": "match (:ENTITY{name:'November 9, 2011'}) <- [:Relationship{name:' release date'}]- (n) return distinct n.name"}, {"query": "The game is a game of the 108th birthday tag.", "cypher": "match (:ENTITY{name:'108th birthday'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'game work' return q.name"}, {"query": "Can you help me find two books by the authors of Autumn Rain?", "cypher": "match (:ENTITY{name:'\u4f59\u79cb\u96e8'}) <- [:Relationship{name:' author'}]-(x),(x) - [:Relationship{name:' book name'}]->(q) return distinct q.name limit 2"}, {"query": "What are the nicknames of people with B blood type?", "cypher": "The following is a list of the most commonly used names in the world:"}, {"query": "What is the nature of Jinan Wangchun He Enterprise Management Consulting Limited? When was it founded?", "cypher": "match (:ENTITY{name:'Jinan Jinan Chan Chan Chan Chan Enterprise Management Consulting Limited'}) - [:Relationship{name:'Company nature'}]->(n) return n.name as name union all match (:ENTITY{name:'Beijing's bar'}) - [:Relationship{name:'establishment time'}]->(m) return m.name as name union all match (:ENTITY{name:'Beijing's bar'}) - [:Relationship{name'}}->(r) return r.name as name:'"}, {"query": "Can you name three main achievements of students?", "cypher": "match (:ENTITY{name:' student'}) <- [:Relationship{name:' profession'}]-(n),(n) - [:Relationship{name:' major achievement'}]->(h) return distinct h.name limit 3"}, {"query": "I read a book that had a summary that said that mom is the best doctor for children.", "cypher": "match (:ENTITY{name:'Mother is the best doctor of children'}) <- [:Relationship{name:' generalized'}]- (n) return n.name"}, {"query": "What are the representative works of the Chinese literati?", "cypher": "match (p:ENTITY{name:'Han'}) <- [:Relationship{name:'ethnicity'}]- ((q) - [:Relationship{name:'representative work'}]->(n) return distinct n.name limit 1"}, {"query": "Did you have trouble telling me about the personal information in Dgani Orel 3 from Israel?", "cypher": "match (n:ENTITY{name:'Dgani Orel'}) - [*1..3]->(x) where x.name<>'Israel' return distinct x.name"}, {"query": "What is the name of the academic paper directed by Liu, the anti-Santa Fe?", "cypher": "match (:ENTITY{name:'Please, please, please, please, please, please'}) <- [:Relationship{name:'Mentor'}]- (q) return distinct q.name"}, {"query": "Tell me about the three levels of relationship of this person?", "cypher": "match (n:ENTITY{name:'\u5fd7\u6751'}) - [*1..3]->(x) where x.name <> 'person' return distinct x.name"}, {"query": "What is the story behind the fantasy novel Sword of the Wombat?", "cypher": "match (:ENTITY{name:'sword domain'}) --(m) with m order by m.name where m.name <> ' fantasy novel' return m.name"}, {"query": "I'm wondering what chemical has the CAS number 196597-78-1?", "cypher": "The following is a list of the most commonly used tags for the game."}, {"query": "What is the shortest relationship path between the three layers of the greenhouse and the greenhouse?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'shortestleaf green beans'}) - [*..3]-(b:ENTITY{name:'shortestleaf green beans'})) return count ((p)"}, {"query": "Can you see the 5 articles by Grima Dylan from Malta?", "cypher": "match (n:ENTITY{name:'Grima Dylan'}) - [:Relationship*]->(x) where x.name <>'Malta' return distinct x.name limit 5"}, {"query": "The .NET and design patterns are known as computer books, but are there other tag features?", "cypher": "match (:ENTITY{name: .NET with design pattern'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'computer books' return m.name"}, {"query": "What does the guy who came out on May 23, 2017 represent?", "cypher": "match (:ENTITY{name:'May 23, 2017'}) <- [:Relationship{name:'date of release'}]-(m),(m) - [:Relationship{name:'representing work'}]->(x) return distinct x.name"}, {"query": "Do you know what combination of music represents the work of the Knighthood, You're So Good After 00?", "cypher": "match (:ENTITY{name:'Cavalry Junior, goodbye 00'}) <- [:Relationship{name:'Music representing work'}]- (m) return distinct m.name"}, {"query": "The book is about the development of physics education and is called What's Your Name?", "cypher": "match (:ENTITY{name:'s development'}) <- [:Relationship{name:'s education in physics'}]- (p) return p.name"}, {"query": "What is the name of the Korean dish made with brown fish meat?", "cypher": "match (:ENTITY{name:'fish'}) <- [:Relationship{name:'main ingredient'}]-(m), (m) - [:Relationship{name:'category'}]->(n) where n.name='Korean dish' return distinct m.name"}, {"query": "What are the main achievements of Chinese citizens?", "cypher": "match (:ENTITY{name:'China'}) <- [:Relationship{name:'nationality'}]- ((n) - [:Relationship{name:'main achievements'}]->(m) return distinct m.name limit 5"}, {"query": "Can you tell me what kind of relationships are involved in 91 express cars in 3 levels?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "The information provided to me by Good Luck Transportation Services Limited is 6 information in 3 tiers apart from AA level enterprises in China.", "cypher": "match (:ENTITY{name:'Good luck to transport services limited'}) - [*1..3]-(p) where p.name <> 'China AA logistics enterprise' return distinct p.name limit 6"}, {"query": "Can you tell me about the famous sights in the old town of Chiang Mai?", "cypher": "Match (:ENTITY{name:'Relationship{name:'Famous attractions'}]-> (p) return p.name skip 1"}, {"query": "Please help me find three romance novels, where are all the links?", "cypher": "match (:ENTITY{name:'speech novel'}) <--(m), (m) - [:Relationship{name:'linked website'}]->(n) return m.name, n.name limit 3"}, {"query": "Help me find a six-piece band from the UK.", "cypher": "match (:ENTITY{name:'UK'}) <- [:Relationship{name:'nationality'}]-(m), (m) - [:Relationship{name:'number of members'}]->(n) where n.name='6 people' return distinct m.name"}, {"query": "What are the other three names of the film besides Love Copper Blow and Sweet Man Blow?", "cypher": "match (n:ENTITY{name:' clari sand's taste'}) - [:Relationship{name:' other translated name'}]->(h) where h.name <> 'love copper broth' and h.name <> 'sweet man's beauty' return distinct h.name limit 3"}, {"query": "What are the 10 other jobs that Jia Jia held besides the position of Chairman and General Manager of Sichuan South Filling Patent Gas Engineering Limited?", "cypher": "match (:ENTITY{name:' had been working'}) <- [:Relationship{name:' Chinese name'}]-(p),(p) - [:Relationship{name:' profession'}]->(x) where x.name <> ' Chairman and General Manager of Sichuan South Gas Additive Patent Engineering Limited' return distinct x.name limit 10"}, {"query": "I want to know about the copper reserves.", "cypher": "match (:ENTITY{name:'excess copper'}) --(m) return m.name skip 3"}, {"query": "Give me 5 people you know who are not a deputy chief doctor but have other professions.", "cypher": "match (:ENTITY{name:'Hennan Xuquan'}) <- [:Relationship{name:'birthplace'}]-(h) - [:Relationship{name:'profession'}]->(m) where m.name <> 'Deputy chief physician' return distinct m.name limit 5"}, {"query": "How did you introduce me to Charles Gilibert's information?", "cypher": "match (p:ENTITY{name:'Charles Gilibert'}) --(n) return n.name skip 1 This is a list of all the different ways Charles Gilibert is credited in the database."}, {"query": "Can you provide information on Jerrelle Benimon in two other languages besides English?", "cypher": "match (:ENTITY{name:'Jerrelle Benimon'}) --(m) with m order by m.name where m.name <> 'Jerrelle Benimon' return distinct m.name limit 2"}, {"query": "What are the occupations of this zodiac sign, Taurus?", "cypher": "The following is a list of all the characters that appear in the game:"}, {"query": "Please tell me about the five main departments of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education and Science of the Faculty of Education.", "cypher": "match (:ENTITY{name:'Faculty of Education and Science of the Faculty of Education and Science of the University of Hsinchu'}) - [:Relationship{name:'Faculty of Education and Science of the University of Hsinchu'}]-> (h) return distinct h.name limit 5"}, {"query": "The following is a detailed introduction to the two-tier relationship between the high-tech company, which integrates mobile Internet software development and entrepreneurship, and the company, which is a subsidiary of the company, which is a subsidiary of the company, which is a subsidiary of the company.", "cypher": "match (n:ENTITY{name:'\u7389\u697c\u6625\u00b7\u7626\u5026\u4f5c\u767b\u9ad8\u53bb'}) - [:Relationship*1..2]->(x) where x.name <> 'return x.name'"}, {"query": "Can you tell me how many series of 13 episodes you know?", "cypher": "match (:ENTITY{name:'13'}) <- [:Relationship{name:'set'}]- (p) return p.name limit 5"}, {"query": "What do you think about the publications for babies aged 0-2 years old?", "cypher": "match (n:ENTITY{name:'0-2 years old baby book; color shape'}) --(h) with h order by h.name where h.name <> ' publication' return h.name"}, {"query": "What are some of the main achievements of Kim Mei-young? Please tell me one.", "cypher": "match (:ENTITY{name:'\u7f8e'}) <- [:Relationship{name:'Chinese name'}]-(n),(n) - [:Relationship{name:'main achievement'}]->(q) return q.name order by q.name limit 1"}, {"query": "Do you know what buildings are in California, what happened?", "cypher": "match (n:ENTITY{name:'U.S. State of California'}) <- [:Relationship{name:' location'}]- (x) return distinct x.name"}, {"query": "What is the name of a Chinese surname?", "cypher": "Match (:ENTITY{name:'swinging'}) - [:Relationship{name:'swinging'}]-> (n) return n.name limit 1"}, {"query": "I would like to know what the foreign name of the Pet Lineage Management Association of China is?", "cypher": "match (:ENTITY{name:'Pet lineage Management Association of China'}) <- [:Relationship{name:'foreign name'}]- (q) return q.name order by q.name limit 1"}, {"query": "Can you name the works of which people are called \"Star of the Sun\"?", "cypher": "match (:ENTITY{name:'Earthstar'}) --(n) return distinct n.name"}, {"query": "Does the list of 1211 fire extinguishers include no more than 5 categories of tags in addition to the rest of the life tags?", "cypher": "match (:ENTITY{name:'1211 fire extinguisher'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name where q.name <> 'life' return q.name limit 5"}, {"query": "The first three tags for 000stthk?", "cypher": "match (:ENTITY{name:'000stthk'}) - [:Tag{name:'tag'}]-> (x) with x order by x.name return x.name limit 3"}, {"query": "Do you know of any towns in Tibet? I need 10 more information in addition to the 2 levels outside Tibet.", "cypher": "match (:ENTITY{name:'eighty-one township [township where the capital of Linyi City, Tibet is located]'}) - [*1..2]->(p) where p.name <> 'Baei City, Linyi City, Tibet Autonomous Region of China' return p.name limit 10"}, {"query": "What is the voltage at 450/750 V and below for AC voltage?", "cypher": "match (m:ENTITY{name:'450/750V and below'}) <- [:Relationship{name:'Applicable to AC voltage'}]- (q) return distinct q.name"}, {"query": "What is Shen Yun's job?", "cypher": "match (:ENTITY{name:'Shayn's'}) <- [:Relationship{name:'Chinese name'}]-(h),(h) - [:Relationship{name:'profession'}]->(p) return distinct p.name"}, {"query": "Can you tell us more about the 2004 Swiss Women's Elite Volleyball Championship?", "cypher": "match (:ENTITY{name:'2004 Swiss Women's Elite Championship'}) --(n) with n order by n.name return n.name"}, {"query": "What is the English name of the novel called The Kid Killer?", "cypher": "match (:ENTITY{name:' minor male killer'}) <- [:Relationship{name:' Chinese name'}]- (x) return x.name"}, {"query": "Please list ten schools with IT departments.", "cypher": "match (:ENTITY{name:' IT department'}) --(p) return distinct p.name limit 10"}, {"query": "Can you summarize the journey to happiness in five words?", "cypher": "match (:ENTITY{name:' together towards happiness'}) --(n) with n order by n.name return n.name limit 5"}, {"query": "The book, \"The Magic of Skin Energy 2: The Little Secrets of Glowing Skin\", was published by New World Publishing.", "cypher": "match (n:ENTITY{name:'Magical Skin Energy Book 2: The Little Secret to Glowing Skin'}) - [:Relationship*1..3]->(x) where x.name <> 'New World Publishers' return distinct x.name"}, {"query": "Who is Hoodie Allen? Do you know him?", "cypher": "match (:ENTITY{name:'Hoodie Allen'}) --(p) return distinct p.name The name of the game is Hoodie Allen."}, {"query": "What do people born in July 1965 do? What are the 5 good ones?", "cypher": "match (:ENTITY{name:'July 1965 born'}) <- [:Relationship{name:'date of birth'}]-(n),(n) - [:Relationship{name:'occupation'}]->(h) return distinct h.name limit 5"}, {"query": "What is the scope of application of the academic theory proposed by Descartes?", "cypher": "match (:ENTITY{name:'descar'}) <- [:Relationship{name:'proponent'}]- ((x),(x) - [:Relationship{name:'scale of application'}]->(m) return distinct m.name"}, {"query": "I'm going to be talking to this guy in 10 sentences.", "cypher": "match (:ENTITY{name:'Chu Tianwal[spoiler: the fictional character]'}) --(m) with m order by m.name return m.name limit 10"}, {"query": "Can you tell me the names of the 10 actors?", "cypher": "match (:ENTITY{name:' actor'}) <- [:Relationship{name:' profession'}]- (q) return q.name limit 10"}, {"query": "This encyclopedia on the care of children aged 0-5 years is useful. Do you know the nationality of the author?", "cypher": "match ((:ENTITY{name:'0~5 years old Infant and toddler disease care encyclopedia'}) - [:Relationship{name:'author nationality'}]-> (n) return n.name"}, {"query": "What is the name of the original work by STELLA?", "cypher": "The name of the game is STELLA."}, {"query": "What is the size of the main screen of this GSM, CDMA2000 network mode?", "cypher": "The following is a list of the most commonly used data types:"}, {"query": "I would like to know if any of you have any links to the third tier label in Li Zhongqing?", "cypher": "match (n) <- [:Tag*3{name:'tag'}]- ((p:ENTITY{name:'Lee Tsung City'}) return distinct n.name limit 4"}, {"query": "Can you tell me the first article about the camp?", "cypher": "match (:ENTITY{name:'space'}) --(n) return n.name order by n.name limit 1"}, {"query": "Remember one of the major achievements of Japan?", "cypher": "match (:ENTITY{name:'Japan'}) <- [:Relationship{name:'nationality'}]-(n) - [:Relationship{name:'main achievements'}]->(q) return n.name order by n.name limit 1"}, {"query": "Help me find the next distribution area of the Big Dipper.", "cypher": "match (:ENTITY{name:'Dawg'}) - [:Relationship{name:'Distributed area'}]->(m) return distinct m.name"}, {"query": "Who knows what Van Yarin does for a living?", "cypher": "match (:ENTITY{name:'Fan Yalin'}) <- [:Relationship{name:'Chinese name'}]- ((p),(p) - [:Relationship{name:'profession'}]->(q) return distinct q.name"}, {"query": "Can you find 5 personal profiles of Iantsis from Greece in the 4 levels of relationships?", "cypher": "match (n:ENTITY{name:'Iantsis'}) - [*1..4]->(x) where x.name<>'Greek' return distinct x.name limit 5"}, {"query": "Can you please list the different places in Jiangsu Village and the same area, what are the labels and please list the number of labels in each location from small to large?", "cypher": "match (n:ENTITY{name:'\u6c5f\u6843\u6751'}) - [:Relationship{name:'the area'}]->(:ENTITY) <- [:Relationship{name:'the area'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, ((r.name) OR collect BY cDER"}, {"query": "Do you know the top five names in Danang province?", "cypher": "match (:ENTITY{name:'Dangdong Province'}) - [:Relationship{name:'alias'}]-> (p) with p order by p.name return p.name limit 5"}, {"query": "Do you understand the eight relationships that are included in the three-layer triad?", "cypher": "match path=(n) <- [:Relationship*3]- ((p:ENTITY{name:'three-string romance'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 8"}, {"query": "In the past, which calendar year was the year of the leopard?", "cypher": "match (:ENTITY{name:'B' year'}) <- [:Relationship{name:'Lunar calendar'}]- (x) return x.name limit 9"}, {"query": "Do you know you're my Alice?", "cypher": "match (:ENTITY{name:' you are my Alice'}) --(p) with p order by p.name return p.name"}, {"query": "I wanted to see what modern revisionist novels Cha Chao-ching has written.", "cypher": "match (p:ENTITY{name:' modern truth'}) <--(x) --> ((q:ENTITY{name:' diligence'}) return x.name"}, {"query": "In addition to his male poetry, he was given three different professions.", "cypher": "match (:ENTITY{name:'man'}) <-[:Relationship{name:'gender'}]-(x),(x) -[:Relationship{name:'profession'}]->(h) where h.name <> 'poet' return distinct h.name limit 3"}]