[{"query": "10 messages summarizing 168 lottery deals?", "cypher": "match (:ENTITY{name:'168 lottery contracts'}) --(h) with h order by h.name return h.name limit 10"}, {"query": "Can you explain the 0551 shopping return network to me?", "cypher": "match (q:ENTITY{name:'0551 shopping return net'}) --(m) with m order by m.name return m.name"}, {"query": "The location of the seven-color company sent me?", "cypher": "match (p:ENTITY{name:'Seven Colored Company'}) return p.location"}, {"query": "I want to know all about Hu Minghui.", "cypher": "match (:ENTITY{name:'Hummingbird'}) --(n) return n.name skip 1"}, {"query": "Help me find three pieces of Xu Zhiyuan", "cypher": "match (:ENTITY{name:'Xue Zhi'}) <- [:Relationship{name:'author'}]-(m) return distinct m.name limit 3"}, {"query": "Who can tell me what Tiger's main achievements are?", "cypher": "match (:ENTITY{name:'Tiger'}) <- [:Relationship{name:'foreign language name'}]-(p) - [:Relationship{name:'main achievement'}]->(n) return distinct n.name"}, {"query": "What are the top 10 jobs for medical students who graduate from the University of Saskatchewan?", "cypher": "match (:ENTITY{name:'Sinakasan Medical University'}) <- [:Relationship{name:'Graduate School'}]-(n) - [:Relationship{name:'Profession'}]->(p) return distinct p.name limit 10"}, {"query": "Give me five facts about the Japanese professional footballer, striker and forward, Takuto Shinkai.", "cypher": "match (n:ENTITY{name:'\u8fdc\u85e4\u7d14'}) - [*]->(x) where x.name<> '\u8fdc\u85e4\u7d14 is a Japanese professional footballer who plays as a striker. Return distinct x.name limit 5"}, {"query": "Can you give me the details of a provincial priority undergraduate university?", "cypher": "match (:ENTITY{name:'Priority undergraduate college of the province'}) <--(n) return n.name"}, {"query": "Do you know what other labels 1016 acetaminophen has besides industrial products?", "cypher": "match (:ENTITY{name:'1016 filler'}) - [:Tag{name:'label'}]-> (m) with m order by m.name where m.name <> 'industrial product' return m.name"}, {"query": "Can you tell me about the circular education institutions?", "cypher": "match (:ENTITY{name:'recycling educational institution'}) --(h) return h.name skip 1"}, {"query": "Find out all the software details for the 4.36MB HD Simulator Tour.", "cypher": "match (n:ENTITY{name:'HD'}) - [*]->(x) where x.name <>'4.36MB' return distinct x.name"}, {"query": "Can you help me find the relevant character tags for the 10/1 Rebirth PBY-5A waterplane crash?", "cypher": "match (:ENTITY{name:'10\u00b71 Rescue Airlines PBY-5A watercraft crash incident'}) - [:Tag{name:'tag'}]-> (q) with q order by q.name return q.name"}, {"query": "Can you show me the full list of cultural works in the 2013 Chinese Interior Design Thesis Collection?", "cypher": "match (n:ENTITY{name:'2013 Chinese interior design thesis collection'}) - [:Relationship*]->(x) where x.name <> 'culture' return distinct x.name limit 5"}, {"query": "Do you know the song of the cowboy? What time was it released?", "cypher": "match (:ENTITY{name:'swing'}) <- [*]-(m), (m) - [:Relationship{name:'swing time'}]->(n) return m.name, n.name limit 5"}, {"query": "Is there an exam coming up to further strengthen the force building of the police force?", "cypher": "match (q:ENTITY{name:' further strengthen the force building of the police force'}) <- [:Relationship{name:' Purpose'}]- (n) return n.name"}, {"query": "I want to know 5 things about the 124-kg Corbisiero Alex in the 5th level relationship?", "cypher": "match (n:ENTITY{name:'Corbisiero Alex'}) - [*1..5]->(x) where x.name <>'124 kg' return distinct x.name limit 5"}, {"query": "Can you help me find two openly gay people born in Henan?", "cypher": "match (:ENTITY{name:'Henan open'}) <- [:Relationship{name:'birthplace'}]- ((x),(x) - [:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 2"}, {"query": "What year's calendar starts and ends on February 8, 1940 or January 26, 1941?", "cypher": "match (:ENTITY{name:'08 February 1940 26 January 1941'}) <- [:Relationship{name:'Lunar calendar end time'}]- (m) return m.name"}, {"query": "Can you give us a little bit more about the man who is the sporting personality, Feroy Ariel, in the three levels of relationships?", "cypher": "match (n:ENTITY{name:'Feroy Ariel'}) - [*1..3]->(x) where x.name <> 'sportsman' return distinct x.name"}, {"query": "Please tell me about the types of relationships within the two layers of the four East-East City railway traffic?", "cypher": "match path=(n) <- [:Relationship*2]- ((p:ENTITY{name:'Tongyang City Railroad'}) UNWIND relationships(path) AS rel RETURN distinct rel.name limit 4"}, {"query": "What are the representations of the graduates of the Hague School?", "cypher": "match (q:ENTITY{name:'Highgate School'}) <-[:Relationship{name:'Graduate School'}]-(p) -[:Relationship{name:'represents work'}]->(x) return distinct x.name"}, {"query": "What is the name of the XY-10KW monopoly?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "I know Wei Xiang, a Han Chinese, born in November 1972 in Yangzhou, Anhui Province, his profession help me find out?", "cypher": "match (:ENTITY{name:'Wei Xiang, male, Han, born November 1972, from Yangzhou, Anhui Province, member of the Communist Party of China, undergraduate degree, Master's degree in Business Administration, economist, current Party Committee Secretary, legal representative and chairman of JianAn Investment Holding Group Limited\u3002'}) <- [:Describe{name:describe'}]- ((q) - [:Relationship{name:'profession'}]->(x) return distinct x.name"}, {"query": "What else do you know about Liu Shui-shun besides being a drama educator?", "cypher": "match (:ENTITY{name:'Sushi-chan'}) - [*1..2]->(p) where p.name <> 'theatre educator' return p.name limit 20"}, {"query": "What is the main ingredient of crystal chicken?", "cypher": "Match (:ENTITY{name:'Crystal Chicken'}) - [:Relationship{name:'Main ingredient'}]-> (m) return distinct m.name"}, {"query": "The book published by the Economic Science Press introduced me to two books.", "cypher": "match (:ENTITY{name:' Economic Science Publishing'}) <- [:Relationship{name:' Publishing'}]- ((p) - [:Relationship{name:' book name'}]->(n) return distinct n.name limit 2"}, {"query": "What labels are involved in the West Bengal shipwreck?", "cypher": "match (:ENTITY{name:'10\u00b730 West Bengal Indian state shipwreck'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name return m.name"}, {"query": "Who are the few celebrity men who have won the H5 Special Award for Popular Men?", "cypher": "match (:ENTITY{name:'H5 special type reward for popularity man'}) <- [:Relationship{name:'mystery reward'}]- ((n) - [:Relationship{name:'H5 special reward for popularity man'}]->(q) return distinct q.name"}, {"query": "I'm going to introduce you to two of the most popular Thai dishes.", "cypher": "match (:ENTITY{name:'Mau Zhou'}) <- [:Relationship{name:'category'}]-(p) - [:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 2"}, {"query": "Can you tell us all the information about the three levels of the relationship between the Greek Gentzoglou Sawas and the Greek woman?", "cypher": "match (n:ENTITY{name:'Gentzoglou Sawas'}) - [*1..3]->(x) where x.name <> 'Greek' return distinct x.name"}, {"query": "Please tell me what are the main works of this actress who won the 2010 TVPool Top Award for Best New Actress?", "cypher": "Match (:ENTITY{name:'2010 TVPool Top Award for Best Newcomer'}) <- [:Relationship{name:' Major achievement'}]-(n),(n) - [:Relationship{name:' Major work'}]->(h) return h.name order by h.name limit 1"}, {"query": "Can you list the main achievements of Li Puwei?", "cypher": "Match (:ENTITY{name:' Lee Po-woo'}) - [:Relationship{name:' Major achievements'}]-> (n) return n.name skip 2"}, {"query": "Can you tell me where the horse company is?", "cypher": "match (p:ENTITY{name:'The Horse Company'}) return p.location The name of the company is"}, {"query": "The problem is asking where Hugo was born, when he was born, where he graduated from high school.", "cypher": "match (:ENTITY{name:'Relationship{name:'birthplace'}]->(n) return n.name as name union all match (:ENTITY{name:'Relationship{name:'graduate college'}) ->(m) return m.name as name union all match (:ENTITY{name:'Relationship{name:'birthdate'}) -(r) return r.name as name"}, {"query": "Can you name five official titles?", "cypher": "match (q:ENTITY{name:' official version'}) <- [:Relationship{name:' release stage'}]- (x) return distinct x.name limit 5"}, {"query": "Can you name the top 5 works by this CCP member?", "cypher": "match (:ENTITY{name:'CPC member'}) <- [:Relationship{name:'faith'}]- ((n) - [:Relationship{name:'representative work'}]->(x) return x.name skip 1 limit 5"}, {"query": "What is the name of the Zhejiang cabbage made from tomatoes and onions?", "cypher": "match (:ENTITY{name:'Peg'}) <- [:Relationship{name:'category'}]-(m), (m) - [:Relationship{name:'main ingredient'}]->(n) where n.name='eggplant, onion' return distinct m.name"}, {"query": "In addition to the Senyang River Gorge and the Qing Creek Fisherman's Wharf, three other famous attractions in Zhejiang are recommended: China Green Expo Park Chongqing Park.", "cypher": "match (n:ENTITY{name:'Beijing; China Greenhouse Expo Chongqing Park'}) -[:Relationship{name:'Famous attractions'}]->(h) where h.name <> 'Shenzhen River' and h.name <> 'Ain Creek Fisherman' return distinct h.name limit 3"}, {"query": "What is the yield strength of the 16Mn2SiCrMoVTiA material we are using now?", "cypher": "match ((:ENTITY{name:'16Mn2SiCrMoVTiA'}) - [:Relationship{name:' yield strength'}]-> (p) return p.name"}, {"query": "Can you tell us about this man, Chen Joly?", "cypher": "match (m:ENTITY{name:'Cheryl'}) --(q) return distinct q.name"}, {"query": "Can you list a port warehouse with a year in history?", "cypher": "match (q:ENTITY{name:'port warehouse'}) <-[:Relationship{name:'historical function'}]- (h) return distinct h.name"}, {"query": "What is the genus of the Yunnan blueberry tree and where is it mainly distributed?", "cypher": "match (:ENTITY{name:'Yunnan blue fruit tree'}) - [:Relationship{name:'Kategory'}]->(n) return n.name as name union all match (:ENTITY{name:'Yunnan blue fruit tree'}) - [:Relationship{name:'Distributed area'}]->(m) return m.name as name"}, {"query": "The three-layer relationship between the six great masters of the repertoire and the work of the six great masters of the repertoire?", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <>'' return distinct x.name"}, {"query": "What are the important events that happened in Belarus?", "cypher": "match (:ENTITY{name:'Belarus'}) <- [:Relationship{name:'nationality'}]-(h),(h) - [:Relationship{name:'important event'}]->(x) return distinct x.name limit 5"}, {"query": "Can you tell us about the main works of this person born in Milton, England?", "cypher": "match (:ENTITY{name:'Milton, UK'}) <- [:Relationship{name:'place of birth'}]- ((m) - [:Relationship{name:'main works'}]->(h) return h.name skip 1 limit 10"}, {"query": "I'm going to start with a list of five Chinese online games that are athletic.", "cypher": "match (:ENTITY{name:' starting point Chinese web'}) <--(m), (m) -->> ((n) where n.name='game competition' return distinct m.name limit 5"}, {"query": "Do you know the Chinese name of Dan Ressinger, the world's greatest graphic designer?", "cypher": "match ((:ENTITY{name:'Dan Ressing[master of the world of graphic design]'}) - [:Relationship{name:'Chinese name'}]-> (n) return n.name"}, {"query": "Can you name three footballers and introduce them?", "cypher": "match (:ENTITY{name:'footballer'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return m.name,n.name limit 3"}, {"query": "I'm going to ask you to give me a personal profile of the three-tier relationship of the village secretary, Mr. Tsuerugan.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name <>'village clerk' return distinct x.name"}, {"query": "Please tell me about the three-tier relationship with Moroccan Aini Mourad?", "cypher": "match (n:ENTITY{name:'Aini Mourad'}) - [*1..3]->(x) where x.name<>'Morocco' return distinct x.name"}, {"query": "Do you know Alan Kolman?", "cypher": "match (:ENTITY{name:'Allan Kolman'}) --(h) return h.name skip 2 This is a list of all the different ways Allan Kolman is credited in the database."}, {"query": "Please help me find 10 species of bamboo and what kind of plants they belong to?", "cypher": "match (:ENTITY{name:' bamboo'}) <- [*]-(m), (m) - [:Relationship{name:' species'}]->(n) return m.name, n.name limit 10"}, {"query": "Please tell me which earthquake occurred on April 25, 2015 at 14:11:26.", "cypher": "match (h:ENTITY{name:'25 April 2015 at 14:11:26'}) <- [:Relationship{name:'earthquake time'}]- (q) return distinct q.name"}, {"query": "Do you know what landmarks and events are held in Guizhou?", "cypher": "match (:ENTITY{name:'Quan'}) <- [:Relationship{name:'location'}]- (h) return distinct h.name"}, {"query": "I would like to know more about the book +1 for Love Oil?", "cypher": "match (:ENTITY{name:'+1 for love oil'}) --(m) with m order by m.name where m.name <> 'books' return m.name"}, {"query": "I'm not sure what the name of the work by Ken Ben-Ping is, but I'm wondering what the name of the work is.", "cypher": "match (:ENTITY{name:'children's book, written by a young girl'}) <- [:Relationship{name:'author'}]- (h) return h.name"}, {"query": "What is the shortest path of the relationship between the helix and the helix in the second parameter?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'squirrel family'}) - [*..2]-(b:ENTITY{name:'squirrel parameter'})) return count ((p)"}, {"query": "The information about the 2014 Yunnan Pu Pu-en-Thai Spring is in the book Tea Culture in Four Levels of Relationship.", "cypher": "match (n:ENTITY{name:'2014 Yunnan Puyin Tea\u00b7\u6625'}) - [*1..4]->(x) where x.name <>'tea culture' return distinct x.name"}, {"query": "Do you have a pill for oral use? Can you find 10?", "cypher": "The following is a list of the most commonly used drugs in the United States:"}, {"query": "I'm going to be a writer, but I'm not going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer, I'm going to be a writer.", "cypher": "match (n:ENTITY{name:'submitting a message to a political leader'}) -[:Relationship*1..3]->(x) where x.name<>'details' return distinct x.name"}, {"query": "What is the shortest distance between Fujian Province's Fujian 1st and Fujian Province's Fujian 4th?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Fuzhou Province's Fujian City High School'}) - [:Relationship*..2]-(b:ENTITY{name:'Fuzhou Province's Fujian City High School'})) return count ((p)"}, {"query": "What are the properties of public documents? Can you tell me about 5 of them?", "cypher": "match (:ENTITY{name:'public'}) <--(n) return n.name limit 5 is the name of the file"}, {"query": "I want to hear about the representative work of Gudrun Brost.", "cypher": "match (n:ENTITY{name:'Gudrun Brost'}) - [:Relationship{name:'represents work'}]-> (x) return x.name skip 1"}, {"query": "What are the main achievements of Chang Yu-hsiung?", "cypher": "match (:ENTITY{name:'\u7a0b\u88d5'}) - [:Relationship{name:'main achievements'}]->(m) return distinct m.name"}, {"query": "Do you know what the Tibetan mountain is called?", "cypher": "match (n:ENTITY{name:'Tibet Mountain'}) - [:Relationship{name:'also known as 'Tibet Mountain'}]->(h) with h order by h.name where h.name <> 'Tibet Mountain' return h.name"}, {"query": "When did the 12-15 mountain-to-mountain standoff in the country start?", "cypher": "match ((:ENTITY{name:'12\u00b715 Sansi Tsukamoto \u5b9d\u5c71\u77ff\u96be'}) - [:Relationship{name:'occurrence time'}]-> (q) return q.name"}, {"query": "Can you tell me what the relationship is between the two layers of Zen Buddhism?", "cypher": "The name of the game is \"Relationship\" (Relationship) and the name of the game is \"Relationship\" (Relationship)"}, {"query": "Can you get me two books for $15.00?", "cypher": "The following is a list of the most commonly used keywords in the search results."}, {"query": "The problem is to find the voice slowly; send the work of Rao Huangxiu in full mobility; not fame slowly; send the 5 information materials of Rao Huangxiu in full mobility?", "cypher": "match (n:ENTITY{name:'slowly; sent over the line'}) -[:Relationship*]->(x) where x.name<>'slowly; sent over the line' return distinct x.name limit 5"}, {"query": "Help me find the three main departments of Guangzhou Sports Academy.", "cypher": "match (:ENTITY{name:'Canton Sports College'}) - [:Relationship{name:'main faculty'}]->(m) return distinct m.name limit 3"}, {"query": "Where is the Rat Company?", "cypher": "match (p:ENTITY{name:'Ratfish Company'}) return p.location"}, {"query": "I would like to know which bill is being passed to strengthen the administration of housing funds?", "cypher": "match (:ENTITY{name:'strengthen the housing balance management'}) <- [:Relationship{name:' reason for issuance'}]- (q) return q.name"}, {"query": "Which Hunan shareholder is a professor at the Agricultural University of China?", "cypher": "match (p:ENTITY{name:'Professor at Agricultural University of China'}) <--(x) -->(q:ENTITY{name:'Hunan Stock Exchange'}) return x.name"}, {"query": "Can you recommend a music-type learning software for my office?", "cypher": "match (:ENTITY{name:' study office class'}) <- [:Relationship{name:' music type'}]- (q) return q.name"}, {"query": "Who has been appointed Honorary President of the China Overseas Antiquities Return Association?", "cypher": "match (:ENTITY{name:'Honorary President of the China Overseas Antiquities Returns Association'}) --(q) return distinct q.name"}, {"query": "What games have the same game size as the Magic Bullet Adventure and what are their respective labels? How many of them do you show in order of number of labels?", "cypher": "The game is also known as the \"Game of Thrones\" (GTA) and the \"Game of Thrones\" (GTA)."}, {"query": "I need you to introduce me to the City Building Technician School.", "cypher": "match (:ENTITY{name:'School of City Building Technicians'}) --(p) return p.name skip 2"}, {"query": "Can you find the five species of monkey? Where are they all distributed?", "cypher": "match (:ENTITY{name:'genus'}) <--(m), (m) - [:Relationship{name:' distribution area'}]->(n) return distinct m.name,n.name limit 5"}, {"query": "Can you find me three doctors who can help me introduce them?", "cypher": "match (:ENTITY{name:'practising physician'}) <- [:Relationship*]-(m),(m) - [:Describe{name:'description'}]->(n) return m.name,n.name limit 3"}, {"query": "Can you find the rest of the labels for Internet product 10 Gigabit Ethernet?", "cypher": "match (m:ENTITY{name:'10 Gigabit Ethernet'}) - [:Tag{name:'tag'}]-> (h) with h order by h.name where h.name <> 'Internet product' return h.name"}, {"query": "And what will make you know who is Ikhham?", "cypher": "match (:ENTITY{name:'Ickham'}) <--(n) return n.name The name of the game is the same as the name of the game"}, {"query": "I want to watch the 2010 Mnet Asian Music Awards, do you know the exact time of the awards?", "cypher": "Match ((:ENTITY{name:'2010 Mnet Asian Music Awards'}) - [:Relationship{name:' awards time'}]-> (p) return p.name"}, {"query": "Can you tell me what the names of the schools and the labels of the schools in the same country are, and what the labels are for each school?", "cypher": "match (n:ENTITY{name:'professional beauty school'}) - [:Relationship{name:'country'}]->(:ENTITY) <- [:Relationship{name:'country'}]-(m:ENTITY), (r:ENTITY) <- [:Tag]-(m:ENTITY) return m.name, count(r) as c, collect(r.name) ORDER BY c"}, {"query": "Do you know about the 10 things about the Eastern Sheep?", "cypher": "match (m:ENTITY{name:'Eastern plate sheep'}) --(n) return distinct n.name limit 10"}, {"query": "Give me three sports games and describe them.", "cypher": "match (:ENTITY{name:'sports game'}) <- [:Relationship*]-(m), (m) - [:Describe{name:'description'}]->(n) return distinct m.name,n.name limit 3"}, {"query": "I wonder what is inter-metallic ethanol?", "cypher": "match (:ENTITY{name:'inter-methanol'}) --(h) with h order by h.name return h.name"}, {"query": "What chemical is the name of CHEBI:52682?", "cypher": "match (:ENTITY{name:'CHEBI:52682'}) <- [:Relationship{name:'ChEBI'}]- (m) return distinct m.name"}, {"query": "Who is the author of the novel Yue Jun-young?", "cypher": "match ((:ENTITY{name:'\u7389\u5bb9\u5bc2'}) < - [:Relationship{name:' author'}]-> (m) return m.name"}, {"query": "Have you heard of a game called 2012 Summer Farewell?", "cypher": "match (:ENTITY{name:'2012 don't wear summer clothes'}) --(n) with n order by n.name where n.name <> 'game' return n.name"}, {"query": "What is the acronym for the third-degree jump?", "cypher": "match (n:ENTITY{name:'three-level jump away'}) --(x) return distinct x.name"}, {"query": "What are the major awards of the university located at 65 Tongshan Road, Shenzhen, Shenzhen, China?", "cypher": "match (:ENTITY{name:'65 Shenzhen, Shenzhen, Northwest New Area'}) <- [:Relationship{name:'school address'}]- ((p) - [:Relationship{name:'main award'}]->(q) return distinct q.name"}, {"query": "Can you please find me a CAS number for 4-phenol, if you need it?", "cypher": "match ((:ENTITY{name:'4-phenol'}) - [:Relationship{name:'CAS log-in number'}]-> (x) return x.name"}, {"query": "What is Shandong cuisine except for the undersea salmon lung?", "cypher": "match (:ENTITY{name:'Santondo'}) <- [:Relationship{name:'Classification'}]-(m) where m.name <> 'submarine pine silver lung' return distinct m.name"}, {"query": "What is the shortest distance between the two levels of Suzhou School of Civil Engineering and the Volkswagen Vocational Training School?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Suzhou School of Construction and Engineering'}) - [*..2]-(b:ENTITY{name:'Stockholm Vocational Skills Training School'})) return count ((p)"}, {"query": "How many meters high is the Type 21 submarine we know of?", "cypher": "The name of the sub is \"Relationship\" (Relationship)"}, {"query": "Has anyone calculated the molecular weight of the lightning bolt in the reaction?", "cypher": "match ((:ENTITY{name:'Relationship{name:'molecular mass'}]-> (n) return n.name)"}, {"query": "I want to know if you have any information about the tag for Liu Wenwei? I want three tags besides the economic and the political ones.", "cypher": "match (n:ENTITY{name:'\u6587'}) - [:Tag{name:'tag'}]->(h) with h order by h.name where h.name <> 'economy' and h.name <> 'person' return h.name limit 3"}, {"query": "Please tell me what the relationship between the two layers of the Queen Camilla is?", "cypher": "The name of the game is \"Relationship\" (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relationship) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (Relations) (R"}, {"query": "What other label features does the 5-year-old's parent encyclopedia have besides books?", "cypher": "match (:ENTITY{name:'05 years old'}) --(n) with n order by n.name where n.name <> 'books' return n.name limit 5"}, {"query": "What is the name of the dish that includes the dry season beans?", "cypher": "match (:ENTITY{name:'Dry season beans'}) - [:Relationship{name:'Classification'}]->(n) return n.name as name union all match (:ENTITY{name:'Dry season beans'}) - [:Relationship{name:'Main ingredient'}]->(m) return m.name as name"}, {"query": "I would like to know the other 4 messages in the second level of this TV series.", "cypher": "match (:ENTITY{name:'Sister flowers in the city'}) - [:Relationship*1..2]-(p) where p.name <> 'TV series' return p.name limit 4"}, {"query": "Chance The Rapper You know?", "cypher": "Match (:ENTITY{name:'Chance The Rapper'}) --(p) return p.name skip 2 This is a list of all the different ways Chance The Rapper is credited in the database."}, {"query": "Who are the main characters in this movie of my gangster girlfriend?", "cypher": "match (:ENTITY{name:'My gangster girlfriend'}) <- [:Relationship{name:'Chinese name'}]- ((p) - [:Relationship{name:'leading character'}]->(n) return distinct n.name"}, {"query": "There is a book originally called Koumii Party, which is Chinese for \"Mommy Party\".", "cypher": "match (:ENTITY{name:'\u3053\u307f\u3063\u304f\u30d1\u30fc\u30c6\u30a3\u30fc'}) <- [:Relationship{name:' original name'}]- (h) return h.name"}, {"query": "Can you tell me about the school that specializes in visual communication arts?", "cypher": "match (h:ENTITY{name:' visual art convey'}) --(q) return q.name order by q.name limit 10"}, {"query": "I'm not sure if you can check all the information about the maintenance of the car on the 10th of December.", "cypher": "match (n:ENTITY{name:'Relationship*]->(x) where x.name<>'13' return distinct x.name"}, {"query": "Do you know what Li Xianlian's work represents?", "cypher": "match (:ENTITY{name:'Li Xian, male, born in Beijing, 1938), graduated from Beijing Chinese Medical University, China Medical University, head of the ear, nose and throat department of West China Hospital."}, {"query": "Do you know anything about the work of 8th Triton?", "cypher": "match (:ENTITY{name:'eight-three-ton'}) <--(n) return n.name"}, {"query": "Do you know of any other information about the state of the pastoral estate besides the historical event? Help me find 50 information in 3 layers.", "cypher": "match (:ENTITY{name:'state pastoral enclave'}) - [*1..2]->(p) where p.name <> 'historical event in China' return p.name limit 50"}, {"query": "Do you know how much land the Zhuangdao Elementary School occupies?", "cypher": "match (:ENTITY{name:'Juzhangdo Primary School'}) - [:Relationship{name:'School occupies area'}]-> (m) return distinct m.name"}, {"query": "I want to see the rest of the work in the Tomb of Zhou Wenling, with no more than three layers of relationships.", "cypher": "match (n:ENTITY{name:'Relationship*1..3]->(x) where x.name<>'weekly' return distinct x.name"}, {"query": "Can you help me understand the two most famous attractions in Cat Baia besides the plum blossoms and the flowers?", "cypher": "match (n:ENTITY{name:'Catswings Bay'}) - [:Relationship{name:'Famous attractions'}]->(h) where h.name <> 'Plum' and h.name <> 'Flower' return distinct h.name limit 2"}, {"query": "Can nitric oxide dissolve in water? What are the main industries in which it is used?", "cypher": "match (:ENTITY{name:'nitrous oxide'}) - [:Relationship{name:'water-soluble'}]->(n) return n.name as name union all match (:ENTITY{name:'nitrous oxide'}) - [:Relationship{name:'application'}]->(m) return m.name as name"}, {"query": "What theory comes from applied psychology?", "cypher": "match (:ENTITY{name:'applied psychology'}) <- [:Relationship{name:'source'}]- (x) return distinct x.name"}, {"query": "The film is based on the life of the famous writer, who was born in the city of Chongqing in the late 19th century.", "cypher": "match (:ENTITY{name:'Chai Jing'}) <- [:Relationship{name:'Chinese name'}]-(p),(p) - [:Relationship{name:'representative work'}]->(q) where q.name <> 'Relationship' return distinct q.name limit 5"}, {"query": "The date of birth is September 1964 and the artist's most representative work is his painting \"The Man Who Was Born in 1964\".", "cypher": "match (:ENTITY{name:'September 1964'}) <- [:Relationship{name:'date of birth'}]-(q),(q) - [:Relationship{name:'representing work'}]->(x) return x.name order by x.name limit 10"}, {"query": "The incident was caused by an explosion at a biochemical plant in Yunnan, China.", "cypher": "match (:ENTITY{name:'A chemical plant explodes'}) <- [:Relationship{name:'event'}]- (m) return m.name"}, {"query": "I'm looking for a lucky company, what year did I start?", "cypher": "match (p:ENTITY{name:'lucky company'}) return p.time"}, {"query": "The Internet product 180 returns you know?", "cypher": "match (:ENTITY{name:'180 return'}) --(x) with x order by x.name where x.name <> 'Internet product' return x.name"}, {"query": "What is the shortest distance between Dawangtu Village and Stone Tower House Village on the 3rd floor?", "cypher": "match p=allshortestpaths (((a:ENTITY{name:'Gangdong Village'}) - [*..3]-(b:ENTITY{name:'Gangdong Village'})) return count ((p)"}, {"query": "What accident happened in Phowa, India?", "cypher": "match (h:ENTITY{name:'Purwa of India'}) <- [:Relationship{name:'Places of occurrence'}]- (m) return distinct m.name"}, {"query": "Do you know which pavilion is hosting the 2011 Shenzhen China Real Estate Exchange during the Spring Festival?", "cypher": "match ((m:ENTITY{name:'2011 China Shenzhen [Spring] Real Estate Exchange'}) - [:Relationship{name:'hosting exhibition hall'}]-> (q) return q.name"}, {"query": "What are some of the works that the professor has represented?", "cypher": "match (:ENTITY{name:'professor'}) <- [:Relationship{name:'profession'}]-(n) - [:Relationship{name:'representative work'}]->(m) return m.name skip 2 limit 1"}, {"query": "Help me find the species of the genus Arctium.", "cypher": "match (:ENTITY{name:'they belong to Arca'}) <-[:Relationship{name:'they belong to'}]-(m) return distinct m.name limit 10"}, {"query": "What is the main achievement of a woman?", "cypher": "match (:ENTITY{name:' female'}) <- [:Relationship{name:' gender'}]-(m),(m) - [:Relationship{name:' major achievements'}]->(p) return p.name order by p.name limit 1"}, {"query": "What chemical is C5H1004?", "cypher": "The name of the game is \"Relationship\" (Relationship)"}, {"query": "What is the name of the exhibition for the 2010 Xi'an International Furniture Fair in Xi'an, Central West China?", "cypher": "match ((h:ENTITY{name:'2010 Xi'an International Furniture Fair in the Central West of China'}) - [:Relationship{name:'exhibition name'}]-> (n) return n.name"}, {"query": "The article was written by a journalist from the Iranian Air Force who was a member of the Iranian Air Force.", "cypher": "match (:ENTITY{name:'1.9 Iran Boeing crash'}) - [:Tag{name:'tag'}]-> (m) with m order by m.name where m.name <> 'Foreign historical event' return m.name limit 3"}, {"query": "Can you give me the address of Sunli?", "cypher": "match (p:ENTITY{name:'Sennheiser'}) return p.location The name of the match is"}, {"query": "What fish has a rounded tip and a prominent head after the nostrils?", "cypher": "match (:ENTITY{name:' kissing end rounded, head significantly raised after nostrils\u3002'}) --(x) return distinct x.name"}]