[{"query": "Please tell me when the 1946 Copa Am\u00e9rica Argentina starts, I'm afraid I won't be able to come.", "cypher": "match(q:ENTITY{name:'1946The year of the Argentine America Cup'})-[:Relationship{name:'Start time'}]-> (h) return h.name"}, {"query": "Please help me find 5 books for $18.80 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'18.80Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Tell me about the three-layered relationship between the reborn computer clouds of midnight smoking creators and the fictional information bubble.", "cypher": "match (n:ENTITY{name:'The rebirth of cloud computing'})-[:Relationship*1..3]->(x) where x.name<>'Smoking at midnight' return distinct x.name"}, {"query": "Find me 7 places to see in the Khothai Desert, besides 100 tickets and the address in Nanchang City, Jiangxi Province.", "cypher": "match (n:ENTITY{name:'The scenery of the Hokkaido Desert'})-->(h) with h order by h.name where h.name <> '100Japanese yen' and h.name <> 'The city of Nanjing, Jiangxi Province' return h.name limit 7"}, {"query": "On the advanced worker, the third grade of memory, awarded the best secondary school language teacher in Shandong province, his representative is the language characteristics of the practical language of the language.", "cypher": "match (:ENTITY{name:'Advanced worker, remembered third grade, awarded as the best secondary language teacher in Shandong province'})<-[:Relationship{name:'Major achievements'}]-(x),(x)-[:Relationship{name:'Representative works'}]->(h) where h.name <> 'The language features of the Java language' return distinct h.name limit 5"}, {"query": "Help me find a soup made with golden needles.", "cypher": "match (:ENTITY{name:'The needle'})<-[:Relationship{name:'Main ingredients'}]-(m), (m)-[:Relationship{name:'Classified'}]->(n) where n.name='Oh, my God.' return distinct m.name"}, {"query": "A travel strategy that is all about the daily life in East Africa, with specific themes and expresses the spirit of hospitality, regional unity and spiritual experience, is called \"What's Up?\"", "cypher": "match (:ENTITY{name:'The city is a place of spiritual experience and hospitality.'})<-[:Relationship{name:'The daily life in East Africa has specific themes'}]- (q) return distinct q.name"}, {"query": "Check out when 123 is coming online.", "cypher": "match(:ENTITY{name:'123Computational navigation'})-[:Relationship{name:'Uptime'}]-> (h) return h.name"}, {"query": "Please help me find the synonyms and antonyms for the word \"dragon\"", "cypher": "match (:ENTITY{name:'The Dragonfly'})-[:Relationship{name:'The synonym'}]->(n) return n.name as name union all match (:ENTITY{name:'The Dragonfly'})-[:Relationship{name:'The Antithesis'}]->(m) return m.name as name"}, {"query": "The book of the Book of the Book of Solomon is a collection of books written by the famous author of the Book of Solomon.", "cypher": "match (:ENTITY{name:'The Scroll of the Yellow River'})-[:Relationship{name:'The year'}]->(n) return n.name as name union all match (:ENTITY{name:'The Scroll of the Yellow River'})-[:Relationship{name:'Written by'}]->(m) return m.name as name"}, {"query": "I'm sorry, but you mentioned that the label of the village under the rock is not a village.", "cypher": "match (:ENTITY{name:'The village of Dawa'})-[:Tag{name:'The label'}]-> (p) with p order by p.name where p.name <> 'Village' return p.name limit 1"}, {"query": "I'm going to tell you about this book, the Golden Book of Emotional Development for 3-year-olds that you know of.", "cypher": "match (:ENTITY{name:'0Oh, my God.3The baby is a love interest.'})--(m) with m order by m.name where m.name <> 'Books and books' return m.name"}, {"query": "The author of the book, who is a Chinese writer, wrote about the five representative works of this Ming Dynasty figure.", "cypher": "match (:ENTITY{name:'In the morning'})<-[:Relationship{name:'Nationality'}]-(n),(n)-[:Relationship{name:'Representative works'}]->(h) return h.name order by h.name limit 5"}, {"query": "The film, which runs for 96 minutes, features Wang Vijun and Lee Ji-hye.", "cypher": "match (p:ENTITY{name:'96One minute'})<--(x)-->(q:ENTITY{name:'King Vixen The Li River'}) return x.name"}, {"query": "The school is ZUNYI HANGTIAN MIDDLE SCHOOL, located in Guangzhou's middle section of Guangzhou's Shenzhen district.", "cypher": "match (:ENTITY{name:'The secondary school in accordance with space (((ZUNYI HANGTIAN MIDDLE SCHOOLThe city is located in the middle of Guangzhou Road in the Hsichuan District of Shenzhen.'})<-[:Describe{name:'Describe'}]-(n),(n)-[:Relationship{name:'Main awards'}]->(p) return p.name order by p.name limit 10"}, {"query": "Help me find three songs sung by the Oasis.", "cypher": "match (:ENTITY{name:'The storm'})<-[:Relationship{name:'The singer'}]-(m) return distinct m.name limit 3"}, {"query": "Please help me find the information of five Serbian people, Mirda Kovacic and Milian.", "cypher": "match (n:ENTITY{name:'Myrda Kovacic is a writer; The Millian'}) - [*]->(x) where x.name<>'Serbia' return distinct x.name limit 5"}, {"query": "The compound is 1-DNJ, and its molecular formula is 1-DNJ.", "cypher": "match(:ENTITY{name:'1-DNJ'})-[:Relationship{name:'Molecular'}]-> (m) return m.name"}, {"query": "Find out about the inner workings of French footballer Zeghdane Lehit's two-tiered relationship.", "cypher": "match (n:ENTITY{name:'Zeghdane Lehit'})-[:Relationship*1..2]->(x) where x.name<>'Zeghdane Lehit,French footballer.' return distinct x.name"}, {"query": "I'm now curious about Kawai Namori's whole story.", "cypher": "match (:ENTITY{name:'Kawai is a very special place.'})--(x) return x.name skip 3"}, {"query": "I want to know when the Big Star Company opened.", "cypher": "match (p:ENTITY{name:'The Star Spangled Banner'}) return p.time"}, {"query": "I bet you that this song was written for the military department of the new district of Zhejiang, sung by Zhao Yan, and I want 4 more information about this song.", "cypher": "match (n:ENTITY{name:'The West Bank'})-->(h) with h order by h.name where h.name <> 'The sail' and h.name <> 'The song was written for the military ministry of the new district of Fuhai.' return h.name limit 4"}, {"query": "Can you find out the names of 10 alumni of Guangxi Master's University? Please help me introduce them.", "cypher": "match (:ENTITY{name:'The University of Guangxi'})<-[*]-(m), (m)-[:Describe{name:'Describe'}]->(n) return distinct m.name,n.name limit 10"}, {"query": "Please tell me 10 things you know about the Ujian-Zhongshan Strait.", "cypher": "match (:ENTITY{name:'The Ujiang Dragon Strait'})--(p) return p.name limit 10"}, {"query": "I'm not sure what kind of job I can sell, but I'm not sure what kind of job I can sell.", "cypher": "match (n:ENTITY{name:'The summer is unusual.'})<-[:Relationship{name:'Chinese name'}]-(x)-[:Relationship{name:'Professional life'}]->(h) return distinct x.name"}, {"query": "What are the names of the objects with the same label as asteroid 9931? Please list them in order of their number from small to large.", "cypher": "match (n:ENTITY{name:'The asteroid9931'})-[:Tag{name:'The label'}]->(:ENTITY)<-[:Tag{name:'The label'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "Li Jiehua is a member of the Association of Guangxi Fine Artists.", "cypher": "match (:ENTITY{name:'Li Jiehua is a member of the Association of Guangxi Artists and has painted Chinese pencil flower paintings, painted flowers, and watercolors.'})<-[:Describe{name:'Describe'}]-(x),(x)-[:Relationship{name:'Representative works'}]->(h) return distinct x.name"}, {"query": "The novel that was called The Night of the Long Knives is called \"Yue\" in Chinese.", "cypher": "match (:ENTITY{name:'The night of the crying'})<-[:Relationship{name:'Written by'}]-(h)-[:Relationship{name:'Chinese name'}]->(m) return distinct m.name limit 1"}, {"query": "I'm not sure if you're familiar with the name of the artist, but I'm not sure if you're familiar with the name of the artist.", "cypher": "match (:ENTITY{name:'Ding Xiaoping'})-[:Relationship{name:'Representative works'}]-> (x) return  distinct x.name"}, {"query": "The following is a list of some of the topics that are covered in this blog:", "cypher": "match (n:ENTITY{name:'Send the ancient mountain people'})-[:Relationship*1..3]->(x) where x.name<>'Literary works' return distinct x.name"}, {"query": "Internet lecturer at Tsinghua University Research Institute, China E-Commerce Association Certified Trainer, Founder of Shenzhen Longlin Group, WeChat Marketing Lecturer, 2013 Micro-marketing Newcomer of the Year Award, participated in the 2013 New Media Micro-marketing Development Report.", "cypher": "match (:ENTITY{name:'Internet lecturer at the Institute of Research of Tsinghua University Certified trainer by the China E-Commerce Association Founder of Shenzhen Longlin Group WeChat Marketing Lecturer2013The annual Micro-Marketing Newcomer Award is a big deal.2013New media micro-marketing development report written and published by Yui...'})<-[:Describe{name:'Describe'}]-(h)-[:Relationship{name:'Major achievements'}]->(q) return distinct h.name,q.name"}, {"query": "Help me find 10 different types of lettuce.", "cypher": "match (:ENTITY{name:'The Rupee'})<-[:Relationship{name:'Classified'}]-(m) return m.name limit 10"}, {"query": "Look who is the legal representative of Shanghai Yonglei Logistics Limited.", "cypher": "match(:ENTITY{name:'Shanghai Yongyuan Logistics Ltd.'})-[:Relationship{name:'Legal representatives'}]-> (q) return q.name"}, {"query": "Please share with me what you know about Zhang Gongyuan.", "cypher": "match (:ENTITY{name:'Zhang Go-shing'})--(h) return h.name skip 3"}, {"query": "Can you list me the three main achievements of the man who opened the screen of the statue of the man who is the representative of the statue of the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man who is the man is the man who is the man who is the man who is the man is the man who is the man is the man who is the man is the man who is the man who is the man who is the man who is the man is the man is the man who is the man is the man is the man who is the man who is the man is the man is the man who is the man who is the man who is the man is the man who is the man is the man is the man who is the man who is the man is the man who is the man is the man is the man is the man who is the man who is the man who is the man is the man is the man who is the man is the man who is the man who is the man is the man who is the man is the man is the man is the man who is the man who is the man who is the man is the man is the man who is the man is the man is the man is the man is the man is the man is the man is the man is the man is the man is the man", "cypher": "match (:ENTITY{name:'The palace of the king of the jungle, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the lion, the palace of the man, the palace of the man.'})<-[:Relationship{name:'Representative works'}]-(m),(m)-[:Relationship{name:'Major achievements'}]->(n) return n.name order by n.name limit 3"}, {"query": "Please help me find two CDs for $82 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'82.0Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "I'm going to introduce you to a 13 book series of interesting stories about the two layers of the relationship between old Jiangsu and the presentation of the work.", "cypher": "match (n:ENTITY{name:'The curious legend of the old Jiangsu'})-[:Relationship*1..2]->(x) where x.name<>'13' return distinct x.name"}, {"query": "Please tell me what are the names of the places that belong to the city of Samsun? Please give me 5 names.", "cypher": "match (:ENTITY{name:'The city of Da Nang'})<-[:Relationship{name:'Area'}]-(q)-[:Relationship{name:'Other names'}]->(x) return x.name order by x.name limit 5"}, {"query": "Please help me find out who the author of this book is who is smiling you to death without paying for it.", "cypher": "match(:ENTITY{name:'Laughing is not worth dying for.'})-[:Relationship{name:'Written by'}]-> (n) return n.name"}, {"query": "The first thing I want to say is, is that the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story, the people who are in the middle of the story.", "cypher": "match (n:ENTITY{name:'The Great Wall1'}) - [:Relationship*1..2]->(x) where x.name<>'The city of Mangan' return distinct x.name"}, {"query": "Tell us about five personal details about the four-tier relationship of sports personality DeVoe.", "cypher": "match (n:ENTITY{name:'The Law of the Sea'})-[*1..4]->(x) where x.name<>'Sports figures' return distinct x.name limit 5"}, {"query": "The story of Carmen Tudela is a story of love and love.", "cypher": "match (:ENTITY{name:'Carmen Tudela'})--(p) return p.name skip 1"}, {"query": "The word \"Yay\" is a Chinese word that means \"to be\".", "cypher": "match (:ENTITY{name:'Mother and grandmother'})-[:Relationship{name:'Get out of here.'}]->(m) return distinct m.name"}, {"query": "Please tell me if there are any tags that are Google's Node.js tag.", "cypher": "match (:ENTITY{name:'GoogleUse the language of the web pageNode.js'})-[:Tag{name:'The label'}]-> (p) return p.name skip 1"}, {"query": "Please find the two main awards of Hunan Financial Industry Professional Technology College, but apart from the Hunan Province's only finance-oriented, literate and blended higher education institution and Hunan Province's exemplary higher education institution, Hunan Province's Excellence Higher Education Institute.", "cypher": "match (n:ENTITY{name:'Hunan College of Finance and Industry'})-[:Relationship{name:'Main awards'}]->(h) where h.name <> 'The only higher education institution in Hunan province that is both financial and literary.' and h.name <> 'Hunan Provincial Exemplary Higher School, Hunan Provincial Superior Higher School' return distinct h.name limit 2"}, {"query": "What games are similar to the 1950s art game? What are the different labels? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'Art of the 1950s'})-[:Relationship{name:'Game type'}]->(:ENTITY)<-[:Relationship{name:'Game type'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The names of the people who were born in the same time period as the people of the Jiangxi and Vietnamese empires, and what labels each of them has.", "cypher": "match (n:ENTITY{name:'The Yangtze'})-[:Relationship{name:'Where I was born'}]->(:ENTITY)<-[:Relationship{name:'Where I was born'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "In addition to being an economist, Sheng introduces 10 other professions related to him.", "cypher": "match (:ENTITY{name:'Thank you.'})<-[:Relationship{name:'Chinese name'}]-(p),(p)-[:Relationship{name:'Professional life'}]->(q) where q.name <> 'Economist' return distinct q.name limit 10"}, {"query": "In addition to \"Soft and Too Loving You\", there are three other works by Liu Xiaobo.", "cypher": "match (n:ENTITY{name:'The research'})-[:Relationship{name:'Representative works'}]->(h) where h.name <> 'Softly' and h.name <> 'I love you too much.' return distinct h.name limit 3"}, {"query": "The scope of the evaluation of the evaluation work includes the implementation of a sanitary rural rehabilitation project in the area, called the \"Page name\"?", "cypher": "match (:ENTITY{name:'The area where the sanitary rural rehabilitation project is being implemented.'})<-[:Relationship{name:'Scope of the audit'}]- (p) return p.name"}, {"query": "Can you tell me the spelling of the word \"Jubei\" for me?", "cypher": "match(:ENTITY{name:'The word \"juju\"'})-[:Relationship{name:'Spelling'}]-> (n) return n.name"}, {"query": "Please recommend a famous place to visit in Kangme-ta Lake Rock, if not the Great Wall of Japan and the Taichung Rock Prophecy.", "cypher": "match (n:ENTITY{name:'The rocks of Lake Connemara'})-[:Relationship{name:'Famous places'}]->(h) where h.name <> 'The Great Treasure' and h.name <> 'The Lake Tahoe Limestone' return distinct h.name limit 1"}, {"query": "If you know the date of the founding of Wanhua Chemical Limited, it was in Beijing.", "cypher": "match(:ENTITY{name:'The Chinese Chemical[The Chinese]Limited company'})-[:Relationship{name:'Founded'}]-> (h) return h.name"}, {"query": "Who and where was born in the same place, and who have all these people with a tag? Show these people in order of their tag number.", "cypher": "match (n:ENTITY{name:'The well is still there'})-[:Relationship{name:'Where I was born'}]->(:ENTITY)<-[:Relationship{name:'Where I was born'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Please list one of the occupations of this female figure for me.", "cypher": "match (:ENTITY{name:'The woman'})<-[:Relationship{name:'Gender and race'}]-(q),(q)-[:Relationship{name:'Professional life'}]->(m) return m.name skip 1 limit 1"}, {"query": "The film is based on the novel of the same name by the writer, who is the author of the book.", "cypher": "match (:ENTITY{name:'The mother-in-law[Poetry by Wu]'})-[:Relationship{name:'Date of creation'}]->(n) return n.name as name union all match (:ENTITY{name:'The mother-in-law[Poetry by Wu]'})-[:Relationship{name:'Written by'}]->(m) return m.name as name"}, {"query": "Please provide three publications priced at 28.0 yuan", "cypher": "match (:ENTITY{name:'28.0Japanese yen'})<-[:Relationship{name:'Pricing'}]-(x),(x)-[:Relationship{name:'Title'}]->(q) return distinct q.name limit 3"}, {"query": "The problem is that the content of the five literary works is in the four-tier relationship with the Hanmin Palace of the Chancellor of the Exchequer, Lee Kuan Yew.", "cypher": "match (n:ENTITY{name:'The silver table of the Duke of Li, the Duke of Buckingham and the Duke of York'})-[*1..4]->(x) where x.name<>'Literary works' return distinct x.name limit 5"}, {"query": "I'm not sure if you can tell me about the three messages that you have for me besides the passion films.", "cypher": "match (:ENTITY{name:'The Mystery of the Twin Sisters'})--(m) with m order by m.name where m.name <> 'The film' return distinct m.name limit 3"}, {"query": "Check out the company information in the two-tier relationship of this organization, Business Information Consulting Ltd.", "cypher": "match (n:ENTITY{name:'Hebei is not expecting business information consulting company'})-[*1..2]->(x) where x.name<>'Organizing body' return distinct x.name"}, {"query": "Help me find 10 different types of Jiangsu food.", "cypher": "match (:ENTITY{name:'Jiangsu dishes'})<-[:Relationship{name:'Classified'}]-(m) return distinct m.name limit 10"}, {"query": "Help me find the famous sights and monks of Yummin Temple", "cypher": "match (:ENTITY{name:'The Yumin Temple'})-[:Relationship{name:'Famous places'}]->(n) return n.name as name union all match (:ENTITY{name:'The Yumin Temple'})-[:Relationship{name:'Famous monks'}]->(m) return m.name as name"}, {"query": "Can you recommend me a product with six 5\" screens?", "cypher": "match (:ENTITY{name:'5Inches'})<-[:Relationship{name:'Screen size'}]- (p) return p.name limit 6"}, {"query": "What are the labels for each of the works? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'Blue Elephant Nose Lake is a beautiful lake.'})-[:Relationship{name:'Written by'}]->(:ENTITY)<-[:Relationship{name:'Written by'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "I want to know about the relationship between the two layers of the word \"Jigsaw\" and \"Jigsaw\" in the work \"Jigsaw\".", "cypher": "match (n:ENTITY{name:'The flowers of the lotus flower are in the rose bush in the Jinsha.'})-[:Relationship*2]->(x) where x.name<>'The Word' return distinct x.name"}, {"query": "I forgot the CAS number of 4-boc-2-methyl acetate again, please tell me again, thank you.", "cypher": "match(:ENTITY{name:'4-boc-2-Methyl chloride'})-[:Relationship{name:'CASThe number of the log'}]-> (q) return q.name"}, {"query": "Find out what chemical is dangerously described as 2149 mg/kg (oral rat)", "cypher": "match (:ENTITY{name:'2149 mg/kg (Mouse whispering)'})<-[:Relationship{name:'The danger described'}]- (n) return n.name"}, {"query": "Please help me find two books for $35.00 and tell me what category they belong to.", "cypher": "match (:ENTITY{name:'35.00Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Tag{name:'The label'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "The city of the same name, which has an artistic version of the city of Yangon, is a city of extraordinary significance for the people of Yangon.", "cypher": "match (:ENTITY{name:'The artistic version of the film is a tribute to the scholarship of the author.'})<-[:Relationship{name:'Meaning'}]-(x)-[:Relationship{name:'City of origin'}]->(m) return distinct m.name"}, {"query": "The problem is that the next iteration of the theme is the second volume of Lin Wen's poetry, which contains information about the two-tier relationship.", "cypher": "match (n:ENTITY{name:'The second volume of the Tibetan poetry'})-[:Relationship*1..2]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "You know, the Chinese are cooking.", "cypher": "match (:ENTITY{name:'The School of Law'})<-[:Relationship{name:'Chinese name'}]-(m)-[:Relationship{name:'Professional life'}]->(x) return distinct x.name limit 1"}, {"query": "Please describe the three main departments of the schools belonging to the General Government Higher Professional Schools.", "cypher": "match (:ENTITY{name:'Publicly funded general higher education'})<-[:Relationship{name:'Category'}]-(q)-[:Relationship{name:'Main Faculty'}]->(x) return x.name skip 1 limit 3"}, {"query": "What else do you know about the term \"Chen-Tsu-Tsu\" in the Internet?", "cypher": "match (n:ENTITY{name:'The old body'})<-[:Relationship{name:'Chinese name'}]-(p)-[:Relationship{name:'Explanation'}]->(x) where x.name <> 'Internet slang' return distinct x.name limit 5"}, {"query": "Tell me about the person who is 5 times the size of the river.", "cypher": "match (n:ENTITY{name:'The first one'})-[*]->(x) where x.name<>'Characters' return distinct x.name limit 5"}, {"query": "Please list the information of the members of the Shinkansen Customs Group.", "cypher": "match (:ENTITY{name:'Member of the Shinkansen Customs Party'})--(m) return  distinct m.name"}, {"query": "Which schools are identical to the East Lake School in Yue Lake County and have the same labels? Find me the number of labels from big to small.", "cypher": "match (n:ENTITY{name:'East Lake School, Yue Pike County'})-[:Relationship{name:'Type of school'}]->(:ENTITY)<-[:Relationship{name:'Type of school'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "What is the name of the person who is a professional and what are their individual labels? Please list them in order of number of labels, from big to small.", "cypher": "match (n:ENTITY{name:'The first was the death of the first.'})-[:Relationship{name:'Professional life'}]->(:ENTITY)<-[:Relationship{name:'Professional life'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The following table shows the number of lawyers who are assigned to a judicial office, and what labels they have.", "cypher": "match (n:ENTITY{name:'Beijing City Law Firm'})-[:Relationship{name:'The Judiciary'}]->(:ENTITY)<-[:Relationship{name:'The Judiciary'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "And I'm going to use 2-Zet in a chemical experiment, and I want to know what the point of the reaction is.", "cypher": "match(:ENTITY{name:'2-The Tsunami'})-[:Relationship{name:'The point of no return'}]-> (x) return x.name"}, {"query": "I'm going to introduce you to David Barker.", "cypher": "match (:ENTITY{name:'David Barker'})--(n) return n.name skip 3"}, {"query": "Please tell me the name of the Hong Kong director, screenwriter, and screenwriter who has written numerous works including The One-Man Wrecking Crew, The Great Wizard of Oz, The Painting of the Wrecking Crew, The King of the Wrecking Crew, The King of the Wrecking Crew, The Wind Turning, The Wrecking Crew, The Three Kingdoms of the Dragon, The Dragon Taking Off the Shield, and the director's maiden role as the Wrecking Crew.", "cypher": "match (:ENTITY{name:'Hong Kong director, screenwriter, with numerous screenplays including The One with the Dragon, The Great Magician, The Painting of the Skin, The King of the Gun, The Wind Turning, The Sands of the Wind, The Dress of the Sun, The Dragon Taking Off the Shield, The Three Kingdoms of the Dragon, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Girl Who Stole the Carriage, The Carriage, The Girl Who Stole the Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Carriage, The Car, The Car, The Carriage, The Carriage, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The Car, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The, The'})<-[:Describe{name:'Describe'}]-(x)-[:Relationship{name:'Chinese name'}]->(n) return distinct n.name"}, {"query": "List below the information in the three-tiered relationship of the National Women's and Children's Health Information Training Program.", "cypher": "match (n:ENTITY{name:'National information training on health policy for mothers and children'})-[:Relationship*1..3]->(x) where x.name<>'Social activities' return distinct x.name"}, {"query": "Do you know about the Sun Yat-sen's military headquarters? What other information is there besides the fact that it is located outside Guangzhou, please find the other 5 information in the 2nd layer", "cypher": "match (:ENTITY{name:'The Sun Yat-sen Warlord'})-[*1..2]->(p) where p.name <> 'The city of Guangzhou' return  p.name limit 5"}, {"query": "Please help me find a job as a host, singer, actor, writer, please.", "cypher": "match (:ENTITY{name:'Host, singer, actor, writer'})<-[:Relationship{name:'Professional life'}]-(x),(x)-[:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 1"}]