[{"query": "What games are the same size as the game The Spider's Escape and what are their individual labels? Order them in order of how many labels they have, from most to least.", "cypher": "match (n:ENTITY{name:'The Big Spider Escape'})-[:Relationship{name:'The size of the game'}]->(:ENTITY)<-[:Relationship{name:'The size of the game'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Can you name five?", "cypher": "match (p:ENTITY{name:'The man'})<--(x)-->(q:ENTITY{name:'Painter'}) return x.name limit 5"}, {"query": "Ro lists five types of subjects in the two-layer relationship of the temple of the battle bird.", "cypher": "match (n:ENTITY{name:'The Temple of the Sun[The Warbird]'})-[:Relationship*1..2]->(x) where x.name<>'Five out of five' return distinct x.name"}, {"query": "Find the five Congolese footballers in Makita-Passy Fabry's six-level relationship.", "cypher": "match (n:ENTITY{name:'Makita-Passy Fabry'})-[*1..6]->(x) where x.name<>'Makita-Passy Fabry,The Congolese footballer.' return distinct x.name limit 5"}, {"query": "I want to get all the information from the Digital Media Department of the Academy of Fine Arts.", "cypher": "match (:ENTITY{name:'Department of Digital Media at the Faculty of Arts'})--(m) return m.name order by m.name"}, {"query": "Thanks for helping me find the molecular formula that is understandable in the book.", "cypher": "match(:ENTITY{name:'The Gupim'})-[:Relationship{name:'Molecular'}]-> (m) return m.name"}, {"query": "The tofu soup is a food made from ingredients such as tofu, tofu and other ingredients.", "cypher": "match (:ENTITY{name:'The tofu soup is a food made from ingredients such as tofu and tofu.'})<-[:Describe{name:'Describe'}]-(q),(q)-[:Relationship{name:'Spices'}]->(m) return distinct m.name"}, {"query": "I'm not sure if I'm ready to put my modern language in a bunch of curly hair.", "cypher": "match (:ENTITY{name:'A drug addict'})--(x) with x order by x.name where x.name <> 'Modern speech' return x.name"}, {"query": "In the meantime, I'm going to share some of the work of Lee Young-ho and Yang Yi-nan.", "cypher": "match (n:ENTITY{name:'The Chinese government has announced that it will'})-[*1..3]->(x) where x.name<>'Lee by the way.' return distinct x.name"}, {"query": "Tell me about the next time you have a question about the three other tags besides language and literature.", "cypher": "match (n:ENTITY{name:'The second brother, Yang Xiu, left the puzzle in order.'})-[:Tag{name:'The label'}]->(h) where h.name <> 'Language' and h.name <> 'Literature and culture' return distinct h.name limit 3"}, {"query": "Do you know about the Richter's sea turtle? Find out what else is there to know about the other seven species of sea turtle in the 2nd layer.", "cypher": "match (:ENTITY{name:'The beaches of Richmond'})-[:Relationship*1..2]->(p) where p.name <> 'The Autumn Sea Turtle' return  p.name limit 7"}, {"query": "Do you know the movie The Thief of Zelda? What other information besides the director of Zelda, please find the other 7 information in layer 2", "cypher": "match (:ENTITY{name:'The Thief Astor'})-[:Relationship*1..2]->(p) where p.name <> 'The Chu-Haran' return  p.name limit 7"}, {"query": "I'm going to be a part of the project, but I'm not going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project, I'm going to be a part of the project.", "cypher": "match (n:ENTITY{name:'The Sun is a calendar astronomer; Third generation of teachers of the Kyaw Lu script'}) - [:Relationship*1..2]->(x) where x.name<>'7 out of 10' return distinct x.name"}, {"query": "The song is a cover of the song \"Sweet Dreams\" by the band The Beatles.", "cypher": "match (:ENTITY{name:'The song is sung by the singer.2013Year of releaseEPAlbum: Love your heart'})<-[:Relationship{name:'Major achievements'}]-(q),(q)-[:Relationship{name:'Songs and music'}]->(n) return distinct n.name"}, {"query": "I'm going to be writing a blog about my artwork, and I'm going to be writing about my artwork.", "cypher": "match (n:ENTITY{name:'Vietnamese'})-[:Relationship*1..2]->(x) where x.name<>'Art work' return distinct x.name"}, {"query": "I wonder who wrote the lyrics to the song \"Lover No. 16\" by my grandfather.", "cypher": "match(:ENTITY{name:'16The Lovers'})-[:Relationship{name:'The word'}]-> (x) return x.name"}, {"query": "The book is a poem about the relationship between the two worlds, and the story of the two worlds in which the city is destroyed by the night.", "cypher": "match (n:ENTITY{name:'The city was whistled at night.[A poem of praise]'})-[:Relationship*1..2]->(x) where x.name<>'Published' return distinct x.name"}, {"query": "Fan Ko Xin, born on September 19, 1993 in Seven Rivers City, Heilongjiang Province, is a Chinese female short track speed skater.", "cypher": "match (:ENTITY{name:'The film is about a young man named Van Koen.1993Year of birth9The Moon19Born in Seitung River City, Heilongjiang Province, she is a Chinese female short track speed skater.'})<-[:Describe{name:'Describe'}]-(n),(n)-[:Relationship{name:'Main awards'}]->(h) return distinct h.name"}, {"query": "The investigation has revealed how the outcome of the disappearance of a Chinese tourist in South Korea at 12.30 was reported.", "cypher": "match(:ENTITY{name:'12.30Chinese tourist disappears in South Korea'})-[:Relationship{name:'The result'}]-> (p) return p.name"}, {"query": "Help me find the five species of plants in the mulberry category", "cypher": "match (:ENTITY{name:'The Kimberley'})<-[:Relationship{name:'The Outline'}]-(m) return distinct m.name limit 5"}, {"query": "1- What is the Chinese name for methylphenidate, please help me check in the chemical catalogue.", "cypher": "match(:ENTITY{name:'1-Methyl methacrylate'})-[:Relationship{name:'Chinese surname'}]-> (m) return m.name"}, {"query": "What other information is there about the Zuo Dong Collection of Books published by the Commercial Printing Library? Help me find the other 6 in the 3 layers.", "cypher": "match (:ENTITY{name:'The Grand Master's School'})-[:Relationship*1..3]-(p) where p.name <> 'Commercial printing' return p.name limit 6", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 47 (offset: 46))\n\"PROFILE match (:ENTITY{name:'The Grand Master's School'})-[:Relationship*1..3]-(p) where p.name <> 'Commercial printing' return p.name limit 6\"\n                                               ^"}, {"query": "I'm not sure what kind of label is this, but I'm not sure what kind of label is this.", "cypher": "match (:ENTITY{name:'Hu is a Chinese national.'})<-[:Relationship{name:'Chinese name'}]-(m),(m)-[:Tag{name:'The label'}]->(x) return distinct x.name limit 1"}, {"query": "The following is a list of literary works by Liu Yi-nan.", "cypher": "match (n:ENTITY{name:'The first is the one that I sent.'})-[:Relationship*1..2]->(x) where x.name<>'Literary works' return distinct x.name"}, {"query": "What are the different labels of each person? List them in order of their number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'Sun Weng is a Chinese writer.'})-[:Relationship{name:'The political face'}]->(:ENTITY)<-[:Relationship{name:'The political face'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The company is also known for its online magazine, The Mystery Ocean, which is published by Jilin Publishing Group Ltd.", "cypher": "match (n:ENTITY{name:'The Mysterious Sea'})-[:Relationship*1..3]->(x) where x.name<>'The company is a subsidiary of Jilin Publishing Group.' return distinct x.name"}, {"query": "I'm not sure what Fan Qiao Hua does for a living.", "cypher": "match (:ENTITY{name:'The Chinese'})<--(x)-[:Relationship{name:'Professional life'}]->(n) return n.name order by n.name limit 5"}, {"query": "Please give us 10 articles about Cloud Wang.", "cypher": "match (:ENTITY{name:'CLOUD WANG'})--(h) return  distinct h.name limit 10"}, {"query": "The name of the pilot, who is also known as \"Ch\u014dsh\u016b-no-Hokuto\", is not mentioned in the book.", "cypher": "match (n:ENTITY{name:'The flight officer is small.'})-[:Relationship{name:'Other names'}]->(h) where h.name <> 'The King of the Owl' and h.name <> 'North Nose' return distinct h.name limit 3"}, {"query": "Tell me about the three films you know about Sato Ryuji, besides his other work as a \"Live Spectacle Fire Movie Ninja\" assistant to Yuki Bobo.", "cypher": "match (:ENTITY{name:'Sato is a Japanese artist.'})<-[:Relationship{name:'Chinese name'}]-(x)-[:Relationship{name:'Representative works'}]->(m) where m.name <> '\"I'm not going to.Live SpectacleThe Ninja Fireworks are a great way to get your kids to enjoy the game.' return distinct m.name limit 3", "error": "Invalid input 'm': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CALL\"\n  \"CONTAINS\"\n  \"CREATE\"\n  \"DELETE\"\n  \"DETACH\"\n  \"ENDS\"\n  \"FOREACH\"\n  \"IN\"\n  \"INSERT\"\n  \"IS\"\n  \"LOAD\"\n  \"MATCH\"\n  \"MERGE\"\n  \"NODETACH\"\n  \"OPTIONAL\"\n  \"OR\"\n  \"REMOVE\"\n  \"RETURN\"\n  \"SET\"\n  \"STARTS\"\n  \"UNION\"\n  \"UNWIND\"\n  \"USE\"\n  \"WITH\"\n  \"XOR\"\n  \"^\"\n  <EOF> (line 1, column 172 (offset: 171))\n\"PROFILE match (:ENTITY{name:'Sato is a Japanese artist.'})<-[:Relationship{name:'Chinese name'}]-(x)-[:Relationship{name:'Representative works'}]->(m) where m.name <> '\"I'm not going to.Live SpectacleThe Ninja Fireworks are a great way to get your kids to enjoy the game.' return distinct m.name limit 3\"\n                                                                                                                                                                            ^"}, {"query": "How do you explain the term \"misuse of public funds\"?", "cypher": "match (:ENTITY{name:'Misuse of public funds'})<-[:Relationship{name:'Interpretation'}]-(m) return distinct m.name"}, {"query": "I'm not sure if this is a good idea, but I'm not sure if it's a good idea.", "cypher": "match (:ENTITY{name:'The apprentice of the magician'})--(h) return h.name order by h.name limit 1"}, {"query": "Check when the 2012 Shanghai International Education Expo is taking place.", "cypher": "match(:ENTITY{name:'2012The Shanghai International Education Fair is held in Shanghai.'})-[:Relationship{name:'The session'}]-> (m) return m.name"}, {"query": "I really want to go to the Shanghai International Luxury Packaging Expo 2011 and see it.", "cypher": "match(:ENTITY{name:'2011The Shanghai International Luxury Packaging Fair is being held in Shanghai.'})-[:Relationship{name:'Show time'}]-> (h) return h.name"}, {"query": "I want to know who is the president of the Civilian Village of Xi'an County in accordance with the law.", "cypher": "match (:ENTITY{name:'President of the Citizens' Village of Xi'an County'})--(h) return h.name order by h.name", "error": "Invalid input 'Village': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 57 (offset: 56))\n\"PROFILE match (:ENTITY{name:'President of the Citizens' Village of Xi'an County'})--(h) return h.name order by h.name\"\n                                                         ^"}, {"query": "Do you know Sam Hunt's nickname? Name three, please.", "cypher": "match (:ENTITY{name:'Sam HuntHe is a former college football player and country singer.'})<-[:Describe{name:'Describe'}]-(p)-[:Relationship{name:'Other names'}]->(q) return distinct p.name limit 10"}, {"query": "The following is a list of topics related to the two-tiered relationship of urban geography in Northeast China, published by Science Press.", "cypher": "match (n:ENTITY{name:'Urban geography in northeastern China'})-[:Relationship*1..3]->(x) where x.name<>'Scientific publishing' return distinct x.name"}, {"query": "I'm going to be a little more specific about this.", "cypher": "match (:ENTITY{name:'brad paisley'})--(x) return x.name skip 3"}, {"query": "I want an introduction to the three-layer relationship between the method of airtight testing of dangerous goods and airtight packaging published by China Standard Publishing.", "cypher": "match (n:ENTITY{name:'Test methods for airtight packaging of dangerous goods'})-[:Relationship*1..3]->(x) where x.name<>'China Standard Publishing' return distinct x.name"}, {"query": "The Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, the Chinese Academy of Sciences, and the Chinese Academy of Engineering.", "cypher": "match (:ENTITY{name:'The Chinese government has also been trying to get the Chinese government to stop the use of chemical weapons.'})<-[:Describe{name:'Describe'}]-(h)-[:Relationship{name:'Major achievements'}]->(x) return distinct x.name"}, {"query": "The article is about the political education and political science topics that are being studied in the two-tiered relationship.", "cypher": "match (n:ENTITY{name:'Research on the topic of higher education in political thought'})-[:Relationship*1..2]->(x) where x.name<>'The younger brother.' return distinct x.name"}, {"query": "The Chinese with the number \"Ling\" are?", "cypher": "match (p:ENTITY{name:'The number is Liang.'})<--(x)-->(q:ENTITY{name:'China'}) return x.name"}, {"query": "I'm not sure what the main achievements of Irene Ko are.", "cypher": "match (:ENTITY{name:'Irene ko'})<-[:Relationship{name:'Foreign language name'}]-(q),(q)-[:Relationship{name:'Major achievements'}]->(n) return n.name order by n.name limit 3"}, {"query": "Please list all the content of Sun Yat-sen.", "cypher": "match (:ENTITY{name:'Sun Yue'})--(q) return q.name skip 3"}, {"query": "I want to know the total number of Longcheng businesses.", "cypher": "match (p:ENTITY{location:'The Long Spring'}) return count(p)"}, {"query": "Which people have the same birthday as Kirilenko Denis, and what tags do they each have? Please list them in order of number of tags, in order of number of tags.", "cypher": "match (n:ENTITY{name:'Kirilenko Denis'})-[:Relationship{name:'Date of birth'}]->(:ENTITY)<-[:Relationship{name:'Date of birth'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The following is a list of all the works by Ro in Guayaquil, Guanajuato, Guanajuato.", "cypher": "match (n:ENTITY{name:'The town of Guaia'})-[:Relationship*]->(x) where x.name<>'The world is full of it.' return distinct x.name"}, {"query": "The following information is provided on the technical regulations for the management of the Huai'an and Huai'an artificial forests published by the State Forestry Department:", "cypher": "match (n:ENTITY{name:'Technical regulations for the management of the artificial forest in Hua'an'})-[:Relationship*]->(x) where x.name<>'State Forestry' return distinct x.name", "error": "Invalid input 'an': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 104 (offset: 103))\n\"PROFILE match (n:ENTITY{name:'Technical regulations for the management of the artificial forest in Hua'an'})-[:Relationship*]->(x) where x.name<>'State Forestry' return distinct x.name\"\n                                                                                                        ^"}, {"query": "I'm going to do an experiment with 2-hydro-4-hydroxybutyric acid, and you tell me its CAS NO.", "cypher": "match(:ENTITY{name:'2-Oh, my God.-4-Methacrylic acid'})-[:Relationship{name:'CASNO'}]-> (n) return n.name"}, {"query": "Excellence Unit for Contemporary Education Research in China (2013)", "cypher": "match (:ENTITY{name:'Excellence in contemporary education research in China (This is a very good post.)2013The year)'})<-[:Relationship{name:'Main awards'}]- (n) return  distinct n.name"}, {"query": "I wonder which company has the slogan \"Honest business, service first\"?", "cypher": "match (:ENTITY{name:'The company is a company that is run with integrity and service is paramount.'})<-[:Relationship{name:'The company slogan'}]- (x) return x.name"}, {"query": "Please help me find the other 5 pieces of information on this person in the 2nd layer.", "cypher": "match (:ENTITY{name:'Zhang Yixiang'})-[:Relationship*1..2]-(p) where p.name <> 'Characters' return p.name limit 5"}, {"query": "I want to know the other 5 information about this person in the 2nd layer.", "cypher": "match (:ENTITY{name:'King of the army'})-[:Relationship*1..2]-(p) where p.name <> 'Characters' return p.name limit 5"}, {"query": "The film is based on the novel of the same name by Japanese author and filmmaker Tatsuya Nakano.", "cypher": "match (:ENTITY{name:'The spaceship2199The song is sung by the Japanese singer-songwriter, Aoichi Kouno.'})<-[:Relationship{name:'Sound'}]-(h)-[:Relationship{name:'The first stage'}]->(p) return distinct h.name limit 10"}, {"query": "I'm looking for a time to find a candy super sweet company.", "cypher": "match (p:ENTITY{name:'The Super Sweet Company'}) return p.time"}, {"query": "The article is about the five graduates of the University of Wei Wei who are in the fourth tier of Kim Bashan's relationship.", "cypher": "match (n:ENTITY{name:'The Chinese'})-[*1..4]->(x) where x.name<>'The University of Haifa' return distinct x.name limit 5"}, {"query": "Which people were born in the same place as Tatsuya and what labels did they have? List them in order of their respective labels.", "cypher": "match (n:ENTITY{name:'The story of Takeda'})-[:Relationship{name:'Where I was born'}]->(:ENTITY)<-[:Relationship{name:'Where I was born'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "What kind of genre is the \"Skype\" of the song?", "cypher": "match (:ENTITY{name:'The Axis'})-[:Relationship{name:'Sports'}]->(n) return n.name as name union all match (:ENTITY{name:'The Axis'})-[:Relationship{name:'Written by'}]->(m) return m.name as name"}, {"query": "Help me find 10 Chinese dishes.", "cypher": "match (:ENTITY{name:'Chinese cuisine'})<-[:Relationship{name:'Classified'}]-(m) return distinct m.name limit 10"}, {"query": "Please provide me with details of the three-tier relationship regarding the provisional measures of the Standing Committee of the People's Congress of the City of Songkhun regarding incentives and guarantees for the office of the City's representative of the people.", "cypher": "match (n:ENTITY{name:'Provisional Measures of the Standing Committee of the People's Congress of the City of Songcon on Incentives and Safeguards for the Maintaining of the Office of the City Representative'})-[*1..3]->(x) where x.name<>'Standing Committee of the People's Congress of the City of Songkong' return distinct x.name", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 92 (offset: 91))\n\"PROFILE match (n:ENTITY{name:'Provisional Measures of the Standing Committee of the People's Congress of the City of Songcon on Incentives and Safeguards for the Maintaining of the Office of the City Representative'})-[*1..3]->(x) where x.name<>'Standing Committee of the People's Congress of the City of Songkong' return distinct x.name\"\n                                                                                            ^"}, {"query": "I'm not sure what Taegmin does for a living, but I'm not sure what he does for a living.", "cypher": "match (:ENTITY{name:'The Japanese'})<-[:Relationship{name:'Chinese name'}]-(h),(h)-[:Relationship{name:'Professional life'}]->(x) return distinct x.name"}, {"query": "Please list the main achievements of one party apart from the first prize of the 2006 calligraphy exhibition and the seventh prize of the 2002 book review.", "cypher": "match (n:ENTITY{name:'Party'})-[:Relationship{name:'Major achievements'}]->(h) where h.name <> '06First prize of the year' and h.name <> '02Yearbook review for the seventh grade' return distinct h.name limit 1"}, {"query": "Which games are the same size as Naeli's cute baby games and what are the labels for each of them? Show these games in order of number of labels.", "cypher": "match (n:ENTITY{name:'The lovely baby of Nairi'})-[:Relationship{name:'The size of the game'}]->(:ENTITY)<-[:Relationship{name:'The size of the game'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The problem is that the public health press has published a two-tiered description of the relationship between the hazards of easily misused food additives and the identification of the work.", "cypher": "match (n:ENTITY{name:'Identifying the dangers of easily misused food additives'})-[:Relationship*1..2]->(x) where x.name<>'Public health publishing' return distinct x.name"}, {"query": "Can you tell me who else has written about the \"Kinshasa\" campaign?", "cypher": "match (:ENTITY{name:'The Flock of the Whale'})--(x) return x.name order by x.name"}, {"query": "Help me find 10 species of vertebrates in the subfamily", "cypher": "match (:ENTITY{name:'The Armenian vertebrate'})<-[:Relationship{name:'The Yemen'}]-(h) return h.name limit 10"}, {"query": "What are the works of novelists called Khlo\u00e9 Ch'ing-wen?", "cypher": "match (:ENTITY{name:'Cold Brunei'})<-[:Relationship{name:'Written by'}]-(x),(x)-[:Relationship{name:'Chinese name'}]->(p) return distinct p.name"}, {"query": "Can you run away? Whose work is the little vanilla? Name the first three.", "cypher": "match (:ENTITY{name:'Run, you little bug.'})<-[:Relationship{name:'Representative works'}]- (h) return h.name order by h.name limit 5"}, {"query": "Help me find the 11 words next to the three native words.", "cypher": "match (:ENTITY{name:'The Earth'})<-[:Relationship{name:'Chief of Staff'}]-(m), (m)-[:Relationship{name:'Total paintings'}]->(n) where n.name='11' return distinct m.name limit 3"}, {"query": "The 2012 China International Touchscreen Expo is about to be held in Qingdao, please announce the time.", "cypher": "match(:ENTITY{name:'2012China[Qinghai]The International Touchscreen Exhibition is held in the city of'})-[:Relationship{name:'Time of operation'}]-> (p) return p.name"}, {"query": "Help me find 10 companies with more than 3,000 employees.", "cypher": "match (:ENTITY{name:'The company'})<-[:Tag{name:'The label'}]-(m), (m)-[:Relationship{name:'Employees'}]->(n) where substring(n.name,0,4)>'3000' return m.name limit 10"}, {"query": "Find the same price as the old one and tell me what their respective labels are, then reorder them by number of labels and give them to me.", "cypher": "match (n:ENTITY{name:'The Old and New'})-[:Relationship{name:'Pricing'}]->(:ENTITY)<-[:Relationship{name:'Pricing'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The first 10 gold coins were issued for the words other than the word \"Mummy\".", "cypher": "match (:ENTITY{name:'A ton of gold'})<-[:Relationship{name:'Real name'}]-(h)-[:Relationship{name:'Title'}]->(m) where m.name <> 'Silence' return distinct m.name limit 10"}, {"query": "I want to know which novel has 519481 words in total.", "cypher": "match (:ENTITY{name:'519481'})<-[:Relationship{name:'Total number of words'}]- (h) return h.name"}, {"query": "I'm going to show you a list of 10 novels that are both online and romance novels.", "cypher": "match (:ENTITY{name:'The Internet Novel'})<-[:Tag{name:'The label'}]- (mn) -[:Tag{name:'The label'}]->(n:ENTITY{name:'Romance novels'}) return mn.name limit 10"}, {"query": "Our lab needs to use S-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E-E", "cypher": "match(:ENTITY{name:'(S)-(-)-Compared to ethanol'})-[:Relationship{name:'The flash'}]-> (x) return x.name"}, {"query": "Help me find a place to play all year round.", "cypher": "match (:ENTITY{name:'Available all year round'})<-[:Relationship{name:'Swimming season'}]-(m) return m.name limit 1"}, {"query": "Tell me about a major incident that happened in this sporting project where the men shot 25 meters with a pistol.", "cypher": "match (:ENTITY{name:'The man25The gunshot'})<-[:Relationship{name:'Sports projects'}]-(m)-[:Relationship{name:'Important events'}]->(h) return h.name order by h.name limit 1"}, {"query": "Can you describe the song \"Blood\" from the movie?", "cypher": "match (:ENTITY{name:'The Brooklyn Bridge'})--(p) return p.name skip 3"}, {"query": "Help me find 10 works by Liu Xiaobo other than the Mekong operation.", "cypher": "match (n:ENTITY{name:'The Giants'})-[:Relationship{name:'Major works'}]->(h) with h order by h.name where h.name <> 'Operation Mekong' return h.name limit 10"}, {"query": "Please tell me which company is headquartered in Dalei Economic and Technological Development Zone, Liaoning Province, in the 35th floor of the building 1-6-2 in the city of Yangzhou.", "cypher": "match (q:ENTITY{name:'The village of Yangbambu in the Daleian Economic and Technological Development Zone, Liaoning Province35The building1-6-2'})<-[:Relationship{name:'Location'}]- (n) return distinct n.name"}, {"query": "Don't call him \"Khul-Jah\", tell me his first name and his main accomplishments.", "cypher": "match (:ENTITY{name:'The comfort'})<-[:Relationship{name:'Other names'}]-(q)-[:Relationship{name:'Major achievements'}]->(p) return distinct q.name,p.name"}, {"query": "I would like to hear about Shelley.P.B. Please list the first three.", "cypher": "match (:ENTITY{name:'Shelley is a very nice person.P.B.'})--(p) return p.name order by p.name limit 3"}, {"query": "The Russian President Vladimir Putin has asked the Russian government to declare a national holiday in the Russian state of Petrograd.", "cypher": "match (:ENTITY{name:'The Russian government has not yet released the results.'})<-[:Relationship{name:'Capital city'}]-(x),(x)-[:Relationship{name:'National day'}]->(q) return distinct q.name"}, {"query": "I remember a game with a score of 6 (Monk, Monk, Yellow, Hot Beer, Wonderful, Perfect)", "cypher": "match (:ENTITY{name:'6The monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk, the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the monk the mon mon mon mon mon mon mon monk the mon mon mon mon mon monk the monk the monk the monk the mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon mon'})<-[:Relationship{name:'The end number'}]- (m) return m.name"}]