[{"query": "I need five messages from football player Jiang Sak-rin.", "cypher": "match (n:ENTITY{name:'The name of the place is Jiangsak'})-[*]->(x) where x.name<>'Soccer player' return distinct x.name limit 5"}, {"query": "I'm not sure if I should be the only one who gets the news about the iWALKDBL800i.", "cypher": "match (n:ENTITY{name:'iWALKDBL800i'})--(x) return x.name"}, {"query": "The article was written by a journalist from the South China Sea who was a member of the South China Sea delegation to the UN General Assembly.", "cypher": "match (n:ENTITY{name:'The court sentenced Huangzhou to death.'})-[:Relationship*]->(x) where x.name<>'The Su-an' return distinct x.name limit 5"}, {"query": "The government's work department, the office of the city commissioner of Jindal, has five levels of relations.", "cypher": "match (n:ENTITY{name:'The office of the Xiangde Municipal Council'})-[*1..5]->(x) where x.name<>'Government work' return distinct x.name"}, {"query": "Please tell me which works are from the same period as the Su Sheng, the water-cleaners and the wooden ones, and what labels are on each of them? Find them and list them for me in order of number of labels from most to least.", "cypher": "match (n:ENTITY{name:'The water source is clear, the wood is gold'})-[:Relationship{name:'The year'}]->(:ENTITY)<-[:Relationship{name:'The year'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Please describe the characteristics of the exhaust pipe bolt.", "cypher": "match (:ENTITY{name:'The exhaust pipe bolt'})<-[:Relationship{name:'Chinese name'}]-(m),(m)-[:Relationship{name:'Features'}]->(x) return distinct x.name"}, {"query": "Help me find the synonyms and antonyms that are returned.", "cypher": "match (:ENTITY{name:'Turn around[Meaning of the word]'})-[:Relationship{name:'The synonym'}]->(n) return n.name as name union all match (:ENTITY{name:'Turn around[Meaning of the word]'})-[:Relationship{name:'The Antithesis'}]->(m) return m.name as name"}, {"query": "As far as I know, the book on esophageal imaging is written by Li Wenhua and Liu Yinjie, published by People's Health Publishing, and I would like to know six more things about this book, if you can help me find out.", "cypher": "match (n:ENTITY{name:'Imaging of the Esophagus'})-->(h) with h order by h.name where h.name <> 'The first is that of the The first is that of the new government.' and h.name <> 'Public health publishing' return h.name limit 6"}, {"query": "Do you know about Hong Valley Mountain? Find out about the other 10 information in the 2nd level, apart from the information about the location outside Linzhou.", "cypher": "match (:ENTITY{name:'The Hun Valley'})-[:Relationship*1..2]->(p) where p.name <> 'Southwest of Linzhou15Km' return  p.name limit 10"}, {"query": "I'm looking for information on the relationship between Yue Da and Yong Uncle Satong Yue Zhen Mountain, who gave twelve questions to his eight-day-long Minshuang 2nd level.", "cypher": "match (n:ENTITY{name:'The first is the question of the origin of the name of the city.'})-[:Relationship*1..2]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "Help me find out the author of the book, Xu Yong, about the principles of industrial communication technology and the other 7 steps in applying them in the 3 layers of this book.", "cypher": "match (:ENTITY{name:'Principles and applications of industrial communication technology'})-[*1..3]-(p) where p.name <> 'The Chinese' return distinct p.name limit 7"}, {"query": "Help me find the five encyclopedic plants", "cypher": "match (:ENTITY{name:'The Encyclopaedia Liliaceae'})<-[:Relationship{name:'The Department'}]-(m) return distinct m.name limit 5"}, {"query": "The first round of the political exam in the A-Level in the state of Hubei in the autumn of 2015 was held in the city of Hubei.", "cypher": "match (:ENTITY{name:'05A political round of the AICTEA'})--(m) with m order by m.name return distinct m.name skip 1 limit 5"}, {"query": "I'm not sure what kind of Ethernet medium is fully dual-functional.", "cypher": "match (:ENTITY{name:'Full-time'})<-[:Relationship{name:'The pattern'}]- (x) return x.name"}, {"query": "The book is published by the publisher of the magazine Electrical Principles.", "cypher": "match (:ENTITY{name:'Principles of electrical engineering (including the syllabus for the self-study exam) (shouting)'})<-[:Relationship{name:'Title'}]-(p)-[:Relationship{name:'Publishing house'}]->(n) return distinct n.name limit 3"}, {"query": "The 10th Millennium Cures are not included in the list of other achievements, including the Chinese Medical Experts Association.", "cypher": "match (:ENTITY{name:'The Thousand Circles'})<-[:Relationship{name:'Other names'}]-(h)-[:Relationship{name:'Major achievements'}]->(q) where q.name <> 'Chinese and Chinese Language Experts Association' return distinct q.name limit 10"}, {"query": "The following is a list of the works that have been published by the following authors:", "cypher": "match (n:ENTITY{name:'The integration of literature in the field of semantic research: the current and contemporary volumes'})-[:Relationship*1..2]->(x) where x.name<>'Publisher' return distinct x.name"}, {"query": "Please provide information on the type of business that Blue Light Technology Limited was originally registered under.", "cypher": "match(x:ENTITY{name:'Blue Light Technology Co., Ltd. of the city of Foshan'})-[:Relationship{name:'Type of business'}]-> (n) return n.name"}, {"query": "I'm going to have to ask you to give me a copy of your farewell poem.", "cypher": "match (:ENTITY{name:'The poetry of the good-bye'})-[:Relationship{name:'Representative works'}]-> (q) return q.name limit 1"}, {"query": "Can you help me understand who wrote the music for Zhang Xiaohua's song \"Taoxian\"?", "cypher": "match(:ENTITY{name:'The Tactics[Zhang Xiaohua performs the song]'})-[:Relationship{name:'Music'}]-> (x) return x.name"}, {"query": "Which works are published by the same publisher with blue footprint? What are the labels for each? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'The blue footprints'})-[:Relationship{name:'Publishing house'}]->(:ENTITY)<-[:Relationship{name:'Publishing house'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "Give me a list of five men who have held the world record in the 400 metres.", "cypher": "match (:ENTITY{name:'The man400The American world record holder'})--(p) return  distinct p.name limit 5"}, {"query": "Help me find six of them.", "cypher": "match (:ENTITY{name:'The Chinese'})<-[:Relationship{name:'Classified'}]-(m) return m.name limit 6"}, {"query": "I remember there was a chemical called helium with a molecular weight of 243.", "cypher": "match (:ENTITY{name:'243'})<-[:Relationship{name:'Molecular weight'}]- (q) return q.name"}, {"query": "I would like to know if this is a different name for a mammal.", "cypher": "match (:ENTITY{name:'Breastfeeding'})<-[:Relationship{name:'The Outline'}]-(p)-[:Relationship{name:'Other names'}]->(x) return x.name skip 1 limit 1"}, {"query": "The following is a list of some of the most popular works by the author of the book, \"The Little Garden of the Tang Dynasty: The Story of the Little Garden of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Tang Dynasty: The Story of the Time: The Time: The Time: The Time: The Time: The Time: The Time", "cypher": "match (n:ENTITY{name:'The peach blossoms in the garden, sometimes with a hangover'})-[:Relationship*1..2]->(x) where x.name<>'Don, please.' return distinct x.name"}]