[{"query": "I'm not sure what kind of job Kong Min-jung does.", "cypher": "match (:ENTITY{name:'The first was the Korean War.'})<-[:Relationship{name:'Chinese name'}]-(m)-[:Relationship{name:'Professional life'}]->(p) return p.name order by p.name limit 3"}, {"query": "The 2.5% of the total amount of the liquid is used in the suspension of the micro-capsule.", "cypher": "match(:ENTITY{name:'2.5%The net suspension of the microcapsule'})-[:Relationship{name:'Manufacturer'}]-> (q) return q.name"}, {"query": "What are the game labels for each game? Please sort by the number of labels from small to large.", "cypher": "match (n:ENTITY{name:'Artillery raids2The Unbeatable'})-[:Relationship{name:'Date of release'}]->(:ENTITY)<-[:Relationship{name:'Date of release'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "Can you give me an example of five famous alumni of this school? This school is a historic key secondary school in Yao City, the famous secondary school in Yao City, Yang Han Yun Secondary School.", "cypher": "match (q:ENTITY{name:'The historic key secondary school in Yaound\u00e9, the famous secondary school in Yaound\u00e9\u2014\u2014The Chinese government has been trying to stop the spread of the virus.'})<-[:Describe{name:'Describe'}]-(n)-[:Relationship{name:'Famous alumni'}]->(m) return m.name order by m.name limit 5"}, {"query": "I'm not sure what I'm going to do if I get a job that three British people would do.", "cypher": "match (:ENTITY{name:'The United Kingdom'})<-[:Relationship{name:'Nationality'}]-(m)-[:Relationship{name:'Professional life'}]->(h) return distinct h.name limit 3"}, {"query": "I'm not sure what you mean by \"stop\" but I'm not sure what you mean by \"stop\".", "cypher": "match (:ENTITY{name:'The mother stops'})<-[:Relationship{name:'Chinese name'}]-(n)-[:Relationship{name:'Interpretation of words'}]->(q) return distinct q.name"}, {"query": "The following literary works are in the context of the two-tier relationship between Snow Revival and the events of the 18th and 19th of this month.", "cypher": "match (n:ENTITY{name:'The snowfall on the 18th and 29th of the month of November has caused more than a few deaths.'})-[:Relationship*1..2]->(x) where x.name<>'Literature and culture' return distinct x.name"}, {"query": "The book was published in the United States by the publisher of The King's Glory.", "cypher": "match (:ENTITY{name:'The Glory of the King Co-authored'})<-[:Relationship{name:'Written by'}]-(n)-[:Relationship{name:'Publishing house'}]->(q) return distinct q.name limit 2"}, {"query": "The following is a list of information about the relationship between the two sides of the Shining, who is a Chinese police officer.", "cypher": "match (n:ENTITY{name:'Snowfall'})-[:Relationship*1..2]->(x) where x.name<>'Chinese police' return distinct x.name"}, {"query": "Please tell me 10 of the main achievements of this celebrity, whose most representative work is the rap and theater art overview.", "cypher": "match (:ENTITY{name:'The art of rapping and theatre'})<-[:Relationship{name:'Representative works'}]-(q)-[:Relationship{name:'Major achievements'}]->(p) return p.name order by p.name limit 10"}, {"query": "The secret of the grave is the Book. He is the priceless.", "cypher": "match (:ENTITY{name:'The Secret of the Grave'})<-[:Relationship{name:'Title'}]-(n)-[:Relationship{name:'Pricing'}]->(q) return distinct q.name"}, {"query": "I'm not sure if you're familiar with the story of the two young men who were in a relationship.", "cypher": "match (n:ENTITY{name:'Blue and blue'})-[:Relationship*1..2]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "What are the different labels of the films that are available on the same company as the first love fighter? Please list them by the number of labels of each film, from small to large.", "cypher": "match (n:ENTITY{name:'The first-time fighter'})-[:Relationship{name:'Production company'}]->(:ENTITY)<-[:Relationship{name:'Production company'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The film is about a young boy who is forced to grow up in a house full of problems.", "cypher": "match (:ENTITY{name:'Growing Up in Trouble'})<-[:Relationship{name:'Chinese name'}]-(p)-[:Relationship{name:'Starring'}]->(n) return distinct n.name"}, {"query": "Find 10 totally free mobile games.", "cypher": "match (:ENTITY{name:'Completely free'})<-[:Relationship{name:'Costs'}]- (mn) -[:Tag{name:'The label'}]->(n:ENTITY{name:'Mobile games'}) return mn.name limit 10"}, {"query": "Ask about the personal profile of the two-tiered relationship that Lonsaki Tulov, played by actor Yoshida Doudeng, has.", "cypher": "match (n:ENTITY{name:'The first was the Japanese.'})-[*1..2]->(x) where x.name<>'The actor is Zhou Yida.' return distinct x.name"}, {"query": "Please help me to introduce you to the 10 places to visit in Jilin Province, in the city of Matsuhara, in the province of Jilin.", "cypher": "match (:ENTITY{name:'Ryu-shi County, Matsunaga City, Jilin Province'})<-[:Relationship{name:'Geographical location'}]-(h)-[:Relationship{name:'Famous places'}]->(n) where n.name <> 'The east wall, the west wall, the north wall, the south wall' return distinct n.name limit 10"}, {"query": "Ask Hegland if his name is Kim.", "cypher": "match (:ENTITY{name:'The Hegland'})<-[:Relationship{name:'Other names'}]- (x) return x.name"}, {"query": "Which comedy action films has Martin Blaster been involved in producing?", "cypher": "match (p:ENTITY{name:'Comedy The Movement'})<--(x)-->(q:ENTITY{name:'Martin, what's going on?\u00b7The Brest'}) return x.name", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 91 (offset: 90))\n\"PROFILE match (p:ENTITY{name:'Comedy The Movement'})<--(x)-->(q:ENTITY{name:'Martin, what's going on?\u00b7The Brest'}) return x.name\"\n                                                                                           ^"}, {"query": "Where is the area of the natural village of Pingping Qingjiang? And what is the license plate code of this place? Tell me again about the main industry of this place.", "cypher": "match (:ENTITY{name:'The natural village of Plain Peak'})-[:Relationship{name:'Area'}]->(n) return n.name as name union all match (:ENTITY{name:'The natural village of Plain Peak'})-[:Relationship{name:'License number'}]->(m) return m.name as name union all match (:ENTITY{name:'The natural village of Plain Peak'})-[:Relationship{name:'Main industries'}]->(r) return r.name as name"}, {"query": "The main achievement of the author is the novel \"The Love of the Midnight\".", "cypher": "match (:ENTITY{name:'The middle novel is called \"The Love of the Afternoon\".'})<-[:Relationship{name:'Major achievements'}]- (n) return n.name order by n.name limit 3"}, {"query": "The Chinese Taiwanese and Malaysian citizens are all cooks.", "cypher": "match (:ENTITY{name:'Malaysia, China and Taiwan'})<-[:Relationship{name:'Nationality'}]-(m)-[:Relationship{name:'Professional life'}]->(x) return distinct x.name"}, {"query": "Please provide 10 book titles in 310,000 words.", "cypher": "match (:ENTITY{name:'310000'})<-[:Relationship{name:'The word count'}]- (m) return m.name limit 10"}, {"query": "The book is based on the life of a young man who was killed in a car accident in the early 1990s.", "cypher": "match(:ENTITY{name:'1/7The game of recovery'})-[:Relationship{name:'Publishing house'}]-> (m) return m.name"}, {"query": "I'm going to tell you about the five levels of relationships that are relevant to the mother of Lord Moon.", "cypher": "match (n:ENTITY{name:'Come on now.'})-[*1..5]->(x) where x.name<>'The Lord of the Moon' return distinct x.name limit 5"}, {"query": "I'm looking for a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new book, a new, a new book, a new book, a new, a new book, a new, a new, a new book, a new, a new, a new, a new book, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new, a new.", "cypher": "match (:ENTITY{name:'The last of the fairies, the noble wife'})--(m) with m order by m.name where m.name <> 'All day long' return distinct m.name limit 4"}, {"query": "I'm not sure how much you know about Jia Jiacom.", "cypher": "match (h:ENTITY{name:'The Jia Jia Commission'})--(p) return p.name skip 1"}, {"query": "You went to the bookstore and checked the publication date of this book on foreign fairy tales, thank you.", "cypher": "match(:ENTITY{name:'The history of foreign fairy tales'})-[:Relationship{name:'Date of publication'}]-> (h) return h.name"}, {"query": "The three main departments of the school, which specialize in the three areas of the province of Guizhou, are not listed in the list of mechanical engineering and clothing.", "cypher": "match (n:ENTITY{name:'Vocational training in the province of Bagan'})-[:Relationship{name:'Main Faculty'}]->(h) where h.name <> 'Mechanical power' and h.name <> 'Clothing' return distinct h.name limit 3"}, {"query": "The director of this exclusive documentary about the Hobbit, the Hobbit, has 10 things to say about the film:", "cypher": "match (:ENTITY{name:'The Hobbit is a documentary'})-[:Relationship{name:'Director'}]-> (n) with n order by n.name return n.name limit 10"}, {"query": "What are the songs that are as long as the song and the longer the sweeter the song, and are they labeled with the same number of tags? Show me the number of labels from more to less.", "cypher": "match (n:ENTITY{name:'The longer the sweeter'})-[:Relationship{name:'Song length'}]->(:ENTITY)<-[:Relationship{name:'Song length'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "If you want to attend the 2011 CCTV China Summit, check the date to plan ahead.", "cypher": "match(m:ENTITY{name:'2011Year of birthCCTVSummit of public companies in China'})-[:Relationship{name:'Date of the event'}]-> (n) return n.name"}, {"query": "The 10 professional departments of the Sichuan Wenchuan Vocational College were recommended, but the management engineering college was not included.", "cypher": "match (:ENTITY{name:'Sichuan Literary and Professional College is located in Changzhou, Sichuan Province, in the city of Daegu, Sichuan Province.2013The year of approval, the Ministry of Education filed a full-time private general higher education school.'})<-[:Describe{name:'Describe'}]-(m)-[:Relationship{name:'Main Faculty'}]->(n) where n.name <> 'School of Management Engineering' return distinct n.name limit 10"}, {"query": "Help me find three bamboo letters next to each other and the structure up and down.", "cypher": "match (:ENTITY{name:'Bamboo'}) <- [:Relationship{name:'Chief of Staff'}]-(m), (m) - [:Relationship{name:'Structure'}]->(n) where n.name='up and down Structure' return distinct m.name limit 3"}, {"query": "Help me find out all the information about Wang Iron.", "cypher": "match (n:ENTITY{name:'King of Iron[Vice-chairman of the Standing Committee of the Henan Provincial People's Congress]'})--(x) return distinct x.name", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 115 (offset: 114))\n\"PROFILE match (n:ENTITY{name:'King of Iron[Vice-chairman of the Standing Committee of the Henan Provincial People's Congress]'})--(x) return distinct x.name\"\n                                                                                                                   ^"}, {"query": "I'm not sure who the person who gave the cold voice to the moon is.", "cypher": "match (:ENTITY{name:'The cold of the moon'})<-[:Relationship{name:'Identity'}]-(x),(x)-[:Relationship{name:'Sound'}]->(q) return distinct q.name"}, {"query": "Please help me find books by Sun Yat-sen and tell me their publisher.", "cypher": "match (:ENTITY{name:'Sunny Co-authored'})<-[:Relationship{name:'Written by'}]-(h),(h)-[:Relationship{name:'Publishing house'}]->(q) return distinct h.name,q.name"}, {"query": "What job did the person born in 1942 give me five", "cypher": "match (:ENTITY{name:'1942Year of birth'})<-[:Relationship{name:'Date of birth'}]-(h)-[:Relationship{name:'Professional life'}]->(q) return distinct q.name limit 5"}, {"query": "The Great Wall of China is a monument to the history of the city.", "cypher": "match (:ENTITY{name:'The Great Wall of China[The poetry of Yang Guang]'})-[:Relationship{name:'Date of creation'}]-> (m) return distinct m.name"}, {"query": "Please give me 10 tags for the Shandong University Sports Carnival.", "cypher": "match (:ENTITY{name:'Shandong University Sports Carnival is being held in Shandong.'})-[:Tag{name:'The label'}]-> (q) return  distinct q.name limit 10"}, {"query": "Which asteroids and asteroid 8216 have the same discoverer and what labels do they have? Tell me the order in order of the number of labels for each asteroid.", "cypher": "match (n:ENTITY{name:'The asteroid8216'})-[:Relationship{name:'The discoverer'}]->(:ENTITY)<-[:Relationship{name:'The discoverer'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "There is a school that requires TOEFL, SSAT and telephone interviews, and one of its famous alumni is Mitt Romney.", "cypher": "match (:ENTITY{name:'The following is a list of the top 10 places to visit in Turkey:SSATGrades, phone interviews and more'})<-[:Relationship{name:'Requirements'}]-(q),(q)-[:Relationship{name:'Famous alumni'}]->(m) where m.name <> 'Mitt Romney' return distinct m.name limit 5"}, {"query": "Please list three of the areas of application for the substance described in the article.", "cypher": "match (:ENTITY{name:'An antimatter is the anti-state of normal matter.'})<-[:Describe{name:'Describe'}]-(x)-[:Relationship{name:'Scope of application'}]->(p) return p.name order by p.name limit 3"}, {"query": "Please help me find three of Yang's most iconic works.", "cypher": "match(:ENTITY{name:'The Ganges[Mainland Chinese actor]'})-[:Relationship{name:'Representative works'}]-> (n) return n.name limit 3"}, {"query": "The recipe for this delicacy was explained in detail in 5 articles. It requires ingredients like peanut butter, yellow bean paste, sugar, low-fat flour, whole eggs, milk, butter, and a little soda.", "cypher": "match (:ENTITY{name:'The ingredients are peanut butter, peanut butter, sugar, low-fat flour, whole eggs, milk, butter, and a little soda.'})<-[:Describe{name:'Describe'}]-(h),(h)-[:Relationship{name:'How to Act'}]->(m) return m.name order by m.name limit 5"}, {"query": "What are the main achievements of the editorial team of the series \"China Reform and Development\"?", "cypher": "match (:ENTITY{name:'1942Year of birth9Moon-soo, Shandong Bo-hing, university culture, CPC member, former manager of the Bo-hing County Economic Development Investment Company, Shandong Province, deputy secretary of the party group, senior political engineer (now retired), special editor of the series of books by Liu Xiaobo on China's reform and development.'})<-[:Describe{name:'Describe'}]-(q),(q)-[:Relationship{name:'Major achievements'}]->(h) return distinct h.name", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 344 (offset: 343))\n\"PROFILE match (:ENTITY{name:'1942Year of birth9Moon-soo, Shandong Bo-hing, university culture, CPC member, former manager of the Bo-hing County Economic Development Investment Company, Shandong Province, deputy secretary of the party group, senior political engineer (now retired), special editor of the series of books by Liu Xiaobo on China's reform and development.'})<-[:Describe{name:'Describe'}]-(q),(q)-[:Relationship{name:'Major achievements'}]->(h) return distinct h.name\"\n                                                                                                                                                                                                                                                                                                                                                        ^"}, {"query": "Which novels are in the same category as The Mirror's Night Journey? What are the labels for each? Please list them in order of number of labels, from small to large.", "cypher": "match (n:ENTITY{name:'The film is a nighttime journey.'})-[:Relationship{name:'Type of'}]->(:ENTITY)<-[:Relationship{name:'Type of'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The building of the temple in the Gothic style is a matter of great interest to the people of the region.", "cypher": "match (n:ENTITY{name:'The Temple of the Mountain of Milk'})-[:Relationship*]->(x) where x.name<>'Gothic' return distinct x.name"}, {"query": "The author of the article, who is a member of the family of the accused, asked:", "cypher": "match (:ENTITY{name:'The family of the wrongdoer'})<-[:Relationship{name:'Representative works'}]- (p) return p.name"}, {"query": "The Chinese website started with eight non-verbal works.", "cypher": "match (:ENTITY{name:'Starting with the Chinese Web'})<--(m), (m)-->(n) where n.name<>'The Word' return distinct m.name limit 8"}, {"query": "Wang Bingfeng has three other achievements besides being the person responsible for the advanced land management in Huanggang City.", "cypher": "match (:ENTITY{name:'King Bingbing'})<-[:Relationship{name:'Chinese name'}]-(q)-[:Relationship{name:'Major achievements'}]->(n) where n.name <> 'Advanced land management in Huanggang City' return distinct n.name limit 3"}, {"query": "I would like to know the main achievements of this teacher and researcher.", "cypher": "match (:ENTITY{name:'Teaching and research workers'})<-[:Relationship{name:'Professional life'}]-(m)-[:Relationship{name:'Major achievements'}]->(x) return x.name skip 2 limit 5"}, {"query": "The following is a list of five personal information in the five levels of relationship of sports personality Midori Kimura.", "cypher": "match (n:ENTITY{name:'The Japanese'})-[*1..5]->(x) where x.name<>'Sports figures' return distinct x.name limit 5"}, {"query": "What asteroids are associated with asteroid 4996 and what are their respective labels? Please list them in order of number of asteroid labels.", "cypher": "match (n:ENTITY{name:'The asteroid4996'})-[:Relationship{name:'The discoverer'}]->(:ENTITY)<-[:Relationship{name:'The discoverer'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "I'm not sure what kind of job a Chinese person would do.", "cypher": "match (:ENTITY{name:'China'})<-[:Relationship{name:'Nationality'}]-(h)-[:Relationship{name:'Professional life'}]->(m) return distinct m.name limit 1"}, {"query": "The book is called The Pity Arrow.", "cypher": "match (:ENTITY{name:'The Arrow of Grief'})<-[:Relationship{name:'Title'}]-(n)-[:Relationship{name:'Pricing'}]->(q) return distinct q.name"}, {"query": "Please find out if you have more than 14 years of experience in forex gold trading or a 1-4 level relationship with Liu Yue Hua, the best trainer in Forex and Asian Forex Network.", "cypher": "match (n:ENTITY{name:'The Chinese'})-[*1..4]->(x) where x.name<>'There are more14The report also highlights the importance of the exchange rate.2007~2009Three years in a rowCCTVSecurities news channel invites online traders 2007~2009Three years in a rowCCTVThe best trainers in the field of foreign exchange are the Securities News Channel, the Newsroom, the Financial Channel, the Forex Market Dispute, the Forex Exchange, the Asian Forex Network.' return distinct x.name limit 5"}, {"query": "I want 5 tips on how to play the game within the 2nd level of the Fantastic Four.", "cypher": "match (n:ENTITY{name:'The Knights of the Flaming Dragon'})-[:Relationship*1..22]->(x) where x.name<>'The game of wisdom' return distinct x.name limit 5"}, {"query": "I'm not sure if you can tell me the inside story of the three-tier relationship between Yuri and Yumi.", "cypher": "match (n:ENTITY{name:'The memory\u00b715 and 6'})-[*1..3]->(x) where x.name<>'The Irrational' return distinct x.name"}, {"query": "Can you tell me the English name of the fox subject, \"Fox\"?", "cypher": "match (:ENTITY{name:'Foxes'})<-[:Relationship{name:'Family'}]-(q)-[:Relationship{name:'English name'}]->(p) return distinct p.name limit 1"}, {"query": "I have a problem finding three Lin Min-shui non-citizens with relevant information about China.", "cypher": "match (:ENTITY{name:'The spring of Linmun'})--(m) with m order by m.name where m.name <> 'China' return distinct m.name limit 3"}, {"query": "The administrative district of the town is 88.1 square kilometers, how much more can it be? I want to know 3 types.", "cypher": "match (:ENTITY{name:'Village'})<-[:Relationship{name:'Category of administrative district'}]-(x),(x)-[:Relationship{name:'Area'}]->(n) where n.name <> '88.1square kilometers' return distinct n.name limit 3"}, {"query": "The following is a list of all the resources for Lake Okeechobee, a flat-topped mountain with a subtropical monsoon climate.", "cypher": "match (n:ENTITY{name:'Lake of the Plains'})-[:Relationship*]->(x) where x.name<>'Subtropical monsoon climate' return distinct x.name"}, {"query": "I would like to know the other 4 information in the 2nd level of this game.", "cypher": "match (:ENTITY{name:'The Age of the Estate'})-[:Relationship*1..2]-(p) where p.name <> 'The game' return p.name limit 4"}, {"query": "He was the first student of the Shanghai Foreign Language University's Suzhou River Bay Experiment Middle School to win the 2016 8th grade district test in Mathematics. He also received five other awards.", "cypher": "match (:ENTITY{name:'Shanghai University of Foreign Languages and the Su River Bay Experimental Secondary School'})<-[:Relationship{name:'Chinese name'}]-(h),(h)-[:Relationship{name:'Main awards'}]->(p) where p.name <> '2016First place in the district-wide maths test for year eight' return distinct p.name limit 5"}, {"query": "What chemical has a molecular weight of 192? Give me four.", "cypher": "match (:ENTITY{name:'192'})<-[:Relationship{name:'Molecular weight'}]- (p) return p.name limit 4"}, {"query": "What are the tags of these people? Please sort them out in order of number of tags.", "cypher": "match (n:ENTITY{name:'Qualter Daniel'})-[:Relationship{name:'Height'}]->(:ENTITY)<-[:Relationship{name:'Height'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "I'm not sure if you're interested in the artwork, but I'm not sure if you're interested in the artwork.", "cypher": "match (:ENTITY{name:'The Blue Sand'})<-[:Relationship{name:'Chinese name'}]-(p),(p)-[:Relationship{name:'Representative works'}]->(q) return distinct q.name"}, {"query": "I'm not sure if you're familiar with the film, but I'm curious to know what other works the director has.", "cypher": "match (q:ENTITY{name:'The Yellow Dragon'})<-[:Relationship{name:'Director'}]- (x) return x.name"}, {"query": "Please list three characters represented in Violet Noziere's work.", "cypher": "match (:ENTITY{name:'Violet The Nozier'}) <- [:Relationship{name:'Representative works'}]- (p) return distinct p.name limit 3"}, {"query": "The project is a collaboration between the two companies, and is a collaboration between the two companies.", "cypher": "match (n:ENTITY{name:'A return to the mountain'})-[:Relationship*1..3]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "The book is priced at $2.99 per book.", "cypher": "match (:ENTITY{name:'Design and reconstruction'})<-[:Relationship{name:'Title'}]-(n)-[:Relationship{name:'Pricing'}]->(q) return distinct q.name limit 3"}, {"query": "I would like to know what works have the same price as the ones in the catalogue and what their respective labels are? Please show me in order of number of labels.", "cypher": "match (n:ENTITY{name:'The Dr. Jung is dying.'})-[:Relationship{name:'Pricing'}]->(:ENTITY)<-[:Relationship{name:'Pricing'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Which books have the same literary genre as the novel and have different labels? Show me how many of these books are in order of number of labels.", "cypher": "match (n:ENTITY{name:'Princess of the Common People'})-[:Relationship{name:'Literary genre'}]->(:ENTITY)<-[:Relationship{name:'Literary genre'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "I want to repeat the work topic All the materials of the work of Yomiuri Tenjudo.", "cypher": "match (n:ENTITY{name:'The mountain is not perfect; The Day of the Front'}) - [:Relationship*]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "Tell me about the three positions of the Standing Committee of the Communist Party of China's Xi'an City Anhui District Commission.", "cypher": "match (:ENTITY{name:'Standing Committee of the Chiang Kai-shek District Commission'})--(x) return  distinct x.name limit 3"}, {"query": "Let's work out the molecular weight of Botzoomi together.", "cypher": "match(:ENTITY{name:'I'm not going to tell you.'})-[:Relationship{name:'Molecular weight'}]-> (h) return h.name", "error": "Invalid input 'm': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 31 (offset: 30))\n\"PROFILE match(:ENTITY{name:'I'm not going to tell you.'})-[:Relationship{name:'Molecular weight'}]-> (h) return h.name\"\n                               ^"}, {"query": "The author of the novel, who is the author of the song \"Kyu Kyung Sang-Shan\", is a Japanese writer who writes in Korean.", "cypher": "match(n:ENTITY{name:'The Good Witch[Humor17KThe theme song]'})-[:Relationship{name:'The word'}]-> (q) return q.name"}, {"query": "Find five people born in 1886 who are not collectors.", "cypher": "match (:ENTITY{name:'1886Year of birth'})<-[:Relationship{name:'Date of birth'}]-(x),(x)-[:Relationship{name:'Professional life'}]->(q) where q.name <> 'The collector' return distinct q.name limit 5"}, {"query": "The film is based on the novel of the same name by the writer and director of the film, Li Taebong.", "cypher": "match (n:ENTITY{name:'The gift of Uncle Li'})-[:Relationship*1..3]->(x) where x.name<>'The Way of the King' return distinct x.name"}, {"query": "Tell me how the earth was formed.", "cypher": "match (:ENTITY{name:'The mud'})<-[:Relationship{name:'Chinese name'}]-(p)-[:Relationship{name:'The shape'}]->(n) return distinct n.name"}, {"query": "Find 32 books for children to enlighten: information about the work within the three-layer relationship of the fairy tale.", "cypher": "match (n:ENTITY{name:'Children's educational books: fairy tales of the living'})-[:Relationship*1..3]->(x) where x.name<>'32' return distinct x.name", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 40 (offset: 39))\n\"PROFILE match (n:ENTITY{name:'Children's educational books: fairy tales of the living'})-[:Relationship*1..3]->(x) where x.name<>'32' return distinct x.name\"\n                                        ^"}, {"query": "Please provide two publications priced at 70 USD", "cypher": "match (:ENTITY{name:'70Japanese yen'})<-[:Relationship{name:'Pricing'}]-(x),(x)-[:Relationship{name:'Title'}]->(q) return distinct q.name limit 2"}, {"query": "You know Wang Zi6? I need 10 more information on the 2nd layer besides the water dragon character.", "cypher": "match (:ENTITY{name:'King of the Six'})-[*1..2]->(p) where p.name <> 'The waterfall is spreading' return  p.name limit 10"}, {"query": "Tell me one profession this man has.", "cypher": "match (:ENTITY{name:'The man'})<-[:Relationship{name:'Gender and race'}]-(n),(n)-[:Relationship{name:'Professional life'}]->(q) return q.name skip 2 limit 1"}, {"query": "Help me find the melting point and the water solubility of the acetaminophen.", "cypher": "match (:ENTITY{name:'The Amine'})-[:Relationship{name:'The point of no return'}]->(n) return n.name as name union all match (:ENTITY{name:'The Amine'})-[:Relationship{name:'Solubility in water'}]->(m) return m.name as name"}, {"query": "Do you know the first three words of the name of the production company and the full name of the production company of the TV series \"The Hunger Games\"?", "cypher": "MATCH (n:ENTITY{name:'The War of the Ring[2004Year of birthMBCTelevision series]'})-[:Relationship{name:'Publishing company'}]->(m) RETURN m.name,substring(m.name,0,3)"}, {"query": "Do you know any professions in Shaanxi? Please tell me 5 of them.", "cypher": "match (:ENTITY{name:'The Chinese'})<-[:Relationship{name:'Chinese name'}]-(p),(p)-[:Relationship{name:'Professional life'}]->(x) return x.name order by x.name limit 5"}, {"query": "Chinese male entertainers helped me find 20 of them.", "cypher": "match (:ENTITY{name:'China'})<-[:Relationship{name:'Nationality'}]- (mn) -[:Relationship{name:'Gender and race'}]->(n:ENTITY{name:'The man'}) return mn.name limit 20 "}, {"query": "The answer is that the polycystic group has a three-layer relationship to osteochondrosis of the elderly.", "cypher": "match (n:ENTITY{name:'Osteofibromatosis'})-[:Relationship*1..3]->(x) where x.name<>'The old man' return distinct x.name"}]