[{"query": "Please list one person born in 1974 and one representative work owned by this person.", "cypher": "match (:ENTITY{name:'1974Year of birth'})<-[:Relationship{name:'Date of birth'}]-(q),(q)-[:Relationship{name:'Representative works'}]->(n) return q.name,n.name skip 2 limit 1"}, {"query": "I'm not sure if you're familiar with the Chicago Bulls.", "cypher": "match (:ENTITY{name:'The Chicago Bulls'})<--(n) return n.name"}, {"query": "The article is about the five best Chinese wine brands.", "cypher": "match (n:ENTITY{name:'The Day of the Lord'})-[:Relationship*]->(x) where x.name<>'You are faithful.' return distinct x.name limit 5"}, {"query": "The film is based on the novel of the same name by the Chinese writer, who also wrote the screenplay for the film.", "cypher": "match (n:ENTITY{name:'The three rainforests in Huangcheng County'})-[*1..4]->(x) where x.name<>'Oh, my God.' return distinct x.name limit 5"}, {"query": "The following is a list of the works by the Japanese artist and composer, who are known for their work in the genre of Kintetsu-Tsujin.", "cypher": "match (n:ENTITY{name:'The fire in Kintetsu'})-[:Relationship*1..2]->(x) where x.name<>'The Seven' return distinct x.name"}, {"query": "Check out the 2012 Shanghai Air Purification and Dust Removal Technology Equipment Exhibition in China.", "cypher": "match(:ENTITY{name:'2012Shanghai Air Purification and Dust Removal Technology Equipment Exhibition in China'})-[:Relationship{name:'Industry'}]-> (m) return m.name"}, {"query": "The company is based in Wanda Square in Beijing's Stone Mountain.", "cypher": "match (:ENTITY{name:'Wanda Square on the Stone Mountain in Beijing'})<-[:Relationship{name:'Location'}]- (m) return m.name"}, {"query": "I'm looking for a game that can be played on the Internet, but I'm not sure if I can find it.", "cypher": "match (n:ENTITY{name:'Escape from the Tomb'})-[:Relationship*1..2]->(x) where x.name<>'The Intelligent Class' return distinct x.name"}, {"query": "I'm looking for a book by Satoshi Miyamoto that was published by a top publisher.", "cypher": "match (p:ENTITY{name:'The edge publishers'})<--(x)-->(q:ENTITY{name:'My friend Satoshi.'}) return x.name"}, {"query": "I'm not sure if you're familiar with the book, but I'm not sure if you're familiar with the book, but I'm not sure if you're familiar with the book.", "cypher": "match (:ENTITY{name:'The author of the online novel, The Fall of the Flying Dragon, has abandoned the text.'})<-[:Describe{name:'Describe'}]-(m),(m)-[:Relationship{name:'Type of work'}]->(n) return distinct n.name"}, {"query": "I would like to know about the other four levels of the Goldman Sachs Group Limited in New York.", "cypher": "match (:ENTITY{name:'The Gosset Group Limited'})-[:Relationship*1..2]-(p) where p.name <> 'New York City' return p.name limit 4"}, {"query": "Asteroid 2111 and which asteroids were discovered by one discoverer, what labels did each of those asteroids have? Show them to me in reverse order of number of labels.", "cypher": "match (n:ENTITY{name:'The asteroid2111'})-[:Relationship{name:'The discoverer'}]->(:ENTITY)<-[:Relationship{name:'The discoverer'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "I'm looking for a book about the relationship between parents and their children, and I'm looking for a book about the relationship between parents and their children.", "cypher": "match (n:ENTITY{name:'Teaching children not to yell: Parenting without getting angry'})-[:Relationship*1..2]->(x) where x.name<>'See you in the morning.' return distinct x.name"}, {"query": "The archaeological site of the ruins of Anyang City, Henan Province, lists 20 species of archaeological remains.", "cypher": "match (:ENTITY{name:'Ruins of Anyang City in Henan Province unearthed'})<-[:Relationship{name:'Point of landing'}]->(n) where n is not null return distinct n.name limit 20"}, {"query": "What is the most representative work of \u014cta-no-Fumi?", "cypher": "match (:ENTITY{name:'\u306b\u3057\u3060\u307e\u3055\u3075\u307f'})<-[:Relationship{name:'Foreign language name'}]-(x),(x)-[:Relationship{name:'Representative works'}]->(m) return distinct m.name"}, {"query": "The following is a list of Chinese language software relatives that are called calculators.", "cypher": "match (n:ENTITY{name:'Relatives call the calculator'})-[:Relationship*1..2]->(x) where x.name<>'Chinese' return distinct x.name"}, {"query": "What are the different labels of the games? Please sort by the number of labels from small to large.", "cypher": "match (n:ENTITY{name:'The Red Apple of the Rhino'})-[:Relationship{name:'Type of'}]->(:ENTITY)<-[:Relationship{name:'Type of'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "Please tell me who has created the calligraphy of Liu Liang Jiang.", "cypher": "match (:ENTITY{name:'The calligraphy of Liu Lingjiang'})--(q) return q.name order by q.name"}, {"query": "The law firm is a subsidiary of the Beijing Xu Xiaoming Law Firm, which is a law firm under the jurisdiction of the Ministry of Justice.", "cypher": "match (n:ENTITY{name:'Beijing Xu Xiao Ming Law Firm'})-[:Relationship{name:'The Judiciary'}]->(:ENTITY)<-[:Relationship{name:'The Judiciary'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The incident was reported to be a major accident in the city of Guangzhou, China.", "cypher": "match(:ENTITY{name:'1.3The accident at the highway in Kunming'})-[:Relationship{name:'The wounded'}]-> (x) return x.name"}, {"query": "Which people are as tall as Gasparotto Gabriel and have a tattoo? The total number of tattoos is listed in order of size.", "cypher": "match (n:ENTITY{name:'Gasparotto Gabriel'})-[:Relationship{name:'Height'}]->(:ENTITY)<-[:Relationship{name:'Height'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Amamizuka recommended three songs to me that are not in the Spring Festival.", "cypher": "match (:ENTITY{name:'Amamizuka'})<-[:Relationship{name:'Foreign language name'}]-(q),(q)-[:Relationship{name:'Representative works'}]->(h) where h.name <> 'The Chinese New Year' return distinct h.name limit 3"}, {"query": "The Chinese name of this man is Cao Gang-gawa, and his main achievements are:", "cypher": "match (:ENTITY{name:'The first time I saw him.'})<-[:Relationship{name:'Chinese name'}]-(p)-[:Relationship{name:'Major achievements'}]->(q) return distinct q.name"}, {"query": "I'm going to start with a Chinese fantasy novel, please tell me 5 of them.", "cypher": "match (:ENTITY{name:'Starting with the Chinese Web'})<-[:Relationship{name:'Linked site'}]- (mn) -[:Tag{name:'The label'}]->(n:ENTITY{name:'Fantasy and science fiction'}) return mn.name limit 5"}, {"query": "The following is a list of Howard Rosenman's personal information.", "cypher": "match (:ENTITY{name:'Howard Rosenman'})--(n) return n.name skip 1"}, {"query": "Chat Chat Chuang is not counting the other ten achievements, including the avocado garden, the spring flower, the rose, the star, the little lady.", "cypher": "match (:ENTITY{name:'Zhang Chuying'})<-[:Relationship{name:'Chinese name'}]-(n)-[:Relationship{name:'Major achievements'}]->(p) where p.name <> 'The flower of the avocado garden, the spring flower of the flower of the star, the little lady' return distinct p.name limit 10"}, {"query": "I forgot the chemical formula for 3-hydro-4-hydro, so let me think about it.", "cypher": "match(:ENTITY{name:'3-Oh, my God.-4-Oh, my God.'})-[:Relationship{name:'Chemical formula'}]-> (n) return n.name"}, {"query": "The film is based on the life of a young girl named Shia LaBeouf who was killed in a car accident in the early 2000s.", "cypher": "match (n:ENTITY{name:'The light is still there'})-[:Relationship*1..2]->(x) where x.name<>'7 out of 10' return distinct x.name"}, {"query": "The following information is available in the publication Valen Economic Zone Yearbook 2005 No. 17 with no more than three levels of relationships:", "cypher": "match (n:ENTITY{name:'The yearbook of the Valmen Special Economic Zone 2005 The General17Period'})-[:Relationship*1..3]->(x) where x.name<>'Published' return distinct x.name"}, {"query": "The following is a list of characters who are represented by Lucius Fauci:", "cypher": "match (:ENTITY{name:'The story of the woman who was killed'})<-[:Relationship{name:'Representative works'}]- (x) return x.name order by x.name"}, {"query": "The 2010 Chinese Women and Children's State Statistics, which the book says is aimed primarily at women, are:", "cypher": "match(:ENTITY{name:'2010Statistics on the situation of women and children in China'})-[:Relationship{name:'Objects'}]-> (n) return n.name"}, {"query": "Do you know how many words the book \"The Holy Eye Warrior\" has reached?", "cypher": "match(:ENTITY{name:'The Holy Eye Warrior'})-[:Relationship{name:'The word count'}]-> (m) return m.name"}, {"query": "What are the foods that have a sour-sweet taste? Please list 5 of them.", "cypher": "match (:ENTITY{name:'Sour and sweet'})<-[:Relationship{name:'The Taste'}]- (mn) -[:Tag{name:'The label'}]->(n:ENTITY{name:'Dishes'}) return mn.name limit 5"}, {"query": "What are the labels of the people who work with Wang Yan in the same profession? Please show them in order of number of labels.", "cypher": "match (n:ENTITY{name:'The King'})-[:Relationship{name:'Professional life'}]->(:ENTITY)<-[:Relationship{name:'Professional life'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Please help me find out what the theme of the 2006 Hebei International Environmental Protection Technology Equipment Expo is.", "cypher": "match(n:ENTITY{name:'2006Hebei International Environmental Protection Technology and Equipment Fair'})-[:Relationship{name:'The subject'}]-> (x) return x.name"}, {"query": "Tell me about 1999 - the 10th Annual Congress of the Chinese Archaeological Society, a collection of five articles.", "cypher": "match (p:ENTITY{name:'1999-The 10th Annual Meeting of the Chinese Archaeological Society'})--(m) with m order by m.name return distinct m.name skip 1 limit 5"}, {"query": "The following is a list of articles that have been written about the two layers of the relationship between the Moon and the Moon in the book of Kosan Shammei.", "cypher": "match (n:ENTITY{name:'The gift of Koshan in May'})-[:Relationship*1..2]->(x) where x.name<>'The Portuguese' return distinct x.name"}, {"query": "The book is a book about the life of a young man named Rudyard Kipling.", "cypher": "match (:ENTITY{name:'The two brothers were very happy.'})<-[:Relationship{name:'Title'}]-(n)-[:Relationship{name:'Pricing'}]->(q) return distinct q.name"}, {"query": "I was asked to list a volunteer service station at Northeastern Electricity University.", "cypher": "match (:ENTITY{name:'Volunteer service station at Northeastern Electricity University'})--(m) return  distinct m.name limit 1"}, {"query": "I'm not sure what other companies have labels for the same place as Beijing Dragon Wrestling and Security Prevention Technology Co., Ltd.", "cypher": "match (n:ENTITY{name:'Beijing Dragon Martial Arts and Security Prevention Technology Co., Ltd.'})-[:Relationship{name:'Location'}]->(:ENTITY)<-[:Relationship{name:'Location'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The first thing I want to do is write down all the information about the other name of the aromatic aluminate.", "cypher": "match (n:ENTITY{name:'Allyl alcohol'})-[:Relationship*]->(x) where x.name<>'The taste' return distinct x.name"}, {"query": "The publisher is an electronic industry publisher, so please find the 6 information in the 3 layers of this book.", "cypher": "match (:ENTITY{name:'Useful4017Numerical counter utility circuits180Examples'})-[*1..3]-(p) where p.name <> 'Published by Electronic Industries' return distinct p.name limit 6"}, {"query": "The University of Bologna recommends 10 different departments in addition to the Department of Chemistry.", "cypher": "match (:ENTITY{name:'The Power of Righteousness The School of Education'})<-[:Relationship{name:'Schooling'}]-(n),(n)-[:Relationship{name:'Main Faculty'}]->(p) where p.name <> 'Chemistry' return distinct p.name limit 10"}, {"query": "Who are the people with the same nationality as the Yomiuri? What are their labels? Please list them by number of labels from small to large.", "cypher": "match (n:ENTITY{name:'The Japanese'})-[:Relationship{name:'Nationality'}]->(:ENTITY)<-[:Relationship{name:'Nationality'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "Do you know what her main works are? She is a purple sandstone artist, ceramicist, artisanal artist of national level, famous ceramicist.", "cypher": "match (:ENTITY{name:'The artist is a Chinese artist, a ceramicist, a national level artisan, a famous ceramicist.'})<-[:Describe{name:'Describe'}]-(q)-[:Relationship{name:'Representative works'}]->(m) return distinct m.name"}, {"query": "Help me find five volumes of lyric poetry.", "cypher": "match (:ENTITY{name:'The Book of Poetry'})<-[:Relationship{name:'Origin of the work'}]-(m) return distinct m.name limit 5"}, {"query": "I'm interested in the game, but I'm not sure if I can get a sense of where Marvel's Future Battle is, what genre it is and what kind of content it's about.", "cypher": "match (:ENTITY{name:'Marvel's future is at stake'})-[:Relationship{name:'Area'}]->(n) return n.name as name union all match (:ENTITY{name:'Marvel's future is at stake'})-[:Relationship{name:'Game type'}]->(m) return m.name as name union all match (:ENTITY{name:'Marvel's future is at stake'})-[:Relationship{name:'The content'}]->(r) return r.name as name", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 37 (offset: 36))\n\"PROFILE match (:ENTITY{name:'Marvel's future is at stake'})-[:Relationship{name:'Area'}]->(n) return n.name as name union all match (:ENTITY{name:'Marvel's future is at stake'})-[:Relationship{name:'Game type'}]->(m) return m.name as name union all match (:ENTITY{name:'Marvel's future is at stake'})-[:Relationship{name:'The content'}]->(r) return r.name as name\"\n                                     ^"}, {"query": "I'm not sure if you're familiar with the term \"metallic acid\" or \"metallic acid\".", "cypher": "match (:ENTITY{name:'Methyl acrylate trioxide'})--(n) with n order by n.name return n.name"}, {"query": "I want to know which professors are in China? Please list me 5 of them.", "cypher": "match (p:ENTITY{name:'Professor'})<--(x)-->(q:ENTITY{name:'China'}) return x.name limit 5"}, {"query": "What are the labels of these people, and where was Mineo's birthplace? Please find out how many of them are in order of the number of labels.", "cypher": "match (n:ENTITY{name:'Minayoshi'})-[:Relationship{name:'Where I was born'}]->(:ENTITY)<-[:Relationship{name:'Where I was born'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "I want to know who is the best actress at the Berlin International Film Festival.", "cypher": "match (:ENTITY{name:'Best Actress at the Berlin International Film Festival'})--(n) return n.name skip 1"}, {"query": "I need information on the two-tier relationship between the works of Huang and the poetry of Han Fuchun.", "cypher": "match (n:ENTITY{name:'The theme of the song is \"Hong Kong Poetry\".'})-[*1..2]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "The two-tiered relationship between the two is related to the rainfall in the late afternoon in Denpo.", "cypher": "match (n:ENTITY{name:'The rain in the evening'})-[*1..2]->(x) where x.name<>'The world is full of it.' return distinct x.name"}, {"query": "Help me find two long novels by Yu Hua.", "cypher": "match (:ENTITY{name:'Yue Hua'})<-[:Relationship{name:'Written by'}]-(m), (m)-[:Relationship{name:'Literary genre'}]->(n) where n.name='The Long Novel' return distinct m.name limit 2"}, {"query": "I want to be a Wuhan University graduate with major achievements.", "cypher": "match (:ENTITY{name:'The University of Wuhan'})<-[:Relationship{name:'Graduated'}]-(m)-[:Relationship{name:'Major achievements'}]->(x) return distinct x.name limit 1"}, {"query": "Find me three films directed by Li Zhensheng", "cypher": "match (:ENTITY{name:'Li Zhensheng'})<-[:Relationship{name:'Director'}]-(n)-[:Relationship{name:'Chinese name'}]->(q) return distinct q.name limit 3"}, {"query": "What do you know about this book? Help me find the other four in the 2nd layer.", "cypher": "match (:ENTITY{name:'The Four Seasons of Tang'})-[:Relationship*1..2]-(p) where p.name <> 'Books and books' return p.name limit 4"}, {"query": "What chemical boils at 114-115\u00b0C?", "cypher": "match (:ENTITY{name:'114-115oC'})<-[:Relationship{name:'Boiling point'}]- (p) return p.name"}, {"query": "The following is a list of the main achievements of the Yusof Yan family:", "cypher": "match (:ENTITY{name:'The birth of Xu'})<-[:Relationship{name:'Chinese name'}]-(q),(q)-[:Relationship{name:'Major achievements'}]->(m) return distinct q.name"}, {"query": "I would like to know the name of the person and the main works of the author.", "cypher": "match (:ENTITY{name:'The Penguins'})-[:Relationship{name:'The times in which'}]->(n) return n.name as name union all match (:ENTITY{name:'The Penguins'})-[:Relationship{name:'Title'}]->(m) return m.name as name union all match (:ENTITY{name:'The Penguins'})-[:Relationship{name:'Major works'}]->(r) return r.name as name"}, {"query": "Help me find three representative works of art by Ryu Yayoi", "cypher": "match (:ENTITY{name:'The food is delicious.'})-[:Relationship{name:'Representative works'}]-> (m) return distinct m.name limit 3"}, {"query": "I'm not sure which street the three and garden community belongs to.", "cypher": "match(:ENTITY{name:'Three and Garden Community'})-[:Relationship{name:'Affiliated'}]-> (m) return m.name"}, {"query": "The following is a list of three professions in which Jiangsu Yangyang can be active apart from being a strategist:", "cypher": "match (:ENTITY{name:'The city of Yangyang, Jiangsu Province'})<-[:Relationship{name:'Where I was born'}]-(q)-[:Relationship{name:'Professional life'}]->(x) where x.name <> 'The strategist' return distinct x.name limit 3"}, {"query": "The school was founded in 1229 and has four main faculties.", "cypher": "match (:ENTITY{name:'1229Year of birth'})<-[:Relationship{name:'When did it start?'}]-(n)-[:Relationship{name:'Main Faculty'}]->(p) return distinct p.name"}, {"query": "I'm going to be a little bit more specific about the three layers of relationships between Wang Zhou and the artwork.", "cypher": "match (n:ENTITY{name:'The Great Cedar Cedar'})-[:Relationship*1..3]->(x) where x.name<>'The King' return distinct x.name"}, {"query": "I'm not sure if there are any American horror movies out there.", "cypher": "match (:ENTITY{name:'The United States'})<-[:Relationship{name:'Production areas'}]- (mn) -[:Tag{name:'The label'}]->(n:ENTITY{name:'Surprise film'}) return mn.name  limit 20"}, {"query": "Trouble Row lists five fantasy novels that are available on the Linx City reading link site.", "cypher": "match (:ENTITY{name:'Reading in the city'})<-[:Relationship{name:'Linked site'}]- (mn) -[:Tag{name:'The label'}]->(n:ENTITY{name:'Fantasy and science fiction'}) return mn.name limit 5"}, {"query": "Tell me what the word for today is.", "cypher": "match (:ENTITY{name:'This afternoon.'})<-[:Relationship{name:'Real name'}]-(h),(h)-[:Relationship{name:'Title'}]->(m) return distinct m.name limit 1"}, {"query": "I'm going to be the director of the secondary school chemistry experiment by Yu-Rung Zhang, and I'm going to study the three-tier relationship.", "cypher": "match (n:ENTITY{name:'Secondary school chemical experimental research'})-[:Relationship*1..3]->(x) where x.name<>'Ren Yu-Red Zhang Ziyi' return distinct x.name"}, {"query": "I'm not sure if I'm going to be able to do it, but I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to try to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it, and I'm going to do it.", "cypher": "match (n:ENTITY{name:'The Feyong'})-[:Relationship{name:'Representative works'}]->(h) with h order by h.name where h.name <> 'The chickens grow up to be chickens.' and h.name <> 'The mother in my heart' return h.name limit 1"}, {"query": "The following is a list of the topics covered in the book:", "cypher": "match (n:ENTITY{name:'The Blow'})-[:Relationship*1..2]->(x) where x.name<>'Literary works' return distinct x.name"}, {"query": "Which software's tagline is \"I'm here\"?", "cypher": "match (:ENTITY{name:'I'm here'})<-[:Relationship{name:'The software password'}]- (n) return distinct n.name", "error": "Invalid input 'm': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 32 (offset: 31))\n\"PROFILE match (:ENTITY{name:'I'm here'})<-[:Relationship{name:'The software password'}]- (n) return distinct n.name\"\n                                ^"}, {"query": "The Intel Mercedes 3 933EB (box) is a Chinese car that was designed by Intel in the late 1980s.", "cypher": "match (:ENTITY{name:'Intel The Mercedes3 933EB(The box)'})<-[:Relationship{name:'Chinese name'}]-(x),(x)-[:Tag{name:'The label'}]->(n) return distinct n.name limit 1"}, {"query": "Please tag the road collapse in Taihuahua on 12.26", "cypher": "match (:ENTITY{name:'12.26Road collapse in Taipei'})-[:Tag{name:'The label'}]-> (h) with h order by h.name return h.name"}, {"query": "I accidentally learned about Zhang Lianying's ball-throwing incident at the World Table Tennis Championships in Yokohama, and in order to make the game more enjoyable, you can give me three more details about it.", "cypher": "match (n:ENTITY{name:'Zhang Liying to allow ball incident'})-->(h) with h order by h.name where h.name <> 'The World Table Tennis Championships in Yokohama' and h.name <> 'To make the game more enjoyable' return h.name limit 3"}, {"query": "The song is sung by a group of musicians from the city of Turku, who are the songwriters, composers and lyricists of the song.", "cypher": "match (:ENTITY{name:'The Turks are defeated.'})-[:Relationship{name:'The word'}]->(n) return n.name as name union all match (:ENTITY{name:'The Turks are defeated.'})-[:Relationship{name:'Music'}]->(m) return m.name as name union all match (:ENTITY{name:'The Turks are defeated.'})-[:Relationship{name:'Composed'}]->(r) return r.name as name"}, {"query": "Help me find three films by director Wouter.", "cypher": "match (:ENTITY{name:'The Wool Whisperer'})<-[:Relationship{name:'Director'}]-(m) return distinct m.name limit 3"}, {"query": "The date of birth and nationality of Wang Rin Sung.", "cypher": "match (x:ENTITY{name:'The King'}),(x)-[:Relationship{name:'Date of birth'}]-> (m), (x)-[:Relationship{name:'Ethnicity'}]->(n) return m.name,n.name"}, {"query": "I want to know about the next rebirth novel, \"Jumen Yang Killing Two\".", "cypher": "match (n:ENTITY{name:'Zhu Men is killed'})-[:Relationship*1..2]->(x) where x.name<>'Reborn' return distinct x.name"}, {"query": "Please help me find 5 books for $13 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'13.00Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Please tell me about the main department of the School of Architecture and Construction in Zhuzhou District, Taizhou City.", "cypher": "match (:ENTITY{name:'The School of Architecture and Construction in Zhuzhou District, Chengde City'})-[:Relationship{name:'Main Faculty'}]-> (x) return  distinct x.name limit 3"}, {"query": "Who is a professional and what are their respective labels? Please list them in order of number of labels.", "cypher": "match (n:ENTITY{name:'The newly-founded'})-[:Relationship{name:'Professional life'}]->(:ENTITY)<-[:Relationship{name:'Professional life'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Who wrote the song \"My Daughter Is So Terrible\" ?", "cypher": "match (:ENTITY{name:'My daughter is so miserable.'})<-[:Relationship{name:'Representative works'}]-(m) return distinct m.name"}, {"query": "Help me find three other representative works of Liu Jing, other than the Wolf of War.", "cypher": "match (n:ENTITY{name:'The Chinese[Mainland Chinese actor, director]'}) - [:Relationship{name:'Representative works'}]->(h) with h order by h.name where h.name <> 'The Wolf' and h.name <> 'The WolfII' return h.name limit 3"}, {"query": "Please help me find out which album this song is from.", "cypher": "match (:ENTITY{name:'The funeral of the hero'})<-[:Relationship{name:'Chinese name'}]-(x),(x)-[:Relationship{name:'Album by'}]->(q) return distinct q.name"}, {"query": "I'm not sure how many of these devices you know about that don't have a display.", "cypher": "match (:ENTITY{name:'No'})<-[:Relationship{name:'The screen'}]- (h) return h.name limit 3"}, {"query": "I'm going to find three private research universities for me.", "cypher": "match (:ENTITY{name:'Private research universities'})<-[:Relationship{name:'Category'}]-(p)-[:Relationship{name:'Chinese name'}]->(n) return distinct n.name limit 3"}, {"query": "What are some of the main achievements of Kim Mei-young? Please tell me one.", "cypher": "match (:ENTITY{name:'The beauty of the water'})<-[:Relationship{name:'Chinese name'}]-(n),(n)-[:Relationship{name:'Major achievements'}]->(q) return q.name order by q.name limit 1"}, {"query": "The book is available in the review material for the 2011-2012 Securities Investment Analysis on-boarding exam question book.", "cypher": "match(:ENTITY{name:'2011-2012The yearly stock investment analysis online exam question book'})-[:Relationship{name:'Pricing'}]-> (n) return n.name"}, {"query": "I wanted to see what modern revisionist novels Cha Chao-ching has written.", "cypher": "match (p:ENTITY{name:'Modern Rectification'})<--(x)-->(q:ENTITY{name:'The Courage'}) return x.name"}, {"query": "Check out what the rare foreign name in the past is called and where it originated.", "cypher": "match (:ENTITY{name:'The past'})-[:Relationship{name:'Foreign language name'}]->(n) return n.name as name union all match (:ENTITY{name:'The past'})-[:Relationship{name:'Origin of the work'}]->(m) return m.name as name"}, {"query": "Can you describe the three-tiered relationships that are associated with the term \"belly yellow\" for me?", "cypher": "match (n:ENTITY{name:'Yellow fever'})-[*1..3]->(x) where x.name<>'Life terms' return distinct x.name"}, {"query": "The following is a list of the top 10 most popular Chinese political figures in the world:", "cypher": "match (n:ENTITY{name:'Yusmin'})-[*1..4]->(x) where x.name<>'Political figures' return distinct x.name"}, {"query": "Share your story about the award.", "cypher": "match (n:ENTITY{name:'The Chinese'})--(m) return m.name skip 5"}, {"query": "Please tell me what company is this in Beijing, Beijing, Beijing, Beijing, Shanghai, Shanghai, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, Beijing, and other places.", "cypher": "match (:ENTITY{name:'Beijing city, B Street, in the Soyang District6The number4Layers'})<-[:Relationship{name:'Address'}]- (n) return n.name"}, {"query": "The children of the school are being taught to be kind and to be kind.", "cypher": "match (:ENTITY{name:'Children's nursery'})--(n) return n.name skip 2", "error": "Invalid input 's': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \",\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CONTAINS\"\n  \"ENDS\"\n  \"IN\"\n  \"IS\"\n  \"OR\"\n  \"STARTS\"\n  \"XOR\"\n  \"^\"\n  \"}\" (line 1, column 39 (offset: 38))\n\"PROFILE match (:ENTITY{name:'Children's nursery'})--(n) return n.name skip 2\"\n                                       ^"}, {"query": "The following is a list of the three levels of relationship in the work of the artist.", "cypher": "match (n:ENTITY{name:'And the Chinese people are in the snow.'})-[:Relationship*1..2]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "I want to tell you some news about HB.", "cypher": "match (:ENTITY{name:'HB'})--(p) return p.name skip 3"}, {"query": "Do you have a five-line rhyme for the morning? Help me find ten.", "cypher": "match (:ENTITY{name:'The Sunrise'})<-[:Relationship{name:'Date of creation'}]- (mn) -[:Relationship{name:'Literary genre'}]->(n:ENTITY{name:'The five-word rhyme'}) return mn.name limit 10"}, {"query": "Please name some of the major awards that have been given to works in the White language.", "cypher": "match (m:ENTITY{name:'The Chinese'})<-[:Relationship{name:'White language'}]-(q),(q)-[:Relationship{name:'Main awards'}]->(h) return h.name skip 3 limit 10"}, {"query": "What are the names of the people who graduated from the same university as Wang Zi? What are the labels of these people? Please list them in order of their number of labels from small to large.", "cypher": "match (n:ENTITY{name:'The list of the winners'})-[:Relationship{name:'Graduated'}]->(:ENTITY)<-[:Relationship{name:'Graduated'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The first is that the political figures who give gifts to the people of Akisama are people who are in the two-tier relationship.", "cypher": "match (n:ENTITY{name:'The Giver of the Ashish Road'})-[:Relationship*1..2]->(x) where x.name<>'Political figures' return distinct x.name"}, {"query": "Please tell me the nationality of Mr. Ikeda and the date of birth and death.", "cypher": "match (:ENTITY{name:'I was so happy.'})-[:Relationship{name:'Nationality'}]->(n) return n.name as name union all match (:ENTITY{name:'I was so happy.'})-[:Relationship{name:'Date of birth'}]->(m) return m.name as name union all match (:ENTITY{name:'I was so happy.'})-[:Relationship{name:'Date of death'}]->(r) return r.name as name"}, {"query": "3 pieces of information for 0-3 year olds - Animals and the environment - You guessed it - Fun cognitive - Rainbow Folding Book - Volume 2", "cypher": "match (:ENTITY{name:'0~3Age-Animals and the Environment-And what is the knowledge of the Hereafter?-Rainbow Folding the Book-The first2The album'})--(m) with m order by m.name return distinct m.name skip 1 limit 3"}, {"query": "Please help me find out 5 other information about the horror movie killer girls in the second floor of the dormitory.", "cypher": "match (:ENTITY{name:'Murdered in the dorm of a girl'})-[:Relationship*1..2]-(p) where p.name <> 'Surprise film' return p.name limit 5"}]