[{"query": "Did you know that the coal mine accident in Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, Sunnyside, on on on on on on on on on on on on on on on on on on on on on on on on on on on on on on on a Sunnyside, is a Sunnyside, is a Sunnyside, Sunnyside, is a Sunnyside, Sunnyside, is a Sunnyside, Sunnyside, is a Sunnyside, on a Sunnyside is a Sunnyside is a Sunnyside is a Sunnyside is a Sunnyside is a Sunnyside is a Sunny.", "cypher": "match (:ENTITY{name:'Sun Zhao Township Sun Zhao Coal Mine in Shincheng County'})<-[:Relationship{name:'Location'}]- (p) return distinct p.name"}, {"query": "Do you know his 5 main achievements? He is Park Jung-hyun, No. 1 in the tree, North Korean Qin Shan-do, also known as Kochi Sung-young.", "cypher": "match (:ENTITY{name:'Park Jong-hyun, also known as Kim Jong-hyun, is a North Korean singer.'})<-[:Describe{name:'Describe'}]-(x),(x)-[:Relationship{name:'Major achievements'}]->(q) return q.name order by q.name limit 5"}, {"query": "Please help me find out what kind of buildings are in the East Wing Gardens.", "cypher": "match (:ENTITY{name:'The East Wing'})-[:Relationship{name:'Type of building'}]-> (m) with m order by m.name return m.name"}, {"query": "Please list the schools and the primary schools that are of the same school type and what are their labels. Please list them in order of number of labels for each school.", "cypher": "match (n:ENTITY{name:'Primary School'})-[:Relationship{name:'Type of school'}]->(:ENTITY)<-[:Relationship{name:'Type of school'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "The project is a collaboration between the two artists, who have been working together since the beginning of the project.", "cypher": "match (n:ENTITY{name:'The next day, the monkey was seen fasting and was seen by the people.'})-[:Relationship*1..3]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "The first book of the series, The Book of the Dead, was published in the United States in the year 2000.", "cypher": "match (:ENTITY{name:'Guo Ru'})<-[:Relationship{name:'Other names'}]-(m)-[:Relationship{name:'Major works'}]->(q) return distinct m.name,q.name"}, {"query": "I need information about the work of Huang Junsuo's Chiang Kai-shek, which is not above two levels of relationship.", "cypher": "match (n:ENTITY{name:'The Queen of the Spring'})-[:Relationship*1..2]->(x) where x.name<>'The Left' return distinct x.name"}, {"query": "Check the calendar to see what day December 19, 1999 was on Sunday.", "cypher": "match(q:ENTITY{name:'1999Year of birth12The Moon19The Sun'})-[:Relationship{name:'The week'}]-> (p) return p.name"}, {"query": "Please tell me which works are by the same author as the Fourth and Fourth Quotations, and what labels are on each of them? Please list them in order of number of labels.", "cypher": "match (n:ENTITY{name:'The Second Book of Kings'})-[:Relationship{name:'Written by'}]->(:ENTITY)<-[:Relationship{name:'Written by'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "Who and what are the labels of each of them? Please show them in order of number of labels.", "cypher": "match (n:ENTITY{name:'Yellow fever'})-[:Relationship{name:'Professional life'}]->(:ENTITY)<-[:Relationship{name:'Professional life'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The Japanese are known for their Japanese-Japanese language, but they are also known for their Japanese-Japanese language.", "cypher": "match (:ENTITY{name:'Kyoto, Japan'})<-[:Relationship{name:'The Nation'}]-(m),(m)-[:Relationship{name:'Sound'}]->(h) where h.name <> 'The island must be beautiful' return distinct h.name limit 10"}, {"query": "I need to know 5 things about Seong-jo Jeong.", "cypher": "match (:ENTITY{name:'Seong-jo Jeong'})--(m) return  distinct m.name limit 5"}, {"query": "I have a lot of pieces priced the same as my architectural tour, and they have different brick labels.", "cypher": "match (n:ENTITY{name:'My journey to building a harmonious mother'})-[:Relationship{name:'Pricing'}]->(:ENTITY)<-[:Relationship{name:'Pricing'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "What is the same as the eleven nine-year-old works of the Moon Ballad, and what are their labels? List them in order of number of labels for me.", "cypher": "match (n:ENTITY{name:'The Moon Moon is a string of 11 beads.9'})-[:Relationship{name:'The year'}]->(:ENTITY)<-[:Relationship{name:'The year'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Help me find five species of plants.", "cypher": "match (:ENTITY{name:'The Coconut TreeSterculiaceae(This is a very good article.)'})<-[:Relationship{name:'The Department'}]-(m) return distinct m.name limit 5"}, {"query": "Give me three antibiotics and describe them.", "cypher": "match (:ENTITY{name:'Antibiotics'})<-[:Relationship*]-(m), (m)-[:Describe{name:'Describe'}]->(n) return  distinct m.name,n.name limit 3"}, {"query": "The exhibition is a great opportunity to learn about the benefits of outdoor products, outdoor equipment, outdoor industry and more.", "cypher": "match (:ENTITY{name:'Outdoor products, outdoor equipment, outdoor industry and more'})<-[:Relationship{name:'The main'}]-(x)-[:Relationship{name:'The advantages of the exhibition'}]->(h) return distinct h.name"}, {"query": "The following is a list of the topics covered in the book:", "cypher": "match (n:ENTITY{name:'The Ancient Grave'})-[:Relationship*1..2]->(x) where x.name<>'North and South' return distinct x.name"}, {"query": "Name the main award received by a school in the East District of the city of Yerevan.", "cypher": "match (:ENTITY{name:'The experimental middle school in the eastern district of Imersa'})-[:Relationship{name:'Main awards'}]-> (q) return  distinct q.name limit 1"}, {"query": "What books and what labels are there for each book? List them from most to least according to the number of labels for each book.", "cypher": "match (n:ENTITY{name:'The Bean-Old Man'})-[:Relationship{name:'Publishing house'}]->(:ENTITY)<-[:Relationship{name:'Publishing house'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The book is a collection of poems written by the poet and poetess, who is also a writer.", "cypher": "match (n:ENTITY{name:'The first is the book of Proverbs.'})-[:Relationship*1..3]->(x) where x.name<>'The channel' return distinct x.name"}, {"query": "Do you know about the Battle of Ming Dynasty? What other information besides what happened in Shanxi Dynasty, please find the other 7 information in layer 2", "cypher": "match (:ENTITY{name:'The Battle of Ming Dynasty'})-[:Relationship*1..2]->(p) where p.name <> 'The Sansi District' return  p.name limit 7"}, {"query": "The following is a selection of the Chinese medical classics by Zhang Yuxiang: Information on the two-tier relationship between theories of typhoid fever.", "cypher": "match (n:ENTITY{name:'Selected titles: The cold theory'})-[:Relationship*1..2]->(x) where x.name<>'Zhang Yue' return distinct x.name"}, {"query": "I'm looking for someone who can find me a Capricorn and provide me with three of their major works.", "cypher": "match (:ENTITY{name:'The Giant'})<-[:Relationship{name:'The constellations'}]-(h)-[:Relationship{name:'Major works'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "The following is a list of the three-tiered relationships between the long-suffering nightingale and the evening flowering plant.", "cypher": "match (n:ENTITY{name:'The Nightingale; The evening dew'}) - [*1..3]->(x) where x.name <>'The End of the World' return distinct x.name"}, {"query": "I'm going to find out 10 things about Wang Xuanhua in 2 layers, graduated from National Central University, this information I know.", "cypher": "match (:ENTITY{name:'The King is honored'})-[*1..2]->(p) where p.name <> 'The National Central University' return p.name limit 10"}, {"query": "What songs are as long as the Peach Sisters and what are their labels? List them in order of number of labels.", "cypher": "match (n:ENTITY{name:'The Peach Sisters'})-[:Relationship{name:'Song length'}]->(:ENTITY)<-[:Relationship{name:'Song length'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "I'm going to give you four science fiction movies, tell me when they're coming out.", "cypher": "match (:ENTITY{name:'The science fiction'})<-[:Relationship*]-(m), (m)-[:Relationship{name:'The show time'}]->(n) return m.name,n.name limit 4"}, {"query": "Can you tell me how many people have been in the movie \"The Big Bang Theory\" by Choi Ma Bollie?", "cypher": "match (:ENTITY{name:'The film is being made by the Chinese company.'})--(n) return n.name order by n.name"}, {"query": "The game is based on the game of the same name, which is based on the game of the same name.", "cypher": "match (n:ENTITY{name:'The mountain of Xinjiang'})-[:Relationship*1..2]->(x) where x.name<>'The Sun' return distinct x.name"}, {"query": "You know that citizenship is outside China, and that's 8 information in the 4th tier of the military.", "cypher": "match (:ENTITY{name:'The Second Army'})-[*1..4]-(p) where p.name <> 'China' return distinct p.name limit 8"}, {"query": "I'm not sure what the name of the land is that has a family-owned farm.", "cypher": "match (:ENTITY{name:'The family farm'})<-[:Relationship{name:'The Law'}]- (p) return p.name"}, {"query": "In addition to 42 bucks for one book, find out 6 more about me in this book by Bumblebee Jun.", "cypher": "match (n:ENTITY{name:'I am the day that is coming.'})-->(h) with h order by h.name where h.name <> '42Japanese yen' and h.name <> 'The Bear Bear Cloud' return h.name limit 6"}, {"query": "I am not sure if you are aware of the fact that the film is based on a true story.", "cypher": "match (n:ENTITY{name:'The return of the Gujarat police'})-[:Relationship*1..2]->(x) where x.name<>'Oh, my God.' return distinct x.name"}, {"query": "Do you know Laurent Ban? Please tell me about him.", "cypher": "match (:ENTITY{name:'Laurent Ban'})--(m) return m.name skip 1"}, {"query": "The main characters of the 2015 Japanese film \"Coffee by the Sea\" [Sozumi-Sohmi, starring Yuna B\u014dmei] are:", "cypher": "match (n:ENTITY{name:'Coffee house by the beach[Japanese2015The film starring Bomi, Satsumi and Sato]'})-[:Relationship{name:'Starring'}]->(h) where h.name <> 'I'm not sure.' and h.name <> 'The beauty of the world' return distinct h.name limit 2", "error": "Invalid input 'm': expected\n  \"!=\"\n  \"%\"\n  \"*\"\n  \"+\"\n  \"-\"\n  \"/\"\n  \"::\"\n  \"<\"\n  \"<=\"\n  \"<>\"\n  \"=\"\n  \"=~\"\n  \">\"\n  \">=\"\n  \"AND\"\n  \"CALL\"\n  \"CONTAINS\"\n  \"CREATE\"\n  \"DELETE\"\n  \"DETACH\"\n  \"ENDS\"\n  \"FOREACH\"\n  \"IN\"\n  \"INSERT\"\n  \"IS\"\n  \"LOAD\"\n  \"MATCH\"\n  \"MERGE\"\n  \"NODETACH\"\n  \"OPTIONAL\"\n  \"OR\"\n  \"REMOVE\"\n  \"RETURN\"\n  \"SET\"\n  \"STARTS\"\n  \"UNION\"\n  \"UNWIND\"\n  \"USE\"\n  \"WITH\"\n  \"XOR\"\n  \"^\"\n  <EOF> (line 1, column 171 (offset: 170))\n\"PROFILE match (n:ENTITY{name:'Coffee house by the beach[Japanese2015The film starring Bomi, Satsumi and Sato]'})-[:Relationship{name:'Starring'}]->(h) where h.name <> 'I'm not sure.' and h.name <> 'The beauty of the world' return distinct h.name limit 2\"\n                                                                                                                                                                           ^"}, {"query": "What do you know about the moniker 02LF\u00d703F?", "cypher": "match (:ENTITY{name:'02LF\u00d703F'})--(x) with x order by x.name where x.name <> 'Proper nouns' return x.name"}, {"query": "The following is a brief description of the three-tiered relationship between sports personality Ito Ichinose and his personal life:", "cypher": "match (n:ENTITY{name:'The real Ito'})-[*1..3]->(x) where x.name<>'Sports figures' return distinct x.name"}, {"query": "I'm not sure what the job of men is.", "cypher": "match (:ENTITY{name:'The man'})<-[:Relationship{name:'Gender and race'}]-(m)-[:Relationship{name:'Professional life'}]->(q) return distinct q.name limit 1"}, {"query": "I want to drink the wine of the gift of the Lord, and I want to write five poems in gratitude.", "cypher": "match (n:ENTITY{name:'The wine of the gift is to make drunk, and the song of thanksgiving.'})-[:Relationship*]->(x) where x.name<>'Don, please.' return distinct x.name limit 5"}, {"query": "Which asteroids and asteroid 5093 were discovered by the same discoverer and what are their respective labels? Find the asteroids in order of how many labels they have.", "cypher": "match (n:ENTITY{name:'The asteroid5093'})-[:Relationship{name:'The discoverer'}]->(:ENTITY)<-[:Relationship{name:'The discoverer'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "The book published by the Economic Science Press introduced me to two books.", "cypher": "match (:ENTITY{name:'The publisher of Economic Science'})<-[:Relationship{name:'Publishing house'}]-(p)-[:Relationship{name:'Title'}]->(n) return distinct n.name limit 2"}, {"query": "Give me the molecular weight of 4-aceto-2-methionine, which I need to use for calculations now.", "cypher": "match(:ENTITY{name:'4-B-oxide-2-Oh, my God.'})-[:Relationship{name:'Molecular weight'}]-> (p) return p.name"}, {"query": "The problem is asking where Hugo was born, when he was born, where he graduated from high school.", "cypher": "match (:ENTITY{name:'The Hugo'})-[:Relationship{name:'Where I was born'}]->(n) return n.name as name union all match (:ENTITY{name:'The Hugo'})-[:Relationship{name:'Graduated'}]->(m) return m.name as name union all match (:ENTITY{name:'The Hugo'})-[:Relationship{name:'Date of birth'}]->(r) return r.name as name"}, {"query": "I'm going to start with a list of five Chinese online games that are athletic.", "cypher": "match (:ENTITY{name:'Starting with the Chinese Web'})<--(m), (m)-->(n) where n.name='Games and Competitions' return distinct m.name limit 5"}, {"query": "I'm going to ask you to give me a personal profile of the three-tier relationship of the village secretary, Mr. Tsuerugan.", "cypher": "match (n:ENTITY{name:'The Root of the Cork Tree'})-[:Relationship*1..3]->(x) where x.name<>'Village clerk' return distinct x.name"}, {"query": "I would like to know what events are planned for the 2012 Baidu Festival in the city of Huangdi.", "cypher": "match(:ENTITY{name:'2012The festival of Baidu in honor of the Yellow Emperor'})-[:Relationship{name:'Content of the event'}]-> (q) return q.name"}, {"query": "I'm not sure what the name of the work by Ken Ben-Ping is, but I'm wondering what the name of the work is.", "cypher": "match (:ENTITY{name:'The child is flat, the child is flat.'})<-[:Relationship{name:'Written by'}]- (h) return h.name"}, {"query": "I heard that the 17th Shanghai Kitchenware Expo was held, so I went to see it too.", "cypher": "match(:ENTITY{name:'17The Shanghai Kitchen Show'})-[:Relationship{name:'Location'}]-> (q) return q.name"}, {"query": "I want to know if you have any information about the tag for Liu Wenwei? I want three tags besides the economic and the political ones.", "cypher": "match (n:ENTITY{name:'The Chinese'})-[:Tag{name:'The label'}]->(h) with h order by h.name where h.name <> 'The economy' and h.name <> 'Characters' return h.name limit 3"}, {"query": "I'm not sure if you can check all the information about the maintenance of the car on the 10th of December.", "cypher": "match (n:ENTITY{name:'The car is in good condition.'})-[:Relationship*]->(x) where x.name<>'13' return distinct x.name"}, {"query": "I want to see the rest of the work in the Tomb of Zhou Wenling, with no more than three layers of relationships.", "cypher": "match (n:ENTITY{name:'The Mausoleum'})-[:Relationship*1..3]->(x) where x.name<>'The Moon' return distinct x.name"}, {"query": "The school was founded in 1902; its main department was established in 2001.", "cypher": "match (:ENTITY{name:'1902School year;2001Founded in'})<-[:Relationship{name:'When did it start?'}]-(q),(q)-[:Relationship{name:'Main Faculty'}]->(p) return distinct p.name"}, {"query": "The book is written by a young man named Yuri, who is a student of the University of Tokyo.", "cypher": "match (:ENTITY{name:'The Roof[The poetry of Cao Cao]'})-[:Relationship{name:'Date of creation'}]->(n) return n.name as name union all match (:ENTITY{name:'The Roof[The poetry of Cao Cao]'})-[:Relationship{name:'Written by'}]->(m) return m.name as name"}, {"query": "What is the synonym of the word \"simplified\"?", "cypher": "match (:ENTITY{name:'The price is right.'})-[:Relationship{name:'The synonym'}]->(n) return n.name"}, {"query": "Help me find five of Cao's paintings.", "cypher": "match (:ENTITY{name:'Cao planted'})<-[:Relationship{name:'Written by'}]-(m) return distinct m.name limit 5"}, {"query": "Help me find a drug for the polysaccharide hormone.", "cypher": "match (:ENTITY{name:'Polysorbate'})<-[:Relationship{name:'Type of'}]-(m) return distinct m.name limit 1"}, {"query": "Please help me find five books for $100 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'100.00Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 5"}, {"query": "Do you know about the main award of this school in the national key town of Zhejiang, Sichuan Province? Please give me 5 articles.", "cypher": "match (:ENTITY{name:'The school is located in the Sichuan province of Sichuan.The DifferenceIt is a national key town in the Zhejiang River Delta.The city is a mixed-use community.'}) <-[:Describe{name:'Describe'}]-(q)-[:Relationship{name:'Main awards'}]->(p) return p.name order by p.name limit 5"}, {"query": "Please list me the three main departments of the Jilin Academy of Animation's Film and Television Drama School.", "cypher": "match (:ENTITY{name:'Film and TV drama school at Jilin Animation Academy'})-[:Relationship{name:'Main Faculty'}]-> (p) return  distinct p.name limit 3"}, {"query": "I want a great horror novel with a plot and a cynical doctor with no less than two levels of relationship details.", "cypher": "match (n:ENTITY{name:'The Cygnian'})-[:Relationship*1..2]->(x) where x.name<>'The horror of a perfectly good story' return distinct x.name"}, {"query": "Tell me the Chinese names of the three river umbrellas.", "cypher": "match (:ENTITY{name:'The river is covered with smoke'})-[:Relationship{name:'Chinese name'}]-> (h) with h order by h.name return h.name limit 3"}, {"query": "The following is a list of the top 10 political figures in the country:", "cypher": "match (n:ENTITY{name:'The Marshal'})-[*1..4]->(x) where x.name<>'Political figures' return distinct x.name"}, {"query": "Please help me find three books for $200 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'100.00Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 3"}, {"query": "What are the names of the characters who are in the same rank as Cao Yanbo? What are their respective labels? Please list them in order of their number of labels from small to large.", "cypher": "match (n:ENTITY{name:'Cao was a good man.'})-[:Relationship{name:'Military officer'}]->(:ENTITY)<-[:Relationship{name:'Military officer'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c"}, {"query": "If you are familiar with the online shopping platform 5054 Mall, tell us about its main business and what its products include.", "cypher": "match(:ENTITY{name:'5054The Mall'})-[:Relationship{name:'The main'}]-> (x) return x.name"}, {"query": "Please list the games in which Gretzky scored a goal.", "cypher": "match (:ENTITY{name:'Gertzer'})<-[:Relationship{name:'Goalkeeper'}]- (p) return distinct p.name"}, {"query": "Please help me find two books for $25.00 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'25.00Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "I'm not sure if you're interested in finding a Mongolian and listing one of his major achievements.", "cypher": "match (x:ENTITY{name:'Mongolian people'})<-[:Relationship{name:'Ethnicity'}]-(q)-[:Relationship{name:'Major achievements'}]->(m) return q.name order by q.name,m.name limit 1"}, {"query": "Please help me find the names of 10 companies in Chengdu.", "cypher": "match (:ENTITY{name:'The capital'})<--(m) ,(m)-[:Relationship{name:'Company name'}]->(n) return n.name limit 10"}, {"query": "The Ming Dynasty was a period of great change in the history of China.", "cypher": "match (:ENTITY{name:'The Ming Dynasty'})-[:Relationship{name:'The year'}]->(n) return n.name as name union all match (:ENTITY{name:'The Ming Dynasty'})-[:Relationship{name:'Written by'}]->(m) return m.name as name"}, {"query": "Which companies and which brands of clothes were founded on the same day as RIZAN SHINA Clothing Ltd. in Manchuria? Please list the companies in order of number of labels, from large to small.", "cypher": "match (n:ENTITY{name:'The company is a subsidiary of the Manchu-based Rizan Shinha Clothing Co., Ltd.'})-[:Relationship{name:'Founded'}]->(:ENTITY)<-[:Relationship{name:'Founded'}]-(m:ENTITY),\n(r:ENTITY)<-[:Tag]-(m:ENTITY) \nreturn m.name, count(r) as c, collect(r.name) \nORDER BY c DESC "}, {"query": "Please help me find two books for $10.8 and tell me when they will be available.", "cypher": "match (:ENTITY{name:'10.8Japanese yen'})<-[:Relationship{name:'Pricing'}]-(h),(h)-[:Relationship{name:'Published'}]->(q) return distinct h.name,q.name limit 2"}, {"query": "I'm not sure what the name of the novel is, but I'm sure it's a novel.", "cypher": "match (:ENTITY{name:'White and white'})<-[:Relationship{name:'CP'}]- (x) return x.name"}, {"query": "Please list the representative works of Fresh Pirates Youth Group.", "cypher": "match (:ENTITY{name:'freshThe Boy Scouts'})-[:Relationship{name:'Representative works'}]-> (x) return  distinct x.name"}, {"query": "Ask for the Si content of a material such as 00Cr25Ni20Nb stainless steel.", "cypher": "match(:ENTITY{name:'00Cr25Ni20NbStainless steel'})-[:Relationship{name:'Oh, my God.Si'}]-> (n) return n.name"}, {"query": "The number of companies in Fujairah is estimated at about 7 million.", "cypher": "match (p:ENTITY{location:'Fujian'}) return count(p)"}, {"query": "Please let me know when the 11th edition of the 2011 Multi-Person Printing and Label Printing Exhibition will be held, I am preparing very early.", "cypher": "match(:ENTITY{name:'201111th Multi-Person Printing and Label Printing Exhibition'})-[:Relationship{name:'Show time'}]-> (q) return q.name"}, {"query": "The school is a great place to learn about the history of the country, and the school is a great place to learn about the history of the country.", "cypher": "match (:ENTITY{name:'Young people have ambitions and achieve their future.'})<-[:Relationship{name:'The teacher quotes'}]-(p),(p)-[:Relationship{name:'Famous alumni'}]->(x) return distinct x.name limit 1"}, {"query": "The molecular formula for S-1-N-O-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-C-O-O-C-O-C-O-O-C-O-O-C-O-O-C-O-O-C-O-O-O-C-O-O-O-O-C-O-O-O-O-O-O-O-C-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-O-", "cypher": "match(:ENTITY{name:'(S)-1-N-Oxytocin based-3-The Penguin'})-[:Relationship{name:'Molecular'}]-> (h) return h.name"}, {"query": "Please list a small and medium-sized profession for me.", "cypher": "match (:ENTITY{name:'Chihiro, the youngest'})-[:Relationship{name:'Professional life'}]-> (q) return  distinct q.name limit 1"}, {"query": "Where is the area of the village of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the port of the", "cypher": "match (:ENTITY{name:'Port of Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, and other cities and towns'})-[:Relationship{name:'Area'}]->(n) return n.name as name union all match (:ENTITY{name:'Port of Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, and other cities and towns'})-[:Relationship{name:'Phone area code'}]->(m) return m.name as name union all match (:ENTITY{name:'Port of Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, Guangzhou, and other cities and towns'})-[:Relationship{name:'Postal area code'}]->(r) return r.name as name"}, {"query": "Recommend 5 other representative actors as witches", "cypher": "match (:ENTITY{name:'Actor'})<-[:Relationship{name:'Professional life'}]-(m)-[:Relationship{name:'Representative works'}]->(h) where h.name <> 'The witch rushed.' return distinct h.name limit 5"}, {"query": "The school, which was founded in 1984, won the main award for its work and told me one thing.", "cypher": "match (:ENTITY{name:'1984Year of birth'})<-[:Relationship{name:'When did it start?'}]-(m),(m)-[:Relationship{name:'Main awards'}]->(q) return q.name skip 3 limit 1"}, {"query": "Please list the first 3 characters.", "cypher": "match (:ENTITY{name:'The film was released on DVD in Japan on December 15, 2010.'})<-[:Relationship{name:'Sound'}]- (p) return p.name order by p.name limit 3"}, {"query": "I learned that the rectangular leafy green belongs to the rat family Li, and is distributed in Guangdong, Anhui, Zhejiang and other places.", "cypher": "match (n:ENTITY{name:'The rectangular leaves are green.'})-->(h) with h order by h.name where h.name <> 'The report also highlighted the need for a new system of taxation for the Chinese economy.' and h.name <> 'The Rat Li Ko' return h.name limit 5"}, {"query": "Please provide two publications priced at 100 yuan", "cypher": "match (:ENTITY{name:'100Japanese yen'})<-[:Relationship{name:'Pricing'}]-(x),(x)-[:Relationship{name:'Title'}]->(q) return distinct q.name limit 2"}]